<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    <meta http-equiv="Content-Language" content="zh-cn">
    <meta charset="utf-8">
    
    
    
    <title>运维发展史 | Deops&#39;s blog | 运维开发工程师</title>
    <meta name="viewport" content="width=device-width,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no">
    
    <meta name="theme-color" content="#77AAFF">
    
    
    <meta name="keywords" content="">
    
    

    

    <!-- Baidu Push -->
<script>
	(function(){
		var bp = document.createElement('script');
		var curProtocol = window.location.protocol.split(':')[0];
		if (curProtocol === 'https') {
			bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';
		}
		else {
			bp.src = 'http://push.zhanzhang.baidu.com/push.js';
		}
		var s = document.getElementsByTagName("script")[0];
		s.parentNode.insertBefore(bp, s);
	})();

	var _hmt = _hmt || [];
</script>



    
    <meta name="description" content="运维岗位历史悠久提到运维很多人可能想到 IT系统的运维，其实运维岗位不仅仅最近几十年才有的工作岗位，大多运维的理念都来自人类医疗界，只不过医生是对人体这个超级复杂系统做运维，运维工程师运维的是IT系统而已。医生通过对生命以及生活的各种观察与衡量来维护生命的正常状态与运行；而运维工程师：通过对系统运行的各种观察与衡量来维护系统的正常状态与运行，如医生通过血常规、尿检等等观测指标再根据历史经验来评估一">
<meta name="keywords" content="Echo">
<meta property="og:type" content="article">
<meta property="og:title" content="运维发展史">
<meta property="og:url" content="https://marnm.github.io/posts/dded0e80/index.html">
<meta property="og:site_name" content="Deops&#39;s blog">
<meta property="og:description" content="运维岗位历史悠久提到运维很多人可能想到 IT系统的运维，其实运维岗位不仅仅最近几十年才有的工作岗位，大多运维的理念都来自人类医疗界，只不过医生是对人体这个超级复杂系统做运维，运维工程师运维的是IT系统而已。医生通过对生命以及生活的各种观察与衡量来维护生命的正常状态与运行；而运维工程师：通过对系统运行的各种观察与衡量来维护系统的正常状态与运行，如医生通过血常规、尿检等等观测指标再根据历史经验来评估一">
<meta property="og:locale" content="zh-Hans">
<meta property="og:updated_time" content="2022-05-26T12:38:03.866Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="运维发展史">
<meta name="twitter:description" content="运维岗位历史悠久提到运维很多人可能想到 IT系统的运维，其实运维岗位不仅仅最近几十年才有的工作岗位，大多运维的理念都来自人类医疗界，只不过医生是对人体这个超级复杂系统做运维，运维工程师运维的是IT系统而已。医生通过对生命以及生活的各种观察与衡量来维护生命的正常状态与运行；而运维工程师：通过对系统运行的各种观察与衡量来维护系统的正常状态与运行，如医生通过血常规、尿检等等观测指标再根据历史经验来评估一">
    
        <link rel="alternate" type="application/atom+xml" title="Deops&#39;s blog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/img/favicon.ico">
    <link id="style" rel="stylesheet" href="/css/style.css?v=3.0">
    <script>window.lazyScripts=[]</script>

    <!-- custom head -->
    
            
</head>

<body>
    <div id="loading" class="active"></div>
    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/img/avatar.gif" alt="avatar">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname" id="name">Echo</h5>
          
            <div id="yiyanmotto" class="motto">&nbsp;</div>
          
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
              <li class="waves-block waves-effect">
                  <a href="/">
                    <i class="icon icon-lg icon-home"></i>
                    <span>主 页</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/archives">
                    <i class="icon icon-lg icon-archives"></i>
                    <span>归 档</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/categories">
                    <i class="icon icon-lg icon-th-list"></i>
                    <span>分 类</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/tags">
                    <i class="icon icon-lg icon-tags"></i>
                    <span>标 签</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/about">
                    <i class="icon icon-lg icon-smile-o"></i>
                    <span>关 于</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
      <div class="nav2">
          
              <a class="nav2item" data-title="Email" href="http://mail.qq.com/cgi-bin/qm_share?t=qm_mailme&email=442KgIbNhZajhYybjoKKj82AjI4" target="_parent" title="Email">
                <i class="icon icon-lg icon-envelope-o envelope-o"></i>
              </a>
          
              <a class="nav2item" data-title="Github" href="https://github.com/Marnm" target="_blank" title="Github">
                <i class="icon icon-lg icon-github github"></i>
              </a>
          
              <a class="nav2item" data-title="我的哔哩哔哩" href="https://space.bilibili.com/31374976" target="_blank" title="我的哔哩哔哩">
                <i class="icon icon-lg icon-tv tv"></i>
              </a>
          

            </div>
        
      </ul>
        
    </div>
  </div>
 
</aside>


    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">运维发展史</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        <a href="../../atom.xml" target="_blank" class="header-icon waves-effect waves-circle waves-light" id="Rss">
            <i class="icon icon-lg icon-rss"></i>
        </a>
    </div>
</header>
<header class="content-header post-header">
    
    
    <div class="container fade-scale">
        <div id="myheader">
            <h1 class="title">
                
            </h1>
            <h5 class="subtitle">
                
                
            </h5>
        </div>
    </div>

</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>TOC</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-3"><a class="post-toc-link" href="#运维岗位历史悠久"><span class="post-toc-number">1.</span> <span class="post-toc-text">运维岗位历史悠久</span></a></li><li class="post-toc-item post-toc-level-3"><a class="post-toc-link" href="#IT运维的发展历程"><span class="post-toc-number">2.</span> <span class="post-toc-text">IT运维的发展历程</span></a></li></ol>
        </nav>
    </aside>
   
<article id="post-运维发展史" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">运维发展史</h1>
        <div class="post-meta">
            <i class="icon icon-lg icon-calendar-o"></i>
            发表于
            <time class="post-time" title="2020-09-26 20:35:45" datetime="2020-09-26T12:35:45.000Z" itemprop="datePublished">2020-09-26</time>

            <br id="mybreak">
            
<script>
	mybreak.style="display:none";
</script>


            <i>·</i>
            

        </div>
        <div class="post-count-custom">
            <i class="icon icon-lg icon-comment-o"></i>
            阅读本文可能花费您&nbsp;<span class="post-count">19</span>&nbsp;分钟
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <h3 id="&#x8FD0;&#x7EF4;&#x5C97;&#x4F4D;&#x5386;&#x53F2;&#x60A0;&#x4E45;"><a href="#&#x8FD0;&#x7EF4;&#x5C97;&#x4F4D;&#x5386;&#x53F2;&#x60A0;&#x4E45;" class="headerlink" title="&#x8FD0;&#x7EF4;&#x5C97;&#x4F4D;&#x5386;&#x53F2;&#x60A0;&#x4E45;"></a>&#x8FD0;&#x7EF4;&#x5C97;&#x4F4D;&#x5386;&#x53F2;&#x60A0;&#x4E45;</h3><p>&#x63D0;&#x5230;&#x8FD0;&#x7EF4;&#x5F88;&#x591A;&#x4EBA;&#x53EF;&#x80FD;&#x60F3;&#x5230; IT&#x7CFB;&#x7EDF;&#x7684;&#x8FD0;&#x7EF4;&#xFF0C;&#x5176;&#x5B9E;&#x8FD0;&#x7EF4;&#x5C97;&#x4F4D;&#x4E0D;&#x4EC5;&#x4EC5;&#x6700;&#x8FD1;&#x51E0;&#x5341;&#x5E74;&#x624D;&#x6709;&#x7684;&#x5DE5;&#x4F5C;&#x5C97;&#x4F4D;&#xFF0C;&#x5927;&#x591A;&#x8FD0;&#x7EF4;&#x7684;&#x7406;&#x5FF5;&#x90FD;&#x6765;&#x81EA;&#x4EBA;&#x7C7B;&#x533B;&#x7597;&#x754C;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x533B;&#x751F;&#x662F;&#x5BF9;&#x4EBA;&#x4F53;&#x8FD9;&#x4E2A;&#x8D85;&#x7EA7;&#x590D;&#x6742;&#x7CFB;&#x7EDF;&#x505A;&#x8FD0;&#x7EF4;&#xFF0C;&#x8FD0;&#x7EF4;&#x5DE5;&#x7A0B;&#x5E08;&#x8FD0;&#x7EF4;&#x7684;&#x662F;IT&#x7CFB;&#x7EDF;&#x800C;&#x5DF2;&#x3002;&#x533B;&#x751F;&#x901A;&#x8FC7;&#x5BF9;&#x751F;&#x547D;&#x4EE5;&#x53CA;&#x751F;&#x6D3B;&#x7684;&#x5404;&#x79CD;&#x89C2;&#x5BDF;&#x4E0E;&#x8861;&#x91CF;&#x6765;&#x7EF4;&#x62A4;&#x751F;&#x547D;&#x7684;&#x6B63;&#x5E38;&#x72B6;&#x6001;&#x4E0E;&#x8FD0;&#x884C;&#xFF1B;&#x800C;&#x8FD0;&#x7EF4;&#x5DE5;&#x7A0B;&#x5E08;&#xFF1A;&#x901A;&#x8FC7;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x7684;&#x5404;&#x79CD;&#x89C2;&#x5BDF;&#x4E0E;&#x8861;&#x91CF;&#x6765;&#x7EF4;&#x62A4;&#x7CFB;&#x7EDF;&#x7684;&#x6B63;&#x5E38;&#x72B6;&#x6001;&#x4E0E;&#x8FD0;&#x884C;&#xFF0C;&#x5982;&#x533B;&#x751F;&#x901A;&#x8FC7;&#x8840;&#x5E38;&#x89C4;&#x3001;&#x5C3F;&#x68C0;&#x7B49;&#x7B49;&#x89C2;&#x6D4B;&#x6307;&#x6807;&#x518D;&#x6839;&#x636E;&#x5386;&#x53F2;&#x7ECF;&#x9A8C;&#x6765;&#x8BC4;&#x4F30;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x8EAB;&#x4F53;&#x72B6;&#x6001;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x6307;&#x6807;KPI&#x53D8;&#x5316;&#x3001;&#x7CFB;&#x7EDF;&#x65E5;&#x5FD7;&#x7684;&#x6839;&#x636E;&#x7ECF;&#x9A8C;&#x627E;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x6765;&#x5B9A;&#x754C;&#x5B9A;&#x4F4D;&#x6545;&#x969C;&#xFF1B;&#x518D;&#x5982;&#x533B;&#x751F;&#x901A;&#x8FC7;X&#x5C04;&#x7EBF;&#x62CD;CT&#x3001;&#x62CD;&#x80F8;&#x7247;&#x6765;&#x900F;&#x89C6;&#x4EBA;&#x4F53;&#x8FDB;&#x4E00;&#x6B65;&#x89C2;&#x6D4B;&#x4EBA;&#x4F53;&#x7EC6;&#x5FAE;&#x53D8;&#x5316;&#x6765;&#x63A8;&#x65AD;&#x75C5;&#x56E0;&#xFF0C;&#x800C;&#x8FD0;&#x7EF4;&#x5DE5;&#x7A0B;&#x5E08;&#x5219;&#x4F1A;&#x628A;&#x6545;&#x969C;&#x5355;&#x5143;suspend&#x4F4F;&#xFF0C;&#x653E;&#x8BCA;&#x65AD;&#x5668;&#x8FDB;&#x884C;&#x8BCA;&#x65AD;&#xFF0C;&#x626B;&#x63CF;&#x5185;&#x5B58;&#x5806;&#x6808;&#x7B49;&#x6545;&#x969C;&#x73B0;&#x573A;&#x4FE1;&#x606F;&#x63A8;&#x5230;&#x51FA;&#x6545;&#x969C;&#x6839;&#x56E0;&#x7B49;&#x7B49;&#xFF0C;&#x5F88;&#x591A;&#x8FD0;&#x7EF4;&#x7406;&#x5FF5;&#x6765;&#x81F3;&#x533B;&#x5B66;&#x754C;&#x3002;&#x4F34;&#x968F;&#x79D1;&#x6280;&#x7684;&#x53D1;&#x5C55;&#x533B;&#x7597;&#x8BCA;&#x65AD;&#x624B;&#x6BB5;&#x5728;&#x4E0D;&#x65AD;&#x6F14;&#x8FDB;&#xFF0C;&#x4E0E;&#x533B;&#x7597;&#x754C;&#x4E00;&#x6837;&#x8FD0;&#x7EF4;&#x4E5F;&#x6709;&#x5176;&#x53D1;&#x5C55;&#x5386;&#x7A0B;&#x3002;</p>
<a id="more"></a>
<h3 id="IT&#x8FD0;&#x7EF4;&#x7684;&#x53D1;&#x5C55;&#x5386;&#x7A0B;"><a href="#IT&#x8FD0;&#x7EF4;&#x7684;&#x53D1;&#x5C55;&#x5386;&#x7A0B;" class="headerlink" title="IT&#x8FD0;&#x7EF4;&#x7684;&#x53D1;&#x5C55;&#x5386;&#x7A0B;"></a>IT&#x8FD0;&#x7EF4;&#x7684;&#x53D1;&#x5C55;&#x5386;&#x7A0B;</h3><p>&#x4E8B;&#x7269;&#x7684;&#x53D1;&#x5C55;&#x4E0D;&#x662F;&#x5B64;&#x7ACB;&#x7684;&#xFF0C;&#x8FD0;&#x7EF4;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#xFF0C;&#x5B83;&#x4E0E;&#x4E1A;&#x754C;&#x7684;&#x6574;&#x4E2A;&#x6280;&#x672F;&#x8D8B;&#x52BF;&#x53D1;&#x5C55;&#x662F;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x8FD0;&#x7EF4;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x8981;&#x5173;&#x6CE8;&#x6574;&#x4E2A;&#x6280;&#x672F;&#x8D8B;&#x52BF;&#x548C;&#x80CC;&#x666F;&#x6765;&#x8BF4;&#x8FD0;&#x7EF4;&#x53D1;&#x5C55;&#x5386;&#x7A0B;&#xFF1B;&#x4ECE;&#x4E0D;&#x540C;&#x7EF4;&#x5EA6;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FD0;&#x7EF4;&#x5386;&#x7A0B;&#x8FDB;&#x884C;&#x603B;&#x7ED3;&#xFF0C;&#x5982;&#x6309;&#x4EBA;&#x5DE5;&#x5E72;&#x9884;&#x7A0B;&#x5EA6;&#x7EF4;&#x5EA6;&#x53EF;&#x628A;&#x8FD0;&#x7EF4;&#x53D1;&#x5C55;&#x7C97;&#x7565;&#x5206;&#x4E3A;&#xFF1A;&#x624B;&#x52A8;&#x8FD0;&#x7EF4;-&gt;&#x81EA;&#x52A8;&#x8FD0;&#x7EF4;-&gt;DevOps-&gt;&#x667A;&#x80FD;&#x8FD0;&#x7EF4;&#xFF1B;&#x5176;&#x4E2D;&#x5728;&#x8FD0;&#x7EF4;&#x53D1;&#x5C55;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6700;&#x65E9;&#x51FA;&#x73B0;&#x7684;&#x662F;&#x624B;&#x5DE5;&#x8FD0;&#x7EF4;&#xFF1B;&#x5728;&#x5927;&#x91CF;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x811A;&#x672C;&#x4EA7;&#x751F;&#x540E;&#xFF0C;&#x5C31;&#x6709;&#x4E86;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x8FD0;&#x7EF4;&#xFF1B;&#x540E;&#x6765;&#x968F;&#x7740;&#x5FAE;&#x670D;&#x52A1;&#x3001;&#x5BB9;&#x5668;&#x6280;&#x672F;&#x5174;&#x8D77;&#x53C8;&#x51FA;&#x73B0;&#x4E86;DevOps&#xFF1B;&#x6700;&#x8FD1;&#x4E00;&#x4E24;&#x5E74;&#x968F;&#x6570;&#x636E;&#x79EF;&#x7D2F;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x7B97;&#x529B;&#x63D0;&#x5347;&#x53C8;&#x51FA;&#x73B0;&#x667A;&#x80FD;&#x8FD0;&#x7EF4;&#x3002;&#x672C;&#x6587;&#x91CD;&#x70B9;&#x4ECE;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x7EF4;&#x5EA6;&#x8FD0;&#x7EF4;&#x6280;&#x672F;&#x548C;&#x4EBA;&#x5DE5;&#x5E72;&#x9884;&#x7EC6;&#x7C92;&#x5EA6;&#x5212;&#x5206;&#x8FD0;&#x7EF4;&#x5386;&#x7A0B;&#xFF1A;</p>
<p><strong>&#x7B2C;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;</strong>&#xFF0C;&#x4EBA;&#x5DE5;&#x4F5C;&#x574A;&#x9636;&#x6BB5;&#xFF0C;&#x6700;&#x521D;IT&#x7CFB;&#x7EDF;&#x5F53;&#x6211;&#x4EEC;&#x9047;&#x5230;&#x7684;&#x6240;&#x6709;&#x8FD0;&#x7EF4;&#x95EE;&#x9898;&#xFF0C;&#x57FA;&#x672C;&#x9760;&#x4EBA;&#x5DE5;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x89C4;&#x6A21;&#x4E0D;&#x5927;&#xFF0C;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x5927;&#x591A;&#x96C6;&#x4E2D;&#x5728;&#x786C;&#x4EF6;&#x3001;&#x7F51;&#x7EDC;&#x548C;&#x7CFB;&#x7EDF;&#x5C42;&#x9762;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4E00;&#x5B9A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6216;&#x7F51;&#x7EDC;&#x7EF4;&#x62A4;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x5C31;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x3002;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x4E0B;&#x7684;&#x8FD0;&#x7EF4;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5E38;&#x8BF4;&#x7684; SA&#xFF0C;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#xFF1B;&#x901A;&#x8FC7;&#x96C7;&#x4F63;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x8FD0;&#x7EF4;&#x590D;&#x6742;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E00;&#x822C;&#x8EAB;&#x517C;&#x591A;&#x804C;&#xFF0C;&#x4EBA;&#x6570;&#x4E5F;&#x4E0D;&#x592A;&#x591A;&#xFF0C;&#x662F;&#x5F53;&#x65F6;&#x4E1A;&#x754C;&#x6BD4;&#x8F83;&#x666E;&#x904D;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x4F46;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x7EC4;&#x4EF6;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x7528;&#x6237;&#x6D41;&#x7A0B;&#x4E0D;&#x65AD;&#x4E0A;&#x5347;&#xFF0C;&#x9700;&#x8981;&#x516C;&#x53F8;&#x62DB;&#x8058;&#x66F4;&#x591A;&#x7684;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x6765;&#x5E94;&#x5BF9;&#x65E5;&#x76CA;&#x589E;&#x591A;&#x4E8B;&#x4EF6;&#x3002;&#x7CFB;&#x7EDF;&#x8FD0;&#x7EF4;&#x6210;&#x672C;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E8C;&#x4E2A;&#x9636;&#x6BB5;</strong>&#xFF0C;&#x811A;&#x672C;&#x5DE5;&#x5177;&#x9636;&#x6BB5;&#xFF0C;&#x4E00;&#x822C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4F01;&#x4E1A;&#x90FD;&#x4F1A;&#x5F88;&#x5FEB;&#x4ECE;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x8FC7;&#x6E21;&#x5230;&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0A;&#x4E00;&#x9636;&#x6BB5;&#x7684;&#x5927;&#x91CF;&#x91CD;&#x590D;&#x7E41;&#x7410;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x8F6C;&#x5316;&#x4E3A;&#x811A;&#x672C;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6BCF;&#x6B21;&#x90FD;&#x53BB;&#x6572;&#x4E00;&#x5806;&#x7C7B;&#x4F3C;&#x7684;&#x547D;&#x4EE4;&#x3002;&#x65E9;&#x671F;&#x7684; SA &#x4E3B;&#x8981;&#x4EE5;&#x5404;&#x79CD; shell &#x4E3A;&#x4E3B;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x591A; SA &#x5982;&#x679C;&#x4F1A; shell &#x7F16;&#x5199;&#x4E00;&#x4E9B;&#x6279;&#x5904;&#x7406;&#x811A;&#x672C;&#xFF0C;&#x5C31;&#x4F1A;&#x5F88;&#x6709;&#x7ADE;&#x4E89;&#x529B;&#x4E86;&#x3002;&#x518D;&#x5F80;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5927;&#x5BB6;&#x6240;&#x719F;&#x77E5;&#x7684; Perl&#x3001;Ruby&#x3001;Python &#x7B49;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x4E5F;&#x88AB;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4E8E;&#x811A;&#x672C;&#x5DE5;&#x5177;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4E00;&#x4E9B;&#x903B;&#x8F91;&#x548C;&#x573A;&#x666F;&#x76F8;&#x5BF9;&#x590D;&#x6742;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x5B9E;&#x73B0;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;</strong>&#xFF0C;&#x6D41;&#x7A0B;&#x548C;&#x5DE5;&#x5177;&#x9636;&#x6BB5;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x628A;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x64CD;&#x4F5C;&#x5C01;&#x88C5;&#x6210;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x811A;&#x672C;&#x540E;&#xFF0C;&#x6548;&#x7387;&#x786E;&#x5B9E;&#x4F1A;&#x63D0;&#x5347;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x9762;&#x5BF9;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x548C;&#x4F53;&#x91CF;&#x4E5F;&#x5728;&#x53D8;&#x5F97;&#x66F4;&#x590D;&#x6742;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#xFF0C;&#x4EE5;&#x524D;&#x5C31;&#x662F;&#x8D1F;&#x8D23;&#x5B89;&#x88C5;&#x548C;&#x914D;&#x7F6E;&#x4E00;&#x4E0B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x51E0;&#x5341;&#x53F0;&#x6216;&#x767E;&#x53F0;&#x7684;&#x89C4;&#x6A21;&#xFF0C;&#x811A;&#x672C;&#x6279;&#x91CF;&#x6267;&#x884C;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x3002;&#x518D;&#x5F80;&#x540E;&#xFF0C;&#x8FD0;&#x7EF4;&#x8FD8;&#x8981;&#x8D1F;&#x8D23;&#x8F6F;&#x4EF6;&#x7684;&#x9891;&#x7E41;&#x53D1;&#x5E03;&#xFF0C;&#x6BCF;&#x5468;&#x8981;&#x591A;&#x6B21;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x6709;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E1A;&#x52A1;&#x7279;&#x70B9;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7C7B;&#x578B;&#x7684;&#x4E1A;&#x52A1;&#xFF0C;&#x4E0E;&#x539F;&#x6765;&#x4F20;&#x7EDF;&#x7684;&#x6BCF;&#x4E2A;&#x6708;&#x3001;&#x751A;&#x81F3;&#x51E0;&#x4E2A;&#x6708;&#x53D1;&#x5E03;&#x4E00;&#x6B21;&#x7684;&#x573A;&#x666F;&#x8981;&#x6C42;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#x3002;&#x800C;&#x4E14;&#x968F;&#x7740;&#x7528;&#x6237;&#x4F53;&#x91CF;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x6570;&#x91CF;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5230;&#x4E86;&#x51E0;&#x767E;&#x4E0A;&#x5343;&#x53F0;&#xFF0C;&#x800C;&#x4E14;&#x90E8;&#x7F72;&#x7684;&#x4E1A;&#x52A1;&#x4E5F;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x5355;&#x7EAF;&#x9760;&#x811A;&#x672C;&#x6267;&#x884C;&#xFF0C;&#x5DF2;&#x7ECF;&#x5B8C;&#x5168;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x8981;&#x9762;&#x4E34;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x5316;&#x7684;&#x573A;&#x666F;&#x5B9E;&#x73B0;&#xFF0C;&#x6BD4;&#x5982;&#x505A;&#x4E00;&#x6B21;&#x4E1A;&#x52A1;&#x90E8;&#x7F72;&#xFF0C;&#x8FD0;&#x7EF4;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x8981;&#x5B89;&#x88C5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x505A;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#xFF0C;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#x3001;&#x542F;&#x505C;&#x8FDB;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x4E0A;&#x914D;&#x7F6E;&#x670D;&#x52A1;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#x5C06;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x811A;&#x672C;&#x529F;&#x80FD;&#x4E32;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x6709;&#x4E00;&#x4E9B;&#x811A;&#x672C;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x6821;&#x9A8C;&#x53CA;&#x5224;&#x65AD;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x540C;&#x65F6;&#x5BF9;&#x4E8E;&#x7535;&#x4FE1;&#x9886;&#x57DF;&#x5BF9;&#x4EA7;&#x54C1;&#x7684;&#x5347;&#x7EA7;&#x53D8;&#x66F4;&#x6709;&#x4E25;&#x683C;&#x7684;&#x64CD;&#x4F5C;&#x89C4;&#x8303;&#x4EE5;&#x53CA;&#x6D41;&#x7A0B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x5C31;&#x5BF9;&#x6D41;&#x7A0B;&#x548C;&#x5DE5;&#x5177;&#x5E73;&#x53F0;&#x6709;&#x4E86;&#x66F4;&#x5927;&#x7684;&#x8BC9;&#x6C42;&#xFF0C;</p>
<p><strong>&#x7B2C;&#x56DB;&#x4E2A;&#x9636;&#x6BB5;</strong>&#xFF0C;&#x8FD0;&#x7EF4;&#x5E73;&#x53F0;&#x5316;&#x65E2;&#x81EA;&#x52A8;&#x5316;&#x8FD0;&#x7EF4;&#x9636;&#x6BB5;&#xFF0C;&#x4E5F;&#x662F;&#x5F53;&#x524D;&#x6240;&#x5904;&#x9636;&#x6BB5;&#xFF1B;&#x968F;&#x7740;&#x8FD0;&#x7EF4;&#x6D41;&#x7A0B;&#x5316;&#x53D1;&#x5C55;&#xFF0C;&#x8F83;&#x5927;IT&#x516C;&#x53F8;&#x8FDB;&#x4E00;&#x6B65;&#x8FDB;&#x884C;&#x8FD0;&#x7EF4;&#x4F53;&#x7CFB;&#x5316;&#x6539;&#x9020;&#x589E;&#x52A0;&#x81EA;&#x52A8;&#x5316;&#x7A0B;&#x5EA6;&#xFF0C;&#x8FD9;&#x5C31;&#x5230;&#x4E86;&#x81EA;&#x52A8;&#x5316;&#x8FD0;&#x7EF4;&#x9636;&#x6BB5;&#xFF0C;&#x5927;&#x516C;&#x53F8;&#x9488;&#x5BF9;&#x81EA;&#x5DF1;&#x4E1A;&#x52A1;&#x7279;&#x5F81;&#x6784;&#x7B51;&#x5927;&#x578B;&#x8FD0;&#x7EF4;&#x5E73;&#x53F0; &#x5982;&#xFF1A;&#x817E;&#x8BAF;&#x6E38;&#x620F;&#x7CFB;&#x7EDF;&#x7684;&#x84DD;&#x9CB8;&#x7CFB;&#x7EDF;&#xFF0C;&#x817E;&#x8BAF;&#x793E;&#x4EA4;&#x9886;&#x57DF;&#x7684;&#x7EC7;&#x4E91;&#x7CFB;&#x7EDF;&#xFF0C;&#x963F;&#x91CC;&#x7535;&#x5546;&#x9886;&#x57DF;&#x7684;&#x9E70;&#x773C;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x53F8;&#x9488;&#x5BF9;&#x4E91;&#x4E1A;&#x52A1;CloudBU&#x7684;CloudScope&#x7B49;&#x7B49;&#xFF1B;&#x968F;&#x7740;&#x793E;&#x4F1A;&#x5728;&#x7EBF;&#x5316;&#x7684;&#x7A0B;&#x5EA6;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#xFF0C;&#x5404;&#x5927;&#x4F01;&#x4E1A;&#x4E5F;&#x5F00;&#x59CB;&#x610F;&#x8BC6;&#x5230;&#x7CFB;&#x7EDF;&#x8FD0;&#x7EF4;&#x5BF9;&#x4E8E;&#x4F01;&#x4E1A;&#x7684;&#x6548;&#x7387;&#x3001;&#x7A33;&#x5B9A;&#x548C;&#x6210;&#x672C;&#x6709;&#x7740;&#x51B3;&#x5B9A;&#x6027;&#x4F5C;&#x7528;&#xFF0C;&#x5BF9;&#x8FD0;&#x7EF4;&#x7684;&#x8BC9;&#x6C42;&#x548C;&#x8981;&#x6C42;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#x3002;&#x8FD0;&#x7EF4;&#x5C97;&#x4F4D;&#x771F;&#x6B63;&#x5730;&#x88AB;&#x91CD;&#x89C6;&#xFF0C;&#x540C;&#x65F6;&#x8FD0;&#x7EF4;&#x884C;&#x4E1A;&#x6709;&#x81EA;&#x5DF1;&#x5782;&#x76F4;&#x7684;&#x6280;&#x672F;&#x5927;&#x4F1A;&#x5982;GOPS&#x5927;&#x4F1A;&#xFF0C;&#x540C;&#x65F6;QCon &#x4EE5;&#x53CA; ArchSummit &#x8FD9;&#x6837;&#x7684;&#x9876;&#x7EA7;&#x6280;&#x672F;&#x5CF0;&#x4F1A;&#xFF0C;&#x5F00;&#x59CB;&#x4E13;&#x95E8;&#x8BBE;&#x7F6E;&#x8FD0;&#x7EF4;&#x4E13;&#x9898;&#x3002;</p>
<p>&#x7531;&#x6280;&#x672F;&#x4F53;&#x7CFB;&#x53D1;&#x5C55;&#xFF0C;&#x8FD0;&#x7EF4;&#x6240;&#x9762;&#x4E34;&#x7684;&#x573A;&#x666F;&#x590D;&#x6742;&#x5EA6;&#x4E5F;&#x6025;&#x5267;&#x4E0A;&#x5347;&#xFF0C;&#x539F;&#x6709;&#x7684;&#x8FD0;&#x7EF4;&#x6280;&#x80FD;&#x5982;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EF4;&#x62A4;&#x3001;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x3001;&#x811A;&#x672C;&#x7F16;&#x5199;&#x5DF2;&#x7ECF;&#x5B8C;&#x5168;&#x6EE1;&#x8DB3;&#x4E0D;&#x4E86;&#x8981;&#x6C42;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x8FD0;&#x7EF4;&#x6295;&#x5165;&#x66F4;&#x591A;&#x7684;&#x7CBE;&#x529B;&#x53BB;&#x5173;&#x6CE8;&#x4E1A;&#x52A1;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x548C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x4E0A;&#x3002;&#x6240;&#x4EE5;&#x5C31;&#x6D6E;&#x73B0;&#x51FA;&#x6211;&#x4EEC;&#x6240;&#x719F;&#x77E5;&#x7684; DevOps&#xFF0C;SRE&#x3001;PE&#x3001;&#x5E94;&#x7528;&#x8FD0;&#x7EF4;&#x3001;&#x6280;&#x672F;&#x8FD0;&#x8425;&#x8FD9;&#x4E9B;&#x65B0;&#x7684;&#x540D;&#x5B57;&#x3001;&#x5C97;&#x4F4D;&#x6216;&#x7406;&#x5FF5;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E94;&#x4E2A;&#x9636;&#x6BB5;</strong>&#xFF1A;&#x667A;&#x80FD;&#x8FD0;&#x7EF4;&#x9636;&#x6BB5;&#x6216;AIOps&#xFF0C;&#x968F;&#x7740;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7A81;&#x7834;&#x3001;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x63D0;&#x5347;&#x5982; GPU&#x3001;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x5E26;&#x6765;&#x4E86;AI&#x9769;&#x547D;&#xFF0C;&#x800C;AIOps &#x5C06;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5E94;&#x7528;&#x4E8E;&#x8FD0;&#x7EF4;&#x9886;&#x57DF;&#xFF0C;&#x57FA;&#x4E8E;&#x5DF2;&#x6709;&#x7684;&#x8FD0;&#x7EF4;&#x6570;&#x636E; (&#x65E5;&#x5FD7;&#x3001;&#x76D1;&#x63A7;&#x4FE1;&#x606F;&#x3001;&#x5E94;&#x7528;&#x4FE1;&#x606F;&#x7B49;)&#xFF0C;&#x901A;&#x8FC7;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x4E00;&#x6B65;&#x89E3;&#x51B3;&#x81EA;&#x52A8;&#x5316;&#x8FD0;&#x7EF4;&#x6240;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x7684;&#x9884;&#x5224;&#x80FD;&#x529B;&#x3001;&#x7A33;&#x5B9A;&#x6027;&#x3001;&#x964D;&#x4F4E;IT&#x6210;&#x672C;&#xFF0C;&#x5E76;&#x63D0;&#x9AD8;&#x4F01;&#x4E1A;&#x7684;&#x4EA7;&#x54C1;&#x7ADE;&#x4E89;&#x529B;&#x3002;&#x4E0D;&#x8FC7;&#x5F53;&#x524D;&#x4EC5;&#x6709;&#x56FD;&#x5185;&#x5916;&#x7684;&#x5927;&#x5382;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x7B97;&#x6CD5;&#x89E3;&#x51B3;&#x5355;&#x70B9;&#x7684;&#x8FD0;&#x7EF4;&#x95EE;&#x9898;&#xFF0C;&#x667A;&#x80FD;&#x8FD0;&#x7EF4;&#x4E4B;&#x8DEF;&#x4EC5;&#x5904;&#x4E8E;&#x521D;&#x7EA7;&#x9636;&#x6BB5;&#xFF0C;AIOps &#x7684;&#x53D1;&#x5C55;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x6F14;&#x8FDB;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x540C;&#x65F6;AI &#x662F; Ops &#x7684;&#x6709;&#x529B;&#x8865;&#x5145;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x964D;&#x4F4E;&#x8FD0;&#x7EF4;&#x7684;&#x5DE5;&#x4F5C;&#x5F3A;&#x5EA6;&#x548C;&#x538B;&#x529B;&#xFF0C;&#x4F46;&#x662F; AIOps &#x4E00;&#x5B9A;&#x5EFA;&#x8BBE;&#x5728;&#x9AD8;&#x5EA6;&#x81EA;&#x52A8;&#x5316;&#x548C;&#x5B8C;&#x5584;&#x7684;&#x8FD0;&#x7EF4;&#x4F53;&#x7CFB;&#x4E4B;&#x4E0A;&#x7684;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x6F14;&#x8FDB;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0D;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x8DF3;&#x8DC3;&#x6027;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x98A0;&#x8986;&#x6027;&#x7684; AIOps &#x6A21;&#x5F0F;&#xFF0C;&#x5C06;&#x73B0;&#x6709;&#x7684; Ops &#x4F53;&#x7CFB;&#x66FF;&#x4EE3;&#x6389;&#x3002;</p>
<p>&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x8FD0;&#x7EF4;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x5DF2;&#x7ECF;&#x8FDB;&#x5165;&#x4E86;&#x6DF1;&#x6C34;&#x671F;&#x3002;&#x968F;&#x7740;Docker&#x3001;OpenStack&#x3001;Puppet&#x7B49;&#x6280;&#x672F;&#x7684;&#x6D41;&#x884C;&#xFF0C;&#x4EE5;&#x53CA;CI/CD&#x3001;DevOps&#x7B49;&#x7406;&#x5FF5;&#x7684;&#x843D;&#x5730;&#x751F;&#x6839;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x8FD0;&#x7EF4;&#x7684;&#x53D1;&#x5C55;&#x8FCE;&#x6765;&#x4E86;&#x5C0F;&#x9AD8;&#x6F6E;&#x3002;&#x6574;&#x4F53;&#x6765;&#x770B;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x8FD0;&#x7EF4;&#x5E73;&#x53F0;&#x5E2E;&#x52A9;&#x63D0;&#x5347;&#x4E86;&#x8FD0;&#x7EF4;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x5E76;&#x51CF;&#x5C11;&#x4E86;&#x56E0;&#x4EBA;&#x5DE5;&#x548C;&#x6D41;&#x7A0B;&#x64CD;&#x4F5C;&#x800C;&#x5F15;&#x8D77;&#x7684;&#x8FD0;&#x7EF4;&#x6545;&#x969C;&#x3002;</p>
<p>&#x8BB0;&#x5F97;&#x5728;2001&#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;Gartner Group&#x6709;&#x4E00;&#x4E2A;&#x8C03;&#x67E5;&#x663E;&#x793A;&#x5728;IT&#x9879;&#x76EE;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x6E90;&#x81EA;&#x6280;&#x672F;&#x6216;&#x4EA7;&#x54C1;&#xFF08;&#x5305;&#x62EC;&#x786C;&#x4EF6;&#x3001;&#x8F6F;&#x4EF6;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x7535;&#x529B;&#x5931;&#x5E38;&#x53CA;&#x5929;&#x707E;&#x7B49;&#xFF09;&#x7684;&#x95EE;&#x9898;&#x53EA;&#x5360;20%&#xFF0C;&#x4F46;&#x6D41;&#x7A0B;&#x5931;&#x8BEF;&#x65B9;&#x9762;&#x5374;&#x5360;40%&#xFF0C;&#x4EBA;&#x5458;&#x758F;&#x5931;&#x65B9;&#x9762;&#x4E5F;&#x5360;&#x5230;&#x4E86;40%&#x3002;&#x8FD9;&#x4E9B;&#x5E74;&#x6765;&#xFF0C;&#x4F01;&#x4E1A;&#x901A;&#x8FC7;&#x81EA;&#x52A8;&#x5316;&#x8FD0;&#x7EF4;&#x5E73;&#x53F0;&#x4EE5;&#x53CA;DevOps&#x7B49;&#x534F;&#x4F5C;&#x7406;&#x5FF5;&#x9010;&#x6B65;&#x89E3;&#x51B3;&#x4E86;Gartner&#x63D0;&#x5230;&#x7684;&#x6D41;&#x7A0B;&#x5931;&#x8BEF;&#x548C;&#x4EBA;&#x5458;&#x758F;&#x5FFD;&#x76F8;&#x5173;&#x7684;80%&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x867D;&#x7136;&#x76EE;&#x524D;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x7684;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x786E;&#x8BA4;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x5F97;&#x5230;&#x4E86;&#x6709;&#x6548;&#x89E3;&#x51B3;&#x3002;</p>
<p>&#x4F46;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x70B9;&#x662F;&#x5F53;&#x524D;&#x7684;IT&#x9879;&#x76EE;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x73AF;&#x5883;&#x4E0E;5&#x5E74;&#x524D;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x540C;&#x65E5;&#x800C;&#x8BED;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;10&#x5E74;&#x524D;&#x3002;&#x8FD1;&#x51E0;&#x5E74;&#xFF0C;&#x968F;&#x7740;&#x4E91;&#x8BA1;&#x7B97;&#x3001;&#x5FAE;&#x670D;&#x52A1;&#x7B49;&#x6280;&#x672F;&#x7684;&#x6D41;&#x884C;&#xFF0C;&#x4EE5;&#x53CA;&#x4E92;&#x8054;&#x7F51;&#x4E1A;&#x52A1;&#x7684;&#x8FC5;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x670D;&#x52A1;&#x6570;&#x91CF;&#x4E5F;&#x5448;&#x73B0;&#x4E86;&#x6307;&#x6570;&#x7EA7;&#x589E;&#x957F;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x8FD0;&#x7EF4;&#x867D;&#x7136;&#x63D0;&#x5347;&#x4E86;&#x6548;&#x7387;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4E5F;&#x9047;&#x5230;&#x4E86;&#x65B0;&#x7684;&#x96BE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x9762;&#x5BF9;&#x7E41;&#x591A;&#x7684;&#x62A5;&#x8B66;&#x4FE1;&#x606F;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF1F;&#x6545;&#x969C;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x53C8;&#x5982;&#x4F55;&#x80FD;&#x591F;&#x8FC5;&#x901F;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#xFF1F;</p>
<p>&#x5F53;&#x4F01;&#x4E1A;&#x9047;&#x5230;&#x8FD9;&#x4E9B;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x5374;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#x65F6;&#xFF0C;&#x6070;&#x597D;&#x5386;&#x53F2;&#x8FDB;&#x5165;&#x4E86;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x65F6;&#x4EE3;&#xFF0C;&#x90A3;&#x4E0A;&#x9762;&#x7684;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x53EF;&#x5426;&#x901A;&#x8FC7;&#x300E;AI + Ops&#x300F;&#x7684;&#x8FD9;&#x79CD;&#x8DE8;&#x754C;&#x521B;&#x65B0;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x5462;&#xFF1F;&#x4E8E;&#x662F;Gartner&#x5728;2016&#x5E74;&#x65F6;&#x4FBF;&#x63D0;&#x51FA;&#x4E86;AIOps&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x9884;&#x6D4B;&#x5230;2020&#x5E74;&#xFF0C;AIOps&#x7684;&#x91C7;&#x7528;&#x7387;&#x5C06;&#x4F1A;&#x8FBE;&#x5230;50%&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;AIOps&#x5C31;&#x662F;&#x5E0C;&#x671B;&#x57FA;&#x4E8E;&#x5DF2;&#x6709;&#x7684;&#x8FD0;&#x7EF4;&#x6570;&#x636E;&#xFF08;&#x65E5;&#x5FD7;&#x3001;&#x76D1;&#x63A7;&#x4FE1;&#x606F;&#x3001;&#x5E94;&#x7528;&#x4FE1;&#x606F;&#x7B49;&#xFF09;&#x5E76;&#x901A;&#x8FC7;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x4E00;&#x6B65;&#x89E3;&#x51B3;&#x81EA;&#x52A8;&#x5316;&#x8FD0;&#x7EF4;&#x6CA1;&#x529E;&#x6CD5;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5C31;&#x76EE;&#x524D;&#x6765;&#x770B;&#xFF0C;&#x56FD;&#x5185;&#x7684;&#x767E;&#x5EA6;&#x3001;&#x641C;&#x72D7;&#x3001;&#x5B9C;&#x4FE1;&#x3001;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x90FD;&#x5DF2;&#x7ECF;&#x63A2;&#x7D22;&#x5C1D;&#x8BD5;&#x4E86;AIOps&#xFF0C;&#x5E76;&#x4E14;&#x53D6;&#x5F97;&#x4E86;&#x4E0D;&#x9519;&#x7684;&#x6536;&#x76CA;&#x3002;&#x5728;2017&#x5E74;InfoQ&#x4E3E;&#x529E;&#x7684;CNUTCon&#x5168;&#x7403;&#x8FD0;&#x7EF4;&#x6280;&#x672F;&#x5927;&#x4F1A;&#x4E0A;&#xFF0C;&#x4E5F;&#x6709;&#x4E0D;&#x5C11;AIOps&#x76F8;&#x5173;&#x7684;&#x8BAE;&#x9898;&#xFF0C;&#x751A;&#x81F3;&#x4F1A;&#x8BAE;&#x4E3B;&#x9898;&#x4E5F;&#x4ECE;&#x53BB;&#x5E74;&#x7684;&#x5BB9;&#x5668;&#x751F;&#x6001;&#x8FED;&#x4EE3;&#x5230;&#x4ECA;&#x5E74;&#x7684;&#x667A;&#x80FD;&#x65F6;&#x4EE3;&#x7684;&#x65B0;&#x8FD0;&#x7EF4;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x5173;&#x6CE8;&#x3002;</p>
<p>&#x672A;&#x6765;&#x8BBE;&#x60F3;&#xFF1A;&#x667A;&#x80FD;&#x8FD0;&#x7EF4;&#x7684;&#x7EC8;&#x6781;&#x76EE;&#x6807; &#x65E0;&#x4EBA;&#x503C;&#x5B88;&#xFF0C;&#x7CFB;&#x7EDF;&#x5177;&#x5907;&#x6545;&#x969C;&#x81EA;&#x6108;&#x3001;&#x65E0;&#x4EBA;&#x503C;&#x5B88;&#x53D8;&#x66F4;&#x3001;&#x81EA;&#x52A8;&#x6269;&#x7F29;&#x5BB9;&#x3001;&#x81EA;&#x52A8;&#x9632;&#x5FA1;&#x7B49;&#x80FD;&#x529B;&#xFF1B;&#x5982;&#x7535;&#x5F71;&#x300A;&#x592A;&#x7A7A;&#x65C5;&#x5BA2;&#x300B;&#x4E00;&#x8258;&#x8FD0;&#x9001;&#x6570;&#x5343;&#x51AC;&#x7720;&#x4EBA;&#x5230;&#x9065;&#x8FDC;&#x6B96;&#x6C11;&#x5730;&#x661F;&#x7403;&#x7684;&#x592A;&#x7A7A;&#x98DE;&#x8239;&#xFF0C;&#x4EC5;&#x4E00;&#x4E9B;&#x673A;&#x5668;&#x4EBA;&#x8D1F;&#x8D23;&#x98DE;&#x8239;&#x7684;&#x65E5;&#x5E38;&#x7EF4;&#x62A4;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        
<span class="post-time">
    最后更新：<time datetime="2022-05-26T12:38:03.866Z" itemprop="dateUpdated">2022-05-26 20:38:03</time>
</span>


        
        原文链接：<a href="/posts/dded0e80/" target="_blank" rel="external">https://marnm.github.io/posts/dded0e80/</a>
        
    </div>
    <footer>
        <div onclick="location.href='https://marnm.github.io'">
            <img src="/img/avatar.gif" alt="Echo">
            <a>Echo</a>
        </div>
    </footer>
</blockquote>

        
    <div class="page-reward">
        <nav class="myreward">
            <a id="rewardBtn" href="javascript:;"><span>打&nbsp;赏</span><span>装成好像很多人打赏的样子</span></a>
        </nav>
    </div>



        <div class="post-footer">
            

            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://marnm.github.io/posts/dded0e80/&title=《运维发展史》 — Deops's blog&pic=https://marnm.github.io/img/avatar.gif" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://marnm.github.io/posts/dded0e80/&title=《运维发展史》 — Deops's blog&source=运维岗位历史悠久提到运维很多人可能想到 IT系统的运维，其实运维岗位不仅仅最近几十年才有的工作岗位，大多运维的理念都来自人类医疗界，只不过医生是对人体这个..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://marnm.github.io/posts/dded0e80/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《运维发展史》 — Deops's blog&url=https://marnm.github.io/posts/dded0e80/&via=https://marnm.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://marnm.github.io/posts/dded0e80/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/217dc297/" id="post-prev" class="post-nav-link">
        <h4 class="title">
          上一篇：计算机概述
        </h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/4c41c7ef/" id="post-next" class="post-nav-link">
        <h4 class="title" data-hover="下一篇：十二句经典的爱情名言">下一篇：十二句经典的爱情名言</h4>
      </a>
    </div>
  
</nav>



    
    

    

    


</article>

</div>

        <footer class="footer">
    <div class="footer-content">
        <span class="power">
            <i class="icon icon-lg icon-copyright"></i>
            2022
            <i class="icon icon-lg icon-heart"></i>
            <a href="https://marnm.github.io">marnm.github.io</a>
            <br>
            Power by
            <a href="https://hexo.io/" target="_blank" rel="external nofollow">Hexo</a>&nbsp;·&nbsp;
            Theme
            <a class="tomotoeslink" href="https://github.com/tomotoes/hexo-theme-tomotoes/" target="_blank" rel="external nofollow">tomotoes</a>
        </span>

        <br>

        <span id="RunTime" style="color:#a7a7a2;"></span>
        <br>

        <span>
            

        </span>
        <br>

        <span class="license"><a target="_blank" rel="license" href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh">博客内容遵循 知识共享 署名 - 非商业性 - 相同方式共享 4.0 国际协议</a></span>
    </div>
</footer>

    </main>
    
        
<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        <span>感谢您的鼓励支持！</span>
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" data-img="/img/dog.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/img/wechat.png" data-alipay="/img/alipay.png">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechatPay">&nbsp;&nbsp;微信&nbsp;&nbsp;</span>
                <span class="reward-toggle-item alipayPay">支付宝</span>
            </div>
        </label>
        
        <i class="icon icon-caret-up"></i>
    </div>
</div>


    
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://marnm.github.io/posts/dded0e80/&title=《运维发展史》 — Deops's blog&pic=https://marnm.github.io/img/avatar.gif" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://marnm.github.io/posts/dded0e80/&title=《运维发展史》 — Deops's blog&source=运维岗位历史悠久提到运维很多人可能想到 IT系统的运维，其实运维岗位不仅仅最近几十年才有的工作岗位，大多运维的理念都来自人类医疗界，只不过医生是对人体这个..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://marnm.github.io/posts/dded0e80/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《运维发展史》 — Deops's blog&url=https://marnm.github.io/posts/dded0e80/&via=https://marnm.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://marnm.github.io/posts/dded0e80/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p class="wechatshare">扫一扫，分享到微信</p>
    <img src="data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAK4AAACuCAAAAACKZ2kyAAABxElEQVR42u3aS27DMAwFwNz/0u4BWquPpKW6wGgVIHY88YLg7/OJz3VzkuvX13x2HFxc3DH3Wp67a74/ck3M7/3lpeDi4h7krgPNmrV+QP46omCHi4v7Ym4enqpBDRcX9z9y10EqL2xwcXHfz52nIL3yZmOthouLO+DmXcp9n7f0d3FxcVvcq3jWycez7ZIf7sXFxT3CrRYqSerTS4YKw1pcXNwj3OoYNW+h9pomUfGDi4u7jdtbpMgXsKprHFFGhouL+wLuU+gHgiYuLu4Rbp4HVQNQ/gry5+Li4p7hJs3QSRIzGdvcFj+4uLh/xO2hq2lQ8vtRIMPFxX2UOx+cTEqd3oIXLi7uGe5kyJGvaCTJUBTIcHFxD3KrrY3qSDUvh8qtUlxc3G3c+Q9VA1OzKYOLi3uQW1266i1hTMIlLi7ueW6v3Zk/phcu61/j4uJOuVfx5MXMfPECFxf3r7i9lYhJclNof0yWOXBxccfcXnFSHbJWR7m3LwIXF/cgN2+P5n+jN1Bp9ndxcXFfwM0DUK/EKndNcHFxX8OdtF+rpRcuLu55brVJmjcyep2YaCaMi4u7jTu5OUlleg2RB/q7uLi4He4Xf6DiMVRbM4MAAAAASUVORK5CYII=" alt="微信分享二维码">
</div>




    <!-- waves按钮特效 -->
<script src="//cdn.bootcss.com/node-waves/0.7.4/waves.min.js"></script>

<!-- 主题配置脚本 -->
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };
</script>

<!-- jquery -->
<script src="/js/jquery.min.js?v=3.0"></script>

<!-- 搜索 -->

<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item waves-block waves-effect" onclick="location.href='{path}'">
    <div class="title ellipsis" title="{title}">{title}</div>
</li>
</template>


<!-- main博客脚本 -->
<script src="/js/main.min.js?v=3.0"></script>

<!-- 动画&配置 -->
<script src="/js/script.min.js?v=3.0"></script>

<!-- 脚本管理 -->
<script>

if(window.innerWidth > 800){
	/* 3D标题 */
	$(".content-header").on("mousemove", threedee);

	/* 底部追随鼠标 */
	$(".footer").hover(2);

	/* gotop键的涟漪 */
	$("#gotop").hover(1);

	/* 赞赏的粒子雨 */
	$("#reward").hover(3);

	/* 微信公众号的底部渲染 */
	$("#wechat").hover(4);

    /* 标题跳动 */
    $(".archivestitle").bumpyText();

	/* 图片点击放大 */
	const postimg = jQuery(".post-content img:not(.github-emoji)");
	postimg.on("click",function(){

		mask.classList.add("in");
		main.classList.add("Mask");
		menu.classList.add("Mask");
		var myimg = this.cloneNode(true);
		myimg.classList.add("imgShow");

		setTimeout(function(){
			jQuery(myimg).animate({
				opacity:"1"
			},1000);
		},0);

		document.body.appendChild(myimg);

		myimg.onclick=function(){
			document.body.removeChild(myimg);
			mask.classList.remove("in");
			main.classList.remove("Mask");
			menu.classList.remove("Mask");
		};

	});

}

/* 名字跳动 */
$("#name").bumpyText();


/* 网站运行时间 */
setInterval(function () {
	setTime("2019/01/01");
}, 1000);

/* 文章块的淡出 */
postshow();

/* 座右铭 */

   getHitokoto();



/* 粘贴提示 */
G($(".post-content"), location.href, "Echo");


/* 控制台 */
if (window.console && window.console.log) {
	setTimeout(function () {
		console.log("\n %c 一个坏掉的番茄 %c  © Simon Ma  http://tomotoes.com \n\n", "color:#FFFFFB;background:#1abc9c;padding:5px 0;border-radius:.5rem 0 0 .5rem;", "color:#FFFFFB;background:#080808;padding:5px 0;border-radius:0 .5rem .5rem 0;");
	}, 0);
}

</script>




<!-- 公式渲染 -->



<!-- 不蒜子 -->


</body>
</html>
