<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    <meta http-equiv="Content-Language" content="zh-cn">
    <meta charset="utf-8">
    
    
    
    <title>Deops&#39;s blog | 运维开发工程师</title>
    <meta name="viewport" content="width=device-width,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no">
    
    <meta name="theme-color" content="#77AAFF">
    
    
    <meta name="keywords" content="Echo">
    
    

    

    <!-- Baidu Push -->
<script>
	(function(){
		var bp = document.createElement('script');
		var curProtocol = window.location.protocol.split(':')[0];
		if (curProtocol === 'https') {
			bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';
		}
		else {
			bp.src = 'http://push.zhanzhang.baidu.com/push.js';
		}
		var s = document.getElementsByTagName("script")[0];
		s.parentNode.insertBefore(bp, s);
	})();

	var _hmt = _hmt || [];
</script>



    
    <meta name="description" content="Echo">
<meta name="keywords" content="Echo">
<meta property="og:type" content="website">
<meta property="og:title" content="Deops&#39;s blog">
<meta property="og:url" content="https://marnm.github.io/page/5/index.html">
<meta property="og:site_name" content="Deops&#39;s blog">
<meta property="og:description" content="Echo">
<meta property="og:locale" content="zh-Hans">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Deops&#39;s blog">
<meta name="twitter:description" content="Echo">
    
        <link rel="alternate" type="application/atom+xml" title="Deops&#39;s blog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/img/favicon.ico">
    <link id="style" rel="stylesheet" href="/css/style.css?v=3.0">
    <script>window.lazyScripts=[]</script>

    <!-- custom head -->
    
            
</head>

<body>
    <div id="loading" class="active"></div>
    <aside id="menu">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/img/avatar.gif" alt="avatar">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname" id="name">Echo</h5>
          
            <div id="yiyanmotto" class="motto">&nbsp;</div>
          
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
              <li class="waves-block waves-effect">
                  <a href="/">
                    <i class="icon icon-lg icon-home"></i>
                    <span>主 页</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/archives">
                    <i class="icon icon-lg icon-archives"></i>
                    <span>归 档</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/categories">
                    <i class="icon icon-lg icon-th-list"></i>
                    <span>分 类</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/tags">
                    <i class="icon icon-lg icon-tags"></i>
                    <span>标 签</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/about">
                    <i class="icon icon-lg icon-smile-o"></i>
                    <span>关 于</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
      <div class="nav2">
          
              <a class="nav2item" data-title="Email" href="http://mail.qq.com/cgi-bin/qm_share?t=qm_mailme&email=442KgIbNhZajhYybjoKKj82AjI4" target="_parent" title="Email">
                <i class="icon icon-lg icon-envelope-o envelope-o"></i>
              </a>
          
              <a class="nav2item" data-title="Github" href="https://github.com/Marnm" target="_blank" title="Github">
                <i class="icon icon-lg icon-github github"></i>
              </a>
          
              <a class="nav2item" data-title="我的哔哩哔哩" href="https://space.bilibili.com/31374976" target="_blank" title="我的哔哩哔哩">
                <i class="icon icon-lg icon-tv tv"></i>
              </a>
          

            </div>
        
      </ul>
        
    </div>
  </div>
 
</aside>


    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">Deops&#39;s blog</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        <a href="../../atom.xml" target="_blank" class="header-icon waves-effect waves-circle waves-light" id="Rss">
            <i class="icon icon-lg icon-rss"></i>
        </a>
    </div>
</header>
<header class="content-header index-header">
    
    
    <div class="container fade-scale">
        <div id="myheader">
            <h1 class="title">
                 
                    Deops&#39;s blog
                
            </h1>
            <h5 class="subtitle">
                
                    努力成为一名资深运维工程师
                
            </h5>
        </div>
    </div>

</header>

<div class="container body-wrap">
    <ul class="post-list">
    
        <li class="post-list-item fade">
            <article id="post-Docker学习笔记" class="article-card article-type-post" itemprop="blogPost">

    


  
    <h3 class="post-title" itemprop="name">
      <a href="/posts/4a3d459a/">Docker学习笔记</a>
    </h3>
  




     <div class="post-meta">
        <time class="post-time" title="2022-06-07 13:26:19" datetime="2022-06-07T05:26:19.000Z" itemprop="datePublished">2022-06-07</time>

    </div>

    <div class="post-content" id="post-content" itemprop="postContent">

    
        <h1 id="容器Docker详解"><a href="#容器Docker详解" class="headerlink" title="容器Docker详解"></a>容器Docker详解</h1><h2 id="概述"><a href="#概述" class="headerlink" title="概述"></a>概述</h2><p><strong>1.1 基本概念：</strong></p>
<p>Docker是一个开源的应用容器引擎，基于Go语言 并遵从Apache2.0协议开源。Docker可以让开发者打包他们的应用以及依赖包到一个轻量级、可移植的容器中，然后发布到任何流行的Linux机器上，也可以实现虚拟化。容器是完全使用沙箱机制，相互之间不会有任何接口（类似iPhone的app），更重要的的是容器性能开销极低。<br>
    
        <div>
            <a href="/posts/4a3d459a/" class="post-more waves-button">
                阅读全文 »
            </a>
        </div>
    </p></div>
    
</article>

        </li>
    
        <li class="post-list-item fade">
            <article id="post-MariaDB" class="article-card article-type-post" itemprop="blogPost">

    


  
    <h3 class="post-title" itemprop="name">
      <a href="/posts/fbf617b4/">MariaDB</a>
    </h3>
  




     <div class="post-meta">
        <time class="post-time" title="2022-06-07 13:16:21" datetime="2022-06-07T05:16:21.000Z" itemprop="datePublished">2022-06-07</time>

    </div>

    <div class="post-content" id="post-content" itemprop="postContent">

    
        <h2 id="&#x7AE0;&#x8282;&#x7B80;&#x8FF0;"><a href="#&#x7AE0;&#x8282;&#x7B80;&#x8FF0;" class="headerlink" title="&#x7AE0;&#x8282;&#x7B80;&#x8FF0;"></a>&#x7AE0;&#x8282;&#x7B80;&#x8FF0;</h2><p>MySQL&#x6570;&#x636E;&#x5E93;&#x9879;&#x76EE;&#x81EA;&#x4ECE;&#x88AB;Oracle&#x516C;&#x53F8;&#x6536;&#x8D2D;&#x4E4B;&#x540E;&#xFF0C;&#x4ECE;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x8F6C;&#x53D8;&#x6210;&#x4E3A;&#x4E86;&#x201C;&#x95ED;&#x6E90;&#x201D;&#x8F6F;&#x4EF6;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;IT&#x884C;&#x4E1A;&#x4E2D;&#x7684;&#x5F88;&#x591A;&#x4F01;&#x4E1A;&#x4EE5;&#x53CA;&#x5382;&#x5546;&#x7EB7;&#x7EB7;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x7684;&#x540E;&#x8D77;&#x4E4B;&#x79C0;&#x2014;MariaDB&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x3002;MariaDB&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4E5F;&#x56E0;&#x6B64;&#x5FEB;&#x901F;&#x5360;&#x636E;&#x4E86;&#x5E02;&#x573A;&#x3002;<br>&#x672C;&#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;&#x6570;&#x636E;&#x5E93;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x7406;&#x8BBA;&#x77E5;&#x8BC6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4ECB;&#x7ECD;MariaDB&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x901A;&#x8FC7;&#x52A8;&#x624B;&#x5B9E;&#x9A8C;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5E2E;&#x52A9;&#x5404;&#x4F4D;&#x8BFB;&#x8005;&#x638C;&#x63E1;MariaDB&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E9B;&#x5E38;&#x89C4;&#x64CD;&#x4F5C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x8D26;&#x6237;&#x7684;&#x521B;&#x5EFA;&#x4E0E;&#x7BA1;&#x7406;&#x3001;&#x8D26;&#x6237;&#x6743;&#x9650;&#x7684;&#x6388;&#x6743;&#xFF1B;&#x65B0;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x3001;&#x65B0;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x8868;&#x5355;&#xFF1B;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x6267;&#x884C;&#x65B0;&#x5EFA;&#x3001;&#x5220;&#x9664;&#x3001;&#x4FEE;&#x6539;&#x548C;&#x67E5;&#x8BE2;&#x7B49;&#x64CD;&#x4F5C;&#x3002;&#x672C;&#x7AE0;&#x6700;&#x540E;&#x8FD8;&#x4ECB;&#x7ECD;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5907;&#x4EFD;&#x4E0E;&#x6062;&#x590D;&#x65B9;&#x6CD5;&#x3002;<br>&#x5728;&#x5B66;&#x5B8C;&#x672C;&#x7AE0;&#x5185;&#x5BB9;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x4F46;&#x53EF;&#x4EE5;&#x80DC;&#x4EFB;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x3002;</p>
<h2 id="1-&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;"><a href="#1-&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;" class="headerlink" title="1 &#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;"></a>1 &#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;</h2><p>&#x6570;&#x636E;&#x5E93;&#x662F;&#x6307;&#x6309;&#x7167;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x7ED3;&#x6784;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x8D44;&#x6599;&#x7684;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x3002;&#x5728;&#x5F53;&#x4ECA;&#x8FD9;&#x4E2A;&#x5927;&#x6570;&#x636E;&#x6280;&#x672F;&#x8FC5;&#x901F;&#x5D1B;&#x8D77;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x751F;&#x6210;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#x4FE1;&#x606F;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x4E5F;&#x4ECE;&#x6700;&#x521D;&#x53EA;&#x80FD;&#x5B58;&#x50A8;&#x7B80;&#x5355;&#x7684;&#x8868;&#x683C;&#x6570;&#x636E;&#x7684;&#x5355;&#x4E00;&#x96C6;&#x4E2D;&#x5B58;&#x50A8;&#x6A21;&#x5F0F;&#xFF0C;&#x53D1;&#x5C55;&#x5230;&#x4E86;&#x73B0;&#x5982;&#x4ECA;&#x5B58;&#x50A8;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x5927;&#x578B;&#x5206;&#x5E03;&#x5F0F;&#x6A21;&#x5F0F;&#x3002;&#x5728;&#x4FE1;&#x606F;&#x5316;&#x793E;&#x4F1A;&#x4E2D;&#xFF0C;&#x80FD;&#x591F;&#x5145;&#x5206;&#x6709;&#x6548;&#x5730;&#x7BA1;&#x7406;&#x548C;&#x5229;&#x7528;&#x5404;&#x79CD;&#x6570;&#x636E;&#xFF0C;&#x6316;&#x6398;&#x5176;&#x4E2D;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x662F;&#x8FDB;&#x884C;&#x79D1;&#x5B66;&#x7814;&#x7A76;&#x4E0E;&#x51B3;&#x7B56;&#x7BA1;&#x7406;&#x7684;&#x91CD;&#x8981;&#x524D;&#x63D0;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x4E5F;&#x662F;&#x7BA1;&#x7406;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x3001;&#x529E;&#x516C;&#x81EA;&#x52A8;&#x5316;&#x7CFB;&#x7EDF;&#x3001;&#x51B3;&#x7B56;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x7B49;&#x5404;&#x7C7B;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x7684;&#x6838;&#x5FC3;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x662F;&#x8FDB;&#x884C;&#x79D1;&#x5B66;&#x7814;&#x7A76;&#x548C;&#x51B3;&#x7B56;&#x7BA1;&#x7406;&#x7684;&#x91CD;&#x8981;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x3002;<br>&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x79CD;&#x80FD;&#x591F;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B58;&#x653E;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5EFA;&#x7ACB;&#x3001;&#x4FEE;&#x6539;&#x3001;&#x5220;&#x9664;&#x3001;&#x67E5;&#x627E;&#x3001;&#x7EF4;&#x62A4;&#x7B49;&#x64CD;&#x4F5C;&#x7684;&#x8F6F;&#x4EF6;&#x7A0B;&#x5E8F;&#x3002;&#x5B83;&#x901A;&#x8FC7;&#x628A;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x5177;&#x4F53;&#x7684;&#x7269;&#x7406;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x6210;&#x9002;&#x5408;&#x7528;&#x6237;&#x7406;&#x89E3;&#x7684;&#x62BD;&#x8C61;&#x903B;&#x8F91;&#x6570;&#x636E;&#xFF0C;&#x6709;&#x6548;&#x5730;&#x964D;&#x4F4E;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7684;&#x6280;&#x672F;&#x95E8;&#x69DB;&#xFF0C;&#x56E0;&#x6B64;&#x5373;&#x4FBF;&#x662F;&#x4ECE;&#x4E8B;Linux&#x8FD0;&#x7EF4;&#x5DE5;&#x4F5C;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x4E5F;&#x53EF;&#x4EE5;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x57FA;&#x672C;&#x7684;&#x7BA1;&#x7406;&#x64CD;&#x4F5C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8001;&#x5E08;&#x6709;&#x5FC5;&#x8981;&#x63D0;&#x9192;&#x5404;&#x4F4D;&#x8BFB;&#x8005;&#xFF0C;&#x672C;&#x8BFE;&#x7A0B;&#x7684;&#x6280;&#x672F;&#x4E3B;&#x7EBF;&#x4F9D;&#x7136;&#x662F;Linux&#x7CFB;&#x7EDF;&#x7684;&#x8FD0;&#x7EF4;&#xFF0C;&#x800C;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x5728;&#x6B64;&#x4E3B;&#x7EBF;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x5185;&#x5BB9;&#x4E0D;&#x65AD;&#x6A2A;&#x5411;&#x6269;&#x5C55;&#x3001;&#x7EB5;&#x5411;&#x52A0;&#x6DF1;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x4E0D;&#x80FD;&#x6307;&#x671B;&#x5728;&#x4E00;&#x4E24;&#x5929;&#x4E4B;&#x5185;&#x5C31;&#x53EF;&#x4EE5;&#x7CBE;&#x901A;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x6280;&#x672F;&#x3002;&#x5982;&#x679C;&#x6709;&#x540C;&#x5B66;&#x5728;&#x5B66;&#x5B8C;&#x672C;&#x8BFE;&#x7A0B;&#x5185;&#x5BB9;&#x4E4B;&#x540E;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x6280;&#x672F;&#x4EA7;&#x751F;&#x4E86;&#x6D53;&#x539A;&#x5174;&#x8DA3;&#xFF0C;&#x5E76;&#x5E0C;&#x671B;&#x8C0B;&#x5F97;&#x4E00;&#x4EFD;&#x76F8;&#x5173;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x989D;&#x5916;&#x4E3A;&#x81EA;&#x5DF1;&#x5B9A;&#x5236;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x89C4;&#x5212;&#x4E86;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="sql.png" alt="mariadbmysql" title="">
                </div>
                <div class="image-caption">mariadbmysql</div>
            </figure>
<p>&#x56FE;1 MariaDB&#x4E0E;Mysql&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x8457;&#x540D;LOGO</p>
<p>&#x65E2;&#x7136;&#x662F;&#x8BB2;&#x89E3;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x6280;&#x672F;&#xFF0C;&#x5C31;&#x80AF;&#x5B9A;&#x7ED5;&#x4E0D;&#x5F00;MySQL&#x3002;MySQL&#x662F;&#x4E00;&#x6B3E;&#x5E02;&#x573A;&#x5360;&#x6709;&#x7387;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x6280;&#x672F;&#x6210;&#x719F;&#x3001;&#x914D;&#x7F6E;&#x6B65;&#x9AA4;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x4E14;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;Oracle&#x516C;&#x53F8;&#x5728;2009&#x5E74;&#x6536;&#x8D2D;&#x4E86;MySQL&#x7684;&#x6BCD;&#x516C;&#x53F8;Sun&#xFF0C;&#x56E0;&#x6B64;MySQL&#x6570;&#x636E;&#x5E93;&#x9879;&#x76EE;&#x4E5F;&#x968F;&#x4E4B;&#x7EB3;&#x5165;Oracle&#x9EBE;&#x4E0B;&#xFF0C;&#x9010;&#x6B65;&#x6F14;&#x53D8;&#x4E3A;&#x4FDD;&#x6301;&#x7740;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x4F46;&#x53C8;&#x7533;&#x8BF7;&#x4E86;&#x591A;&#x9879;&#x5546;&#x4E1A;&#x4E13;&#x5229;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x662F;&#x5168;&#x7403;&#x9ED1;&#x5BA2;&#x3001;&#x6781;&#x5BA2;&#x3001;&#x7A0B;&#x5E8F;&#x5458;&#x7B49;&#x6280;&#x672F;&#x9AD8;&#x624B;&#x5728;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x5927;&#x65D7;&#x4E0B;&#x7684;&#x516C;&#x5171;&#x667A;&#x6167;&#x7ED3;&#x6676;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x52B3;&#x52A8;&#x6210;&#x679C;&#x88AB;&#x5176;&#x4ED6;&#x516C;&#x53F8;&#x5546;&#x4E1A;&#x5316;&#x81EA;&#x7136;&#x4E5F;&#x4F24;&#x4E86;&#x4E00;&#x5927;&#x6279;&#x5F00;&#x6E90;&#x5DE5;&#x4F5C;&#x8005;&#x7684;&#x5FC3;&#xFF0C;&#x56E0;&#x6B64;&#x7531;MySQL&#x9879;&#x76EE;&#x521B;&#x59CB;&#x8005;&#x91CD;&#x65B0;&#x7814;&#x53D1;&#x4E86;&#x4E00;&#x6B3E;&#x540D;&#x4E3A;MariaDB&#x7684;&#x5168;&#x65B0;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x3002;&#x8BE5;&#x8F6F;&#x4EF6;&#x5F53;&#x524D;&#x7531;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x8FDB;&#x884C;&#x7EF4;&#x62A4;&#xFF0C;&#x662F;MySQL&#x7684;&#x5206;&#x652F;&#x4EA7;&#x54C1;&#xFF0C;&#x800C;&#x4E14;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x517C;&#x5BB9;MySQL&#x3002;<br>&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x5404;&#x5927;&#x516C;&#x53F8;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x7ADE;&#x4E89;&#x5173;&#x7CFB;&#x6216;&#x5229;&#x76CA;&#x5173;&#x7CFB;&#xFF0C;&#x5916;&#x52A0;MySQL&#x5728;&#x88AB;&#x6536;&#x8D2D;&#x4E4B;&#x540E;&#x9010;&#x6E10;&#x7531;&#x5F00;&#x6E90;&#x5411;&#x95ED;&#x6E90;&#x8F6F;&#x4EF6;&#x8F6C;&#x53D8;&#xFF0C;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x629B;&#x5F03;&#x4E86;MySQL&#x3002;&#x5F53;&#x524D;&#xFF0C;&#x8C37;&#x6B4C;&#x3001;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x7B49;&#x6280;&#x672F;&#x9886;&#x57DF;&#x51B3;&#x5B9A;&#x5C06;MySQL&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x7684;&#x4E1A;&#x52A1;&#x8F6C;&#x79FB;&#x5230;MariaDB&#x6570;&#x636E;&#x5E93;&#xFF0C;Linux&#x5F00;&#x6E90;&#x7CFB;&#x7EDF;&#x7684;&#x9886;&#x8896;&#x7EA2;&#x5E3D;&#x516C;&#x53F8;&#x4E5F;&#x51B3;&#x5B9A;&#x5728;RHEL 7&#x3001;CentOS 7&#x4EE5;&#x53CA;&#x6700;&#x65B0;&#x7684;Fedora&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5C06;MariaDB&#x4F5C;&#x4E3A;&#x9ED8;&#x8BA4;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x4E14;&#x7EA2;&#x5E3D;&#x516C;&#x53F8;&#x66F4;&#x662F;&#x9996;&#x6B21;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x77E5;&#x8BC6;&#x52A0;&#x5165;&#x5230;&#x4E86;RHCE&#x8BA4;&#x8BC1;&#x7684;&#x8003;&#x8BD5;&#x5185;&#x5BB9;&#x4E2D;&#x3002;&#x968F;&#x540E;&#xFF0C;&#x8FD8;&#x6709;&#x6570;&#x5341;&#x4E2A;&#x5E38;&#x89C1;&#x7684;Linux&#x7CFB;&#x7EDF;&#xFF08;&#x5982;openSUSE&#x3001;Slackware&#x7B49;&#xFF09;&#x4E5F;&#x4F5C;&#x51FA;&#x4E86;&#x540C;&#x6837;&#x7684;&#x8868;&#x6001;&#x3002;<br>&#x4F46;&#x662F;&#xFF0C;&#x5766;&#x767D;&#x6765;&#x8BB2;&#xFF0C;&#x867D;&#x7136;IT&#x884C;&#x4E1A;&#x5DE8;&#x5934;&#x90FD;&#x51B3;&#x5B9A;&#x91C7;&#x7528;MariaDB&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;MariaDB&#x8F83;&#x4E4B;&#x4E8E;MySQL&#x6709;&#x660E;&#x663E;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x8001;&#x5E08;&#x7528;&#x4E86;&#x8FD1;&#x4E24;&#x5468;&#x7684;&#x65F6;&#x95F4;&#x6D4B;&#x8BD5;&#x4E86;MariaDB&#x4E0E;MySQL&#x7684;&#x533A;&#x522B;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x4E86;&#x591A;&#x9879;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x5A92;&#x4F53;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x79CD;&#x660E;&#x663E;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;MariaDB&#x548C;MySQL&#x5728;&#x6027;&#x80FD;&#x4E0A;&#x57FA;&#x672C;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x4E24;&#x8005;&#x7684;&#x64CD;&#x4F5C;&#x547D;&#x4EE4;&#x4E5F;&#x5341;&#x5206;&#x76F8;&#x4F3C;&#x3002;&#x4ECE;&#x52A1;&#x5B9E;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;&#x5728;&#x638C;&#x63E1;&#x4E86;MariaDB&#x6570;&#x636E;&#x5E93;&#x7684;&#x547D;&#x4EE4;&#x548C;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x5728;&#x4ECA;&#x540E;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x5373;&#x4F7F;&#x9047;&#x5230;MySQL&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x4E0A;&#x624B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x65E0;&#x8BBA;&#x9009;&#x62E9;&#x54EA;&#x4E00;&#x4E2A;&#x6765;&#x5B66;&#x4E60;&#x90FD;&#x6089;&#x542C;&#x541B;&#x4FBF;&#xFF0C;&#x800C;&#x672C;&#x4E66;&#x4E4B;&#x6240;&#x4EE5;&#x9009;&#x62E9;&#x4EE5;MariaDB&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x8BB2;&#x89E3;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4ECE;RHCE&#x8BA4;&#x8BC1;&#x8003;&#x8BD5;&#x548C;&#x6280;&#x672F;&#x5784;&#x65AD;&#x7684;&#x89D2;&#x5EA6;&#x4F5C;&#x7684;&#x51B3;&#x5B9A;&#x3002;</p>
<h2 id="2-&#x521D;&#x59CB;&#x5316;MariaDB&#x670D;&#x52A1;"><a href="#2-&#x521D;&#x59CB;&#x5316;MariaDB&#x670D;&#x52A1;" class="headerlink" title="2 &#x521D;&#x59CB;&#x5316;MariaDB&#x670D;&#x52A1;"></a>2 &#x521D;&#x59CB;&#x5316;MariaDB&#x670D;&#x52A1;</h2><p>&#x76F8;&#x8F83;&#x4E8E;MySQL&#xFF0C;MariaDB&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x6709;&#x4E86;&#x5F88;&#x591A;&#x65B0;&#x9C9C;&#x7684;&#x6269;&#x5C55;&#x7279;&#x6027;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x5FAE;&#x79D2;&#x7EA7;&#x522B;&#x7684;&#x652F;&#x6301;&#x3001;&#x7EBF;&#x7A0B;&#x6C60;&#x3001;&#x5B50;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x3001;&#x8FDB;&#x7A0B;&#x62A5;&#x544A;&#x7B49;&#x3002;&#x5728;&#x914D;&#x7F6E;&#x59A5;&#x5F53;Yum&#x8F6F;&#x4EF6;&#x4ED3;&#x5E93;&#x540E;&#xFF0C;&#x5373;&#x53EF;&#x5B89;&#x88C5;&#x90E8;&#x7F72;MariaDB&#x6570;&#x636E;&#x5E93;&#x4E3B;&#x7A0B;&#x5E8F;&#x53CA;&#x670D;&#x52A1;&#x7AEF;&#x7A0B;&#x5E8F;&#x4E86;&#x3002;<br>&#x5728;&#x5B89;&#x88C5;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x8BB0;&#x5F97;&#x542F;&#x52A8;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x52A0;&#x5165;&#x5230;&#x5F00;&#x673A;&#x542F;&#x52A8;&#x9879;&#x4E2D;&#x3002;</p>
<figure class="highlight shell"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br></pre></td><td class="code"><pre><span class="line">[root@jaking ~]# yum install mariadb mariadb-server</span><br><span class="line">Loaded plugins: langpacks, product-id, subscription-manager</span><br><span class="line">&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x7701;&#x7565;&#x90E8;&#x5206;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;</span><br><span class="line">Installing:</span><br><span class="line">&#xA0;mariadb x86_64 1:5.5.35-3.el7 rhel 8.9 M</span><br><span class="line">&#xA0;mariadb-server x86_64 1:5.5.35-3.el7 rhel 11 M</span><br><span class="line">Installing for dependencies:</span><br><span class="line">&#xA0;perl-Compress-Raw-Bzip2 x86_64 2.061-3.el7 rhel 32 k</span><br><span class="line">&#xA0;perl-Compress-Raw-Zlib x86_64 1:2.061-4.el7 rhel 57 k</span><br><span class="line">&#xA0;perl-DBD-MySQL x86_64 4.023-5.el7 rhel 140 k</span><br><span class="line">&#xA0;perl-DBI x86_64 1.627-4.el7 rhel 802 k</span><br><span class="line">&#xA0;perl-Data-Dumper x86_64 2.145-3.el7 rhel 47 k</span><br><span class="line">&#xA0;perl-IO-Compress noarch 2.061-2.el7 rhel 260 k</span><br><span class="line">&#xA0;perl-Net-Daemon noarch 0.48-5.el7 rhel 51 k</span><br><span class="line">&#xA0;perl-PlRPC noarch 0.2020-14.el7 rhel 36 k</span><br><span class="line">Transaction Summary</span><br><span class="line">================================================================================</span><br><span class="line">Install 2 Packages (+8 Dependent packages)</span><br><span class="line">Total download size: 21 M</span><br><span class="line">Installed size: 107 M</span><br><span class="line">Is this ok [y/d/N]: y </span><br><span class="line">Downloading packages:</span><br><span class="line">--------------------------------------------------------------------------------</span><br><span class="line">Total 82 MB/s | 21 MB 00:00 </span><br><span class="line">Running transaction check</span><br><span class="line">Running transaction test</span><br><span class="line">Transaction test succeeded</span><br><span class="line">Running transaction</span><br><span class="line">&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x7701;&#x7565;&#x90E8;&#x5206;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;</span><br><span class="line">Installed:</span><br><span class="line">&#xA0;mariadb.x86_64 1:5.5.35-3.el7 mariadb-server.x86_64 1:5.5.35-3.el7 </span><br><span class="line">Dependency Installed:</span><br><span class="line">&#xA0;perl-Compress-Raw-Bzip2.x86_64 0:2.061-3.el7 </span><br><span class="line">&#xA0;perl-Compress-Raw-Zlib.x86_64 1:2.061-4.el7 </span><br><span class="line">&#xA0;perl-DBD-MySQL.x86_64 0:4.023-5.el7 </span><br><span class="line">&#xA0;perl-DBI.x86_64 0:1.627-4.el7 </span><br><span class="line">&#xA0;perl-Data-Dumper.x86_64 0:2.145-3.el7 </span><br><span class="line">&#xA0;perl-IO-Compress.noarch 0:2.061-2.el7 </span><br><span class="line">&#xA0;perl-Net-Daemon.noarch 0:0.48-5.el7 </span><br><span class="line">&#xA0;perl-PlRPC.noarch 0:0.2020-14.el7</span><br><span class="line">Complete!</span><br><span class="line">[root@jaking ~]# systemctl start mariadb </span><br><span class="line">[root@jaking ~]# systemctl enable mariadb </span><br><span class="line">ln -s &apos;/usr/lib/systemd/system/mariadb.service&apos; &apos;/etc/systemd/system/multi-user.target.wants/mariadb.service&apos;</span><br></pre></td></tr></tbody></table></figure>
<p>&#x5728;&#x786E;&#x8BA4;MariaDB&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x7A0B;&#x5E8F;&#x5B89;&#x88C5;&#x5B8C;&#x6BD5;&#x5E76;&#x6210;&#x529F;&#x542F;&#x52A8;&#x540E;&#x8BF7;&#x4E0D;&#x8981;&#x7ACB;&#x5373;&#x4F7F;&#x7528;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B89;&#x5168;&#x6027;&#x548C;&#x6B63;&#x5E38;&#x8FD0;&#x8F6C;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x4E2A;&#x521D;&#x59CB;&#x5316;&#x64CD;&#x4F5C;&#x6D89;&#x53CA;&#x4E0B;&#x9762;5&#x4E2A;&#x6B65;&#x9AA4;&#x3002;</p>
<ol>
<li>&#x8BBE;&#x7F6E;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5BC6;&#x7801;&#x503C;&#xFF08;&#x6CE8;&#x610F;&#xFF0C;&#x8BE5;&#x5BC6;&#x7801;&#x5E76;&#x975E;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x5BC6;&#x7801;&#x503C;&#x9ED8;&#x8BA4;&#x5E94;&#x8BE5;&#x4E3A;&#x7A7A;&#xFF0C;&#x53EF;&#x76F4;&#x63A5;&#x6309;&#x56DE;&#x8F66;&#x952E;&#xFF09;&#x3002;</li>
<li>&#x8BBE;&#x7F6E;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E13;&#x6709;&#x5BC6;&#x7801;&#x3002;</li>
<li>&#x968F;&#x540E;&#x5220;&#x9664;&#x533F;&#x540D;&#x8D26;&#x6237;&#xFF0C;&#x7981;&#x6B62;root&#x7BA1;&#x7406;&#x5458;&#x4ECE;&#x8FDC;&#x7A0B;&#x767B;&#x5F55;</li>
<li>&#x5220;&#x9664;&#x9ED8;&#x8BA4;&#x7684;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x53D6;&#x6D88;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;</li>
<li>&#x5237;&#x65B0;&#x6388;&#x6743;&#x5217;&#x8868;&#xFF0C;&#x8BA9;&#x521D;&#x59CB;&#x5316;&#x7684;&#x8BBE;&#x5B9A;&#x7ACB;&#x5373;&#x751F;&#x6548;&#x3002;<br>&#x5BF9;&#x4E8E;&#x4E0A;&#x8FF0;&#x6570;&#x636E;&#x5E93;&#x521D;&#x59CB;&#x5316;&#x7684;&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;&#xFF0C;&#x8001;&#x5E08;&#x5DF2;&#x7ECF;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#x65C1;&#x8FB9;&#x8FDB;&#x884C;&#x4E86;&#x7B80;&#x5355;&#x6CE8;&#x91CA;&#xFF0C;&#x786E;&#x4FDD;&#x5404;&#x4F4D;&#x8BFB;&#x8005;&#x66F4;&#x76F4;&#x89C2;&#x5730;&#x4E86;&#x89E3;&#x8981;&#x8F93;&#x5165;&#x7684;&#x5185;&#x5BB9;&#xFF1A;</li>
</ol>
<figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br></pre></td><td class="code"><pre><span class="line">[root@jaking ~]# mysql_secure_installation </span><br><span class="line">/usr/bin/mysql_secure_installation: line 379: find_mysql_client: command not found</span><br><span class="line">NOTE: RUNNING ALL PARTS OF THIS SCRIPT IS RECOMMENDED FOR ALL MariaDB</span><br><span class="line">&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; SERVERS IN PRODUCTION USE!&#xA0; PLEASE READ EACH STEP CAREFULLY!</span><br><span class="line">In order to log into MariaDB to secure it, we&apos;ll need the current</span><br><span class="line">password for the root user.&#xA0; If you&apos;ve just installed MariaDB, and</span><br><span class="line">you haven&apos;t set the root password yet, the password will be blank,</span><br><span class="line">so you should just press enter here.</span><br><span class="line">Enter current password for root (enter for none):  &#x5F53;&#x524D;&#x6570;&#x636E;&#x5E93;&#x5BC6;&#x7801;&#x4E3A;&#x7A7A;&#xFF0C;&#x76F4;&#x63A5;&#x6309;&#x56DE;&#x8F66;&#x952E;</span><br><span class="line">OK, successfully used password, moving on...</span><br><span class="line">Setting the root password ensures that nobody can log into the MariaDB</span><br><span class="line">root user without the proper authorisation.</span><br><span class="line">Set root password? [Y/n] y</span><br><span class="line">New password:&#x8F93;&#x5165;&#x8981;&#x4E3A;root&#x7BA1;&#x7406;&#x5458;&#x8BBE;&#x7F6E;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5BC6;&#x7801;</span><br><span class="line">Re-enter new password:&#x518D;&#x6B21;&#x8F93;&#x5165;&#x5BC6;&#x7801;</span><br><span class="line">Password updated successfully!</span><br><span class="line">Reloading privilege tables..</span><br><span class="line">&#xA0;... Success!</span><br><span class="line">By default, a MariaDB installation has an anonymous user, allowing anyone</span><br><span class="line">to log into MariaDB without having to have a user account created for</span><br><span class="line">them.&#xA0; This is intended only for testing, and to make the installation</span><br><span class="line">go a bit smoother.&#xA0; You should remove them before moving into a</span><br><span class="line">production environment.</span><br><span class="line">Remove anonymous users? [Y/n] y&#xFF08;&#x5220;&#x9664;&#x533F;&#x540D;&#x8D26;&#x6237;&#xFF09;</span><br><span class="line">... Success!</span><br><span class="line">Normally, root should only be allowed to connect from &apos;localhost&apos;.&#xA0; This</span><br><span class="line">ensures that someone cannot guess at the root password from the network.</span><br><span class="line">Disallow root login remotely? [Y/n] y&#xFF08;&#x7981;&#x6B62;root&#x7BA1;&#x7406;&#x5458;&#x4ECE;&#x8FDC;&#x7A0B;&#x767B;&#x5F55;&#xFF09;</span><br><span class="line">&#xA0;... Success!</span><br><span class="line">By default, MariaDB comes with a database named &apos;test&apos; that anyone can</span><br><span class="line">access.&#xA0; This is also intended only for testing, and should be removed</span><br><span class="line">before moving into a production environment.</span><br><span class="line">Remove test database and access to it? [Y/n] y&#xFF08;&#x5220;&#x9664;test&#x6570;&#x636E;&#x5E93;&#x5E76;&#x53D6;&#x6D88;&#x5BF9;&#x5B83;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF09;</span><br><span class="line">&#xA0;- Dropping test database...</span><br><span class="line">&#xA0;... Success!</span><br><span class="line">&#xA0;- Removing privileges on test database...</span><br><span class="line">&#xA0;... Success!</span><br><span class="line">Reloading the privilege tables will ensure that all changes made so far</span><br><span class="line">will take effect immediately.</span><br><span class="line">Reload privilege tables now? [Y/n] y&#xFF08;&#x5237;&#x65B0;&#x6388;&#x6743;&#x8868;&#xFF0C;&#x8BA9;&#x521D;&#x59CB;&#x5316;&#x540E;&#x7684;&#x8BBE;&#x5B9A;&#x7ACB;&#x5373;&#x751F;&#x6548;&#xFF09;</span><br><span class="line">&#xA0;... Success!</span><br><span class="line">Cleaning up...</span><br><span class="line">All done!&#xA0; If you&apos;ve completed all of the above steps, your MariaDB</span><br><span class="line">installation should now be secure.</span><br><span class="line">Thanks for using MariaDB!</span><br></pre></td></tr></tbody></table></figure>
<p>&#x5728;&#x5F88;&#x591A;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x90FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7AD9;&#x5E93;&#x5206;&#x79BB;&#x7684;&#x6280;&#x672F;&#xFF08;&#x5373;&#x7F51;&#x7AD9;&#x548C;&#x6570;&#x636E;&#x5E93;&#x4E0D;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x8BA9;root&#x7BA1;&#x7406;&#x5458;&#x8FDC;&#x7A0B;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x53EF;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x521D;&#x59CB;&#x5316;&#x64CD;&#x4F5C;&#x4E2D;&#x8BBE;&#x7F6E;&#x7B56;&#x7565;&#xFF0C;&#x4EE5;&#x5141;&#x8BB8;root&#x7BA1;&#x7406;&#x5458;&#x4ECE;&#x8FDC;&#x7A0B;&#x8BBF;&#x95EE;&#x3002;&#x7136;&#x540E;&#x8FD8;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x4F7F;&#x5176;&#x653E;&#x884C;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#x7684;&#x8BBF;&#x95EE;&#x8BF7;&#x6C42;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#x9ED8;&#x8BA4;&#x4F1A;&#x5360;&#x7528;<code>3306</code>&#x7AEF;&#x53E3;&#xFF0C;&#x5728;&#x9632;&#x706B;&#x5899;&#x7B56;&#x7565;&#x4E2D;&#x670D;&#x52A1;&#x540D;&#x79F0;&#x7EDF;&#x4E00;&#x53EB;&#x4F5C;<code>mysql</code>&#xFF1A;</p>
<figure class="highlight shell"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">[root@jaking ~]# firewall-cmd --permanent --add-service=mysql</span><br><span class="line">success</span><br><span class="line">[root@jaking ~]# firewall-cmd --reload</span><br><span class="line">success</span><br></pre></td></tr></tbody></table></figure>
<p>&#x4E00;&#x5207;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C06;&#x9996;&#x6B21;&#x767B;&#x5F55;MariaDB&#x6570;&#x636E;&#x5E93;&#x3002;&#x5176;&#x4E2D;&#xFF0C;-u&#x53C2;&#x6570;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x4EE5;root&#x7BA1;&#x7406;&#x5458;&#x7684;&#x8EAB;&#x4EFD;&#x767B;&#x5F55;&#xFF0C;&#x800C;-p&#x53C2;&#x6570;&#x7528;&#x6765;&#x9A8C;&#x8BC1;&#x8BE5;&#x7528;&#x6237;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5BC6;&#x7801;&#x503C;&#x3002;</p>
<figure class="highlight shell"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">[root@jaking ~]# mysql -u root -p</span><br><span class="line">Enter password: &#x6B64;&#x5904;&#x8F93;&#x5165;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5BC6;&#x7801;</span><br><span class="line">Welcome to the MariaDB monitor. Commands end with ; or \g.</span><br><span class="line">Your MariaDB connection id is 5</span><br><span class="line">Server version: 5.5.35-MariaDB MariaDB Server</span><br><span class="line">Copyright (c) 2000, 2013, Oracle, Monty Program Ab and others.</span><br><span class="line">Type &apos;help;&apos; or &apos;\h&apos; for help. Type &apos;\c&apos; to clear the current input statement.</span><br><span class="line">MariaDB [(none)]&gt;</span><br></pre></td></tr></tbody></table></figure>
<p>&#x5728;&#x767B;&#x5F55;MariaDB&#x6570;&#x636E;&#x5E93;&#x540E;&#x6267;&#x884C;&#x6570;&#x636E;&#x5E93;&#x547D;&#x4EE4;&#x65F6;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x5728;&#x547D;&#x4EE4;&#x540E;&#x9762;&#x7528;&#x5206;&#x53F7;&#xFF08;;&#xFF09;&#x7ED3;&#x5C3E;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E0E;Linux&#x547D;&#x4EE4;&#x6700;&#x663E;&#x8457;&#x7684;&#x533A;&#x522B;&#x3002;&#x5927;&#x5BB6;&#x9700;&#x8981;&#x6162;&#x6162;&#x4E60;&#x60EF;&#x6570;&#x636E;&#x5E93;&#x547D;&#x4EE4;&#x7684;&#x8FD9;&#x79CD;&#x8BBE;&#x5B9A;&#x3002;&#x4E0B;&#x9762;&#x6267;&#x884C;&#x5982;&#x4E0B;&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#x5F53;&#x524D;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#xFF1A;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [(none)]&gt; SHOW databases;</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| Database&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| information_schema |</span><br><span class="line">| mysql&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">| performance_schema |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">3 rows in <span class="keyword">set</span> (<span class="number">0.01</span> sec)</span><br></pre></td></tr></tbody></table></figure>
<p>&#x5C0F;&#x8BD5;&#x725B;&#x5200;&#x8FC7;&#x540E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#x547D;&#x4EE4;&#x5C06;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5BC6;&#x7801;&#x503C;&#x4FEE;&#x6539;&#x4E3A;jaking&#x3002;&#x8FD9;&#x6837;&#x9000;&#x51FA;&#x540E;&#x518D;&#x5C1D;&#x8BD5;&#x767B;&#x5F55;&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x575A;&#x6301;&#x8F93;&#x5165;&#x539F;&#x5148;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x5219;&#x5C06;&#x63D0;&#x793A;&#x8BBF;&#x95EE;&#x5931;&#x8D25;&#x3002;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [(none)]&gt; SET password = PASSWORD(&apos;jaking&apos;);</span><br><span class="line">Query OK, 0 rows affected (0.00 sec)</span><br><span class="line">MariaDB [(none)]&gt; use mysql #&#x5207;&#x6362;&#x5230;mysql&#x5E93;</span><br><span class="line">Reading table information for completion of table and column names</span><br><span class="line">You can turn off this feature to get a quicker startup <span class="keyword">with</span> -A</span><br><span class="line"></span><br><span class="line"><span class="keyword">Database</span> <span class="keyword">changed</span></span><br><span class="line">MariaDB [mysql]&gt; <span class="keyword">exit</span></span><br><span class="line">Bye</span><br></pre></td></tr></tbody></table></figure>
<figure class="highlight shell"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br></pre></td><td class="code"><pre><span class="line">[root@jaking ~]# mysql -u root -p</span><br><span class="line">Enter password:&#x6B64;&#x5904;&#x5E94;&#x8BE5;&#x8F93;&#x5165;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x65B0;&#x5BC6;&#x7801;</span><br><span class="line">ERROR 1045 (28000): Access denied for user &apos;root&apos;@&apos;localhost&apos; (using password: YES)</span><br><span class="line"></span><br><span class="line">[root@jaking ~]# mysql -uroot -pjaking</span><br><span class="line">Welcome to the MariaDB monitor.  Commands end with ; or \g.</span><br><span class="line">Your MariaDB connection id is 17</span><br><span class="line">Server version: 5.5.68-MariaDB MariaDB Server</span><br><span class="line"></span><br><span class="line">Copyright (c) 2000, 2018, Oracle, MariaDB Corporation Ab and others.</span><br><span class="line"></span><br><span class="line">Type &apos;help;&apos; or &apos;\h&apos; for help. Type &apos;\c&apos; to clear the current input statement.</span><br><span class="line"></span><br><span class="line">MariaDB [(none)]&gt; SET password = PASSWORD(&apos;123456&apos;);</span><br><span class="line">Query OK, 0 rows affected (0.00 sec)</span><br><span class="line"></span><br><span class="line">MariaDB [(none)]&gt; exit</span><br><span class="line">Bye</span><br><span class="line">[root@jaking ~]#</span><br></pre></td></tr></tbody></table></figure>
<h2 id="3-&#x7BA1;&#x7406;&#x7528;&#x6237;&#x4EE5;&#x53CA;&#x6388;&#x6743;"><a href="#3-&#x7BA1;&#x7406;&#x7528;&#x6237;&#x4EE5;&#x53CA;&#x6388;&#x6743;" class="headerlink" title="3 &#x7BA1;&#x7406;&#x7528;&#x6237;&#x4EE5;&#x53CA;&#x6388;&#x6743;"></a>3 &#x7BA1;&#x7406;&#x7528;&#x6237;&#x4EE5;&#x53CA;&#x6388;&#x6743;</h2><p>&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x603B;&#x4E0D;&#x80FD;&#x4E00;&#x76F4;&#x201C;&#x6B7B;&#x5543;&#x201D;root&#x7BA1;&#x7406;&#x5458;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x969C;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x8BA9;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x534F;&#x540C;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;MariaDB&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E3A;&#x4ED6;&#x4EEC;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x4E13;&#x7528;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x8D26;&#x6237;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5206;&#x914D;&#x5408;&#x7406;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x9700;&#x6C42;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x53EF;&#x4F7F;&#x7528;root&#x7BA1;&#x7406;&#x5458;&#x767B;&#x5F55;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x7167;&#x201C;CREATE USER &#x7528;&#x6237;&#x540D;@&#x4E3B;&#x673A;&#x540D; IDENTIFIED BY &#x2018;&#x5BC6;&#x7801;&#x2019;; &#x201D;&#x7684;&#x683C;&#x5F0F;&#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x8D26;&#x6237;&#x3002;&#x518D;&#x6B21;&#x63D0;&#x9192;&#x5927;&#x5BB6;&#xFF0C;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x6BCF;&#x6761;&#x6570;&#x636E;&#x5E93;&#x547D;&#x4EE4;&#x540E;&#x9762;&#x7684;&#x5206;&#x53F7;&#xFF08;;&#xFF09;&#x3002;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [(none)]&gt; CREATE USER jaking@localhost IDENTIFIED BY &apos;jaking&apos;;</span><br><span class="line">Query OK, 0 rows affected (0.00 sec)</span><br></pre></td></tr></tbody></table></figure>
<p>&#x521B;&#x5EFA;&#x7684;&#x8D26;&#x6237;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;select&#x547D;&#x4EE4;&#x8BED;&#x53E5;&#x6765;&#x67E5;&#x8BE2;&#x3002;&#x4E0B;&#x9762;&#x547D;&#x4EE4;&#x67E5;&#x8BE2;&#x7684;&#x662F;&#x8D26;&#x6237;jaking&#x7684;&#x4E3B;&#x673A;&#x540D;&#x79F0;&#x3001;&#x8D26;&#x6237;&#x540D;&#x79F0;&#x4EE5;&#x53CA;&#x7ECF;&#x8FC7;&#x52A0;&#x5BC6;&#x7684;&#x5BC6;&#x7801;&#x503C;&#x4FE1;&#x606F;&#xFF1A;<br></p><figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [(none)]&gt; use mysql</span><br><span class="line">Reading table information for completion of table and column names</span><br><span class="line">You can turn off this feature to get a quicker startup <span class="keyword">with</span> -A</span><br><span class="line"><span class="keyword">Database</span> <span class="keyword">changed</span></span><br><span class="line">MariaDB [mysql]&gt; <span class="keyword">SELECT</span> HOST,<span class="keyword">USER</span>,<span class="keyword">PASSWORD</span> <span class="keyword">FROM</span> <span class="keyword">user</span> <span class="keyword">WHERE</span> <span class="keyword">USER</span>=<span class="string">&quot;jaking&quot;</span>;</span><br><span class="line">+<span class="comment">-----------+------+-------------------------------------------+</span></span><br><span class="line">| host&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; | user | password&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; &#xA0;&#xA0;&#xA0;&#xA0;|</span><br><span class="line">+<span class="comment">-----------+------+-------------------------------------------+</span></span><br><span class="line">| localhost | jaking | *55D9962586BE75F4B7D421E6655973DB07D6869F |</span><br><span class="line">+<span class="comment">-----------+------+-------------------------------------------+</span></span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x7528;&#x6237;jaking&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x8D26;&#x6237;&#xFF0C;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x6743;&#x9650;&#x3002;&#x4E0D;&#x4FE1;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x5207;&#x6362;&#x5230;jaking&#x8D26;&#x6237;&#x6765;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#x5F53;&#x524D;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x3002;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x8BE5;&#x8D26;&#x6237;&#x751A;&#x81F3;&#x6CA1;&#x6CD5;&#x67E5;&#x770B;&#x5B8C;&#x6574;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5217;&#x8868;&#xFF08;&#x521A;&#x624D;&#x4F7F;&#x7528;root&#x8D26;&#x6237;&#x65F6;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5230;3&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5217;&#x8868;&#xFF09;&#xFF1A;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [mysql]&gt; exit</span><br><span class="line">Bye</span><br><span class="line">[root@jaking ~]<span class="comment"># mysql -u jaking -p</span></span><br><span class="line">Enter password: &#x6B64;&#x5904;&#x8F93;&#x5165;jaking&#x8D26;&#x6237;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5BC6;&#x7801;</span><br><span class="line">Welcome to the MariaDB monitor.&#xA0; Commands <span class="keyword">end</span> <span class="keyword">with</span> ; or \g.</span><br><span class="line">Your MariaDB connection id is 6</span><br><span class="line">Server version: 5.5.35-MariaDB MariaDB Server</span><br><span class="line">Copyright (c) 2000, 2013, Oracle, Monty Program Ab and others.</span><br><span class="line">Type &apos;<span class="keyword">help</span>;&apos; or &apos;\h&apos; for help. <span class="keyword">Type</span> <span class="string">&apos;\c&apos;</span> <span class="keyword">to</span> <span class="keyword">clear</span> the <span class="keyword">current</span> <span class="keyword">input</span> statement.</span><br><span class="line">MariaDB [(<span class="keyword">none</span>)]&gt; <span class="keyword">show</span> <span class="keyword">databases</span>;</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| Database &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;|</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| information_schema |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">1 row in <span class="keyword">set</span> (<span class="number">0.03</span> sec)</span><br></pre></td></tr></tbody></table></figure>
<p>&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x547D;&#x4EE4;&#x4E00;&#x822C;&#x90FD;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x3002;&#x6211;&#x4EEC;&#x4EE5;grant&#x547D;&#x4EE4;&#x4E3A;&#x4F8B;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#x3002;grant&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x4E3A;&#x8D26;&#x6237;&#x8FDB;&#x884C;&#x6388;&#x6743;&#xFF0C;&#x5176;&#x5E38;&#x89C1;&#x683C;&#x5F0F;&#x5982;&#x8868;1&#x6240;&#x793A;&#x3002;&#x5728;&#x4F7F;&#x7528;grant&#x547D;&#x4EE4;&#x65F6;&#x9700;&#x8981;&#x5199;&#x4E0A;&#x8981;&#x8D4B;&#x4E88;&#x7684;&#x6743;&#x9650;&#x3001;&#x6570;&#x636E;&#x5E93;&#x53CA;&#x8868;&#x5355;&#x540D;&#x79F0;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x8D26;&#x6237;&#x53CA;&#x4E3B;&#x673A;&#x4FE1;&#x606F;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x53EA;&#x8981;&#x7406;&#x89E3;&#x4E86;&#x547D;&#x4EE4;&#x4E2D;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x529F;&#x80FD;&#x542B;&#x4E49;&#xFF0C;&#x4E5F;&#x5C31;&#x4E0D;&#x89C9;&#x5F97;&#x547D;&#x4EE4;&#x590D;&#x6742;&#x96BE;&#x61C2;&#x4E86;&#x3002;</p>
<p>&#x8868;1. GRANT&#x547D;&#x4EE4;&#x7684;&#x5E38;&#x89C1;&#x683C;&#x5F0F;&#x4EE5;&#x53CA;&#x89E3;&#x91CA;</p>
<table>
<thead>
<tr>
<th>&#x547D;&#x4EE4;</th>
<th>&#x4F5C;&#x7528;</th>
</tr>
</thead>
<tbody>
<tr>
<td>GRANT &#x6743;&#x9650; ON &#x6570;&#x636E;&#x5E93;.&#x8868;&#x5355;&#x540D;&#x79F0; TO &#x7528;&#x6237;@&#x4E3B;&#x673A;&#x540D;</td>
<td>&#x5BF9;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x7279;&#x5B9A;&#x8868;&#x5355;&#x7ED9;&#x4E88;&#x6388;&#x6743;</td>
</tr>
<tr>
<td>GRANT &#x6743;&#x9650; ON &#x6570;&#x636E;&#x5E93;.* TO &#x7528;&#x6237;&#x540D;@&#x4E3B;&#x673A;&#x540D;</td>
<td>&#x5BF9;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8868;&#x5355;&#x7ED9;&#x4E88;&#x6388;&#x6743;</td>
</tr>
<tr>
<td>GRANT &#x6743;&#x9650; ON <em>.</em> TO &#x7528;&#x6237;&#x540D;@&#x4E3B;&#x673A;&#x540D;</td>
<td>&#x5BF9;&#x6240;&#x6709;&#x6570;&#x636E;&#x5E93;&#x53CA;&#x6240;&#x6709;&#x8868;&#x5355;&#x7ED9;&#x4E88;&#x6388;&#x6743;</td>
</tr>
<tr>
<td>GRANT &#x6743;&#x9650;1,&#x6743;&#x9650;2 ON &#x6570;&#x636E;&#x5E93;.* TO &#x7528;&#x6237;&#x540D;@&#x4E3B;&#x673A;&#x540D;</td>
<td>&#x5BF9;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8868;&#x5355;&#x7ED9;&#x4E88;&#x591A;&#x4E2A;&#x6388;&#x6743;</td>
</tr>
<tr>
<td>GRANT ALL PRIVILEGES ON <em>.</em> TO &#x7528;&#x6237;&#x540D;@&#x4E3B;&#x673A;&#x540D;</td>
<td>&#x5BF9;&#x6240;&#x6709;&#x6570;&#x636E;&#x5E93;&#x53CA;&#x6240;&#x6709;&#x8868;&#x5355;&#x7ED9;&#x4E88;&#x5168;&#x90E8;&#x6388;&#x6743;&#xFF08;&#x9700;&#x8C28;&#x614E;&#x64CD;&#x4F5C;&#xFF09;</td>
</tr>
</tbody>
</table>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8D26;&#x6237;&#x7684;&#x6388;&#x6743;&#x5DE5;&#x4F5C;&#x80AF;&#x5B9A;&#x662F;&#x9700;&#x8981;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5458;&#x6765;&#x6267;&#x884C;&#x7684;&#x3002;&#x4E0B;&#x9762;&#x4EE5;root&#x7BA1;&#x7406;&#x5458;&#x7684;&#x8EAB;&#x4EFD;&#x767B;&#x5F55;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x9488;&#x5BF9;mysql&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;user&#x8868;&#x5355;&#x5411;&#x8D26;&#x6237;jaking&#x6388;&#x4E88;&#x67E5;&#x8BE2;&#x3001;&#x66F4;&#x65B0;&#x3001;&#x5220;&#x9664;&#x4EE5;&#x53CA;&#x63D2;&#x5165;&#x7B49;&#x6743;&#x9650;&#x3002;<br>&#x6388;&#x6743;&#x64CD;&#x4F5C;&#x6267;&#x884C;&#x540E;&#x6765;&#x67E5;&#x770B;&#x4E0B;jaking&#x7528;&#x6237;&#x7684;&#x6743;&#x9650;&#x5427;&#xFF1A;<br></p><figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">[root@jaking ~]<span class="comment"># mysql -u root -p</span></span><br><span class="line">Enter password:&#x6B64;&#x5904;&#x8F93;&#x5165;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5BC6;&#x7801;</span><br><span class="line">MariaDB [(none)]&gt; use mysql;</span><br><span class="line">Reading table information for completion of table and column names</span><br><span class="line">You can turn off this feature to get a quicker startup <span class="keyword">with</span> -A</span><br><span class="line"><span class="keyword">Database</span> <span class="keyword">changed</span></span><br><span class="line">MariaDB [mysql]&gt; <span class="keyword">GRANT</span> <span class="keyword">SELECT</span>,<span class="keyword">UPDATE</span>,<span class="keyword">DELETE</span>,<span class="keyword">INSERT</span> <span class="keyword">ON</span> mysql.user <span class="keyword">TO</span> jaking@localhost;</span><br><span class="line">Query OK, 0 rows affected (0.00 sec)</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x5728;&#x6267;&#x884C;&#x5B8C;&#x4E0A;&#x8FF0;&#x6388;&#x6743;&#x64CD;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x67E5;&#x770B;&#x4E00;&#x4E0B;&#x8D26;&#x6237;jaking&#x7684;&#x6743;&#x9650;&#xFF1A;<br></p><figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [(none)]&gt; SHOW GRANTS FOR jaking@localhost;</span><br><span class="line">+<span class="comment">-------------------------------------------------------------------------------------------------------------+</span></span><br><span class="line">| Grants for jaking@localhost |</span><br><span class="line">+<span class="comment">-------------------------------------------------------------------------------------------------------------+</span></span><br><span class="line">| <span class="keyword">GRANT</span> <span class="keyword">USAGE</span> <span class="keyword">ON</span> *.* <span class="keyword">TO</span> <span class="string">&apos;jaking&apos;</span>@<span class="string">&apos;localhost&apos;</span> <span class="keyword">IDENTIFIED</span> <span class="keyword">BY</span> <span class="keyword">PASSWORD</span> <span class="string">&apos;*55D9962586BE75F4B7D421E6655973DB07D6869F&apos;</span> |</span><br><span class="line">| <span class="keyword">GRANT</span> <span class="keyword">SELECT</span>, <span class="keyword">INSERT</span>, <span class="keyword">UPDATE</span>, <span class="keyword">DELETE</span> <span class="keyword">ON</span> <span class="string">`mysql`</span>.<span class="string">`user`</span> <span class="keyword">TO</span> <span class="string">&apos;jaking&apos;</span>@<span class="string">&apos;localhost&apos;</span> |</span><br><span class="line">+<span class="comment">-------------------------------------------------------------------------------------------------------------+</span></span><br><span class="line"><span class="number">2</span> <span class="keyword">rows</span> <span class="keyword">in</span> <span class="keyword">set</span> (<span class="number">0.00</span> sec)</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x4E0A;&#x9762;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#x4E2D;&#x663E;&#x793A;&#x8D26;&#x6237;jaking&#x5DF2;&#x7ECF;&#x62E5;&#x6709;&#x4E86;&#x9488;&#x5BF9;mysql&#x6570;&#x636E;&#x5E93;&#x4E2D;user&#x8868;&#x5355;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x6743;&#x9650;&#x4E86;&#x3002;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x518D;&#x5207;&#x6362;&#x5230;&#x8D26;&#x6237;jaking&#xFF0C;&#x6B64;&#x65F6;&#x5C31;&#x80FD;&#x591F;&#x770B;&#x5230;mysql&#x6570;&#x636E;&#x5E93;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x80FD;&#x770B;&#x5230;&#x8868;&#x5355;user&#xFF08;&#x5176;&#x4F59;&#x8868;&#x5355;&#x4F1A;&#x56E0;&#x65E0;&#x6743;&#x9650;&#x800C;&#x88AB;&#x7EE7;&#x7EED;&#x9690;&#x85CF;&#xFF09;&#xFF1A;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br></pre></td><td class="code"><pre><span class="line">[root@jaking ~]<span class="comment"># mysql -u jaking -p</span></span><br><span class="line">Enter password:&#x6B64;&#x5904;&#x8F93;&#x5165;jaking&#x7528;&#x6237;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5BC6;&#x7801;</span><br><span class="line">MariaDB [(none)]&gt; show databases;</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| Database&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| information_schema |</span><br><span class="line">| mysql&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">2 rows in <span class="keyword">set</span> (<span class="number">0.01</span> sec)</span><br><span class="line">MariaDB [(<span class="keyword">none</span>)]&gt; <span class="keyword">use</span> mysql</span><br><span class="line">Reading <span class="keyword">table</span> information <span class="keyword">for</span> completion <span class="keyword">of</span> <span class="keyword">table</span> <span class="keyword">and</span> <span class="keyword">column</span> <span class="keyword">names</span></span><br><span class="line">You can turn <span class="keyword">off</span> this feature <span class="keyword">to</span> <span class="keyword">get</span> a quicker <span class="keyword">startup</span> <span class="keyword">with</span> -A</span><br><span class="line"><span class="keyword">Database</span> <span class="keyword">changed</span></span><br><span class="line">MariaDB [mysql]&gt; <span class="keyword">SHOW</span> <span class="keyword">TABLES</span>;</span><br><span class="line">+<span class="comment">-----------------+</span></span><br><span class="line">| Tables_in_mysql |</span><br><span class="line">+<span class="comment">-----------------+</span></span><br><span class="line">| user&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">+<span class="comment">-----------------+</span></span><br><span class="line">1 row in <span class="keyword">set</span> (<span class="number">0.01</span> sec)</span><br><span class="line">MariaDB [mysql]&gt; <span class="keyword">exit</span></span><br><span class="line">Bye</span><br></pre></td></tr></tbody></table></figure>
<p>&#x5927;&#x5BB6;&#x4E0D;&#x8981;&#x5FC3;&#x6025;&#xFF0C;&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x4F1A;&#x6162;&#x6162;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x5E93;&#x5185;&#x5BB9;&#x7684;&#x4FEE;&#x6539;&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x524D;&#xFF0C;&#x5148;&#x5207;&#x6362;&#x56DE;root&#x8D26;&#x6237;&#xFF0C;&#x79FB;&#x9664;&#x521A;&#x624D;&#x7684;&#x6388;&#x6743;&#x3002;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br></pre></td><td class="code"><pre><span class="line">[root@jaking ~]<span class="comment"># mysql -u root -p</span></span><br><span class="line">Enter password:&#x6B64;&#x5904;&#x8F93;&#x5165;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5BC6;&#x7801;</span><br><span class="line">MariaDB [(none)]&gt; use mysql;</span><br><span class="line">Reading table information for completion of table and column names</span><br><span class="line">You can turn off this feature to get a quicker startup <span class="keyword">with</span> -A</span><br><span class="line"><span class="keyword">Database</span> <span class="keyword">changed</span></span><br><span class="line">MariaDB [(mysql)]&gt; <span class="keyword">REVOKE</span> <span class="keyword">SELECT</span>,<span class="keyword">UPDATE</span>,<span class="keyword">DELETE</span>,<span class="keyword">INSERT</span> <span class="keyword">ON</span> mysql.user <span class="keyword">FROM</span> jaking@localhost;</span><br><span class="line">Query OK, 0 rows affected (0.00 sec)</span><br><span class="line"></span><br><span class="line">&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x9664;&#x4E86;&#x79FB;&#x9664;&#x6388;&#x6743;&#x7684;&#x547D;&#x4EE4;&#xFF08;<span class="keyword">revoke</span>&#xFF09;&#x4E0E;&#x6388;&#x6743;&#x547D;&#x4EE4;&#xFF08;<span class="keyword">grant</span>&#xFF09;&#x4E0D;&#x540C;&#x4E4B;&#x5916;&#xFF0C;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x597D;&#x8BB0;&#x800C;&#x4E14;&#x4E5F;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;&#x6267;&#x884C;&#x79FB;&#x9664;&#x6388;&#x6743;&#x547D;&#x4EE4;&#x540E;&#xFF0C;&#x518D;&#x6765;&#x67E5;&#x770B;&#x8D26;&#x6237;jaking&#x7684;&#x4FE1;&#x606F;&#xFF1A;</span><br><span class="line"></span><br><span class="line">MariaDB [(<span class="keyword">none</span>)]&gt; <span class="keyword">SHOW</span> <span class="keyword">GRANTS</span> <span class="keyword">FOR</span> jaking@localhost;</span><br><span class="line">+<span class="comment">-------------------------------------------------------------------------------------------------------------+</span></span><br><span class="line">| Grants for jaking@localhost |</span><br><span class="line">+<span class="comment">-------------------------------------------------------------------------------------------------------------+</span></span><br><span class="line">| <span class="keyword">GRANT</span> <span class="keyword">USAGE</span> <span class="keyword">ON</span> *.* <span class="keyword">TO</span> <span class="string">&apos;jaking&apos;</span>@<span class="string">&apos;localhost&apos;</span> <span class="keyword">IDENTIFIED</span> <span class="keyword">BY</span> <span class="keyword">PASSWORD</span> <span class="string">&apos;*55D9962586BE75F4B7D421E6655973DB07D6869F&apos;</span> |</span><br><span class="line">+<span class="comment">-------------------------------------------------------------------------------------------------------------+</span></span><br><span class="line"><span class="number">1</span> <span class="keyword">row</span> <span class="keyword">in</span> <span class="keyword">set</span> (<span class="number">0.00</span> sec)</span><br><span class="line"></span><br><span class="line">MariaDB [mysql]&gt; <span class="keyword">exit</span></span><br><span class="line">Bye</span><br><span class="line">[root@localhost ~]<span class="comment"># mysql -u jaking -pjaking</span></span><br><span class="line">Welcome <span class="keyword">to</span> the MariaDB monitor.  Commands <span class="keyword">end</span> <span class="keyword">with</span> ; or \g.</span><br><span class="line">Your MariaDB connection id is 19</span><br><span class="line">Server version: 5.5.52-MariaDB MariaDB Server</span><br><span class="line"></span><br><span class="line">Copyright (c) 2000, 2016, Oracle, MariaDB Corporation Ab and others.</span><br><span class="line"></span><br><span class="line">Type &apos;<span class="keyword">help</span>;&apos; or &apos;\h&apos; for help. <span class="keyword">Type</span> <span class="string">&apos;\c&apos;</span> <span class="keyword">to</span> <span class="keyword">clear</span> the <span class="keyword">current</span> <span class="keyword">input</span> statement.</span><br><span class="line"></span><br><span class="line">MariaDB [(<span class="keyword">none</span>)]&gt; <span class="keyword">show</span> <span class="keyword">databases</span>;</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| Database           |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| information_schema |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">1 row in <span class="keyword">set</span> (<span class="number">0.00</span> sec)</span><br><span class="line"></span><br><span class="line">MariaDB [(<span class="keyword">none</span>)]&gt;</span><br></pre></td></tr></tbody></table></figure>
<h2 id="4-&#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x8868;&#x5355;"><a href="#4-&#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x8868;&#x5355;" class="headerlink" title="4. &#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x8868;&#x5355;"></a>4. &#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x8868;&#x5355;</h2><p>&#x5728;MariaDB&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x5B58;&#x653E;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x8868;&#xFF0C;&#x6570;&#x636E;&#x8868;&#x5355;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x6700;&#x6838;&#x5FC3;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x81EA;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7ED3;&#x6784;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5176;&#x4E2D;&#x5408;&#x7406;&#x5730;&#x5B58;&#x653E;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x4FBF;&#x540E;&#x671F;&#x8F7B;&#x677E;&#x5730;&#x7EF4;&#x62A4;&#x548C;&#x4FEE;&#x6539;&#x3002;&#x8868;2&#x7F57;&#x5217;&#x4E86;&#x540E;&#x6587;&#x4E2D;&#x5C06;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x6570;&#x636E;&#x5E93;&#x547D;&#x4EE4;&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x8868;2. &#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x7684;&#x547D;&#x4EE4;&#x4EE5;&#x53CA;&#x4F5C;&#x7528;</p>
<table>
<thead>
<tr>
<th>&#x7528;&#x6CD5;</th>
<th>&#x4F5C;&#x7528;</th>
</tr>
</thead>
<tbody>
<tr>
<td>CREATE database &#x6570;&#x636E;&#x5E93;&#x540D;&#x79F0;;</td>
<td>&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x6570;&#x636E;&#x5E93;</td>
</tr>
<tr>
<td>DESCRIBE &#x8868;&#x5355;&#x540D;&#x79F0;;</td>
<td>&#x63CF;&#x8FF0;&#x8868;&#x5355;</td>
</tr>
<tr>
<td>UPDATE &#x8868;&#x5355;&#x540D;&#x79F0; SET col=&#x65B0;&#x503C; WHERE col &gt; &#x539F;&#x59CB;&#x503C;</td>
<td>&#x66F4;&#x65B0;&#x8868;&#x5355;&#x4E2D;&#x7684;&#x6570;&#x636E;</td>
</tr>
<tr>
<td>USE &#x6570;&#x636E;&#x5E93;&#x540D;&#x79F0;;</td>
<td>&#x6307;&#x5B9A;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x5E93;</td>
</tr>
<tr>
<td>SHOW databases;</td>
<td>&#x663E;&#x793A;&#x5F53;&#x524D;&#x5DF2;&#x6709;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5E93;</td>
</tr>
<tr>
<td>SHOW TABLES;</td>
<td>&#x663E;&#x793A;&#x5F53;&#x524D;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x8868;&#x5355;</td>
</tr>
<tr>
<td>SELECT * FROM &#x8868;&#x5355;&#x540D;&#x79F0;;</td>
<td>&#x4ECE;&#x8868;&#x5355;&#x4E2D;&#x9009;&#x4E2D;&#x67D0;&#x4E2A;&#x8BB0;&#x5F55;&#x503C;</td>
</tr>
<tr>
<td>DELETE FROM &#x8868;&#x5355;&#x540D; WHERE col=&#x503C;;</td>
<td>&#x4ECE;&#x8868;&#x5355;&#x6C47;&#x603B;&#x5220;&#x9664;&#x67D0;&#x4E2A;&#x8BB0;&#x5F55;&#x503C;</td>
</tr>
</tbody>
</table>
<p>&#x5EFA;&#x7ACB;&#x6570;&#x636E;&#x5E93;&#x662F;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x7684;&#x8D77;&#x70B9;&#x3002;&#x73B0;&#x5728;&#x5C1D;&#x8BD5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;jaking&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x67E5;&#x770B;&#x6570;&#x636E;&#x5E93;&#x5217;&#x8868;&#xFF0C;&#x6B64;&#x65F6;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x5B83;&#x4E86;&#xFF1A;<br></p><figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [(none)]&gt; CREATE DATABASE jaking;</span><br><span class="line">Query OK, 1 row affected (0.00 sec)</span><br><span class="line">MariaDB [(none)]&gt; SHOW databases;</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| Database&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| information_schema |</span><br><span class="line">| jaking&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">| mysql&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">| performance_schema |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">4 rows in <span class="keyword">set</span> (<span class="number">0.04</span> sec)</span><br></pre></td></tr></tbody></table></figure><p></p>
<p>&#x8981;&#x60F3;&#x521B;&#x5EFA;&#x6570;&#x636E;&#x8868;&#x5355;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x5207;&#x6362;&#x5230;&#x67D0;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x65B0;&#x5EFA;&#x7684;jaking&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x521B;&#x5EFA;&#x8868;&#x5355;mybook&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x8868;&#x5355;&#x7684;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5373;&#x5B9A;&#x4E49;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x5185;&#x5BB9;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x6211;&#x4EEC;&#x5206;&#x522B;&#x5B9A;&#x4E49;3&#x4E2A;&#x5B57;&#x6BB5;&#x9879;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;<strong>&#x957F;&#x5EA6;&#x4E3A;15&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x5B57;&#x7B26;&#x578B;&#x5B57;&#x6BB5;name&#x7528;&#x6765;&#x5B58;&#x653E;&#x56FE;&#x4E66;&#x540D;&#x79F0;</strong>&#xFF0C;&#x6574;&#x578B;&#x5B57;&#x6BB5;price&#x548C;pages&#x5206;&#x522B;&#x5B58;&#x50A8;&#x56FE;&#x4E66;&#x7684;&#x4EF7;&#x683C;&#x548C;&#x9875;&#x6570;&#x3002;&#x5F53;&#x6267;&#x884C;&#x5B8C;&#x4E0B;&#x8FF0;&#x547D;&#x4EE4;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8868;&#x5355;&#x7684;&#x7ED3;&#x6784;&#x4FE1;&#x606F;&#x4E86;&#xFF1A;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [(none)]&gt; use jaking;</span><br><span class="line">Database changed</span><br><span class="line">MariaDB [jaking]&gt; CREATE TABLE mybook (name char(15),price int,pages int);</span><br><span class="line">Query OK, 0 rows affected (0.16 sec)</span><br><span class="line">MariaDB [jaking]&gt; DESCRIBE mybook;</span><br><span class="line">+<span class="comment">-------+----------+------+-----+---------+-------+</span></span><br><span class="line">| Field | Type&#xA0;&#xA0;&#xA0;&#xA0; | Null | Key | Default | Extra |</span><br><span class="line">+<span class="comment">-------+----------+------+-----+---------+-------+</span></span><br><span class="line">| name&#xA0; | char(15) | YES&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0; | NULL&#xA0;&#xA0;&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">| price | int(11)&#xA0; | YES&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0; | NULL&#xA0;&#xA0;&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">| pages | int(11)&#xA0; | YES&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0; | NULL&#xA0;&#xA0;&#xA0; |&#xA0;&#xA0; &#xA0;&#xA0;&#xA0;&#xA0;|</span><br><span class="line">+<span class="comment">-------+----------+------+-----+---------+-------+</span></span><br><span class="line">3 rows in <span class="keyword">set</span> (<span class="number">0.02</span> sec)</span><br></pre></td></tr></tbody></table></figure>
<h2 id="5-&#x7BA1;&#x7406;&#x8868;&#x5355;&#x53CA;&#x6570;&#x636E;"><a href="#5-&#x7BA1;&#x7406;&#x8868;&#x5355;&#x53CA;&#x6570;&#x636E;" class="headerlink" title="5 &#x7BA1;&#x7406;&#x8868;&#x5355;&#x53CA;&#x6570;&#x636E;"></a>5 &#x7BA1;&#x7406;&#x8868;&#x5355;&#x53CA;&#x6570;&#x636E;</h2><p>&#x63A5;&#x4E0B;&#x6765;&#x5411;mybook&#x6570;&#x636E;&#x8868;&#x5355;&#x4E2D;&#x63D2;&#x4E00;&#x6761;&#x56FE;&#x4E66;&#x4FE1;&#x606F;&#x3002;&#x4E3A;&#x6B64;&#x9700;&#x8981;&#x4F7F;&#x7528;INSERT&#x547D;&#x4EE4;&#xFF0C;&#x5E76;&#x5728;&#x547D;&#x4EE4;&#x4E2D;&#x5199;&#x6E05;&#x8868;&#x5355;&#x540D;&#x79F0;&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x5B57;&#x6BB5;&#x9879;&#x3002;&#x6267;&#x884C;&#x8BE5;&#x547D;&#x4EE4;&#x4E4B;&#x540E;&#x5373;&#x53EF;&#x5B8C;&#x6210;&#x56FE;&#x4E66;&#x5199;&#x5165;&#x4FE1;&#x606F;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8BE5;&#x547D;&#x4EE4;&#x63D2;&#x5165;&#x4E00;&#x6761;&#x56FE;&#x4E66;&#x4FE1;&#x606F;&#xFF0C;&#x5176;&#x4E2D;&#x4E66;&#x540D;&#x4E3A;jaking&#xFF0C;&#x4EF7;&#x683C;&#x548C;&#x9875;&#x6570;&#x5206;&#x522B;&#x662F;60&#x5143;&#x548C;518&#x9875;&#x3002;&#x5728;&#x547D;&#x4EE4;&#x6267;&#x884C;&#x540E;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x56FE;&#x4E66;&#x4FE1;&#x606F;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x5199;&#x5165;&#x5230;&#x6570;&#x636E;&#x8868;&#x5355;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x67E5;&#x8BE2;&#x8868;&#x5355;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x4F7F;&#x7528;select&#x547D;&#x4EE4;&#x67E5;&#x8BE2;&#x8868;&#x5355;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x52A0;&#x4E0A;&#x60F3;&#x8981;&#x67E5;&#x8BE2;&#x7684;&#x5B57;&#x6BB5;&#xFF1B;&#x5982;&#x679C;&#x60F3;&#x67E5;&#x770B;&#x8868;&#x5355;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x661F;&#x53F7;&#xFF08;*&#xFF09;&#x901A;&#x914D;&#x7B26;&#x6765;&#x663E;&#x793A;&#xFF1A;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [jaking]&gt; INSERT INTO mybook(name,price,pages) VALUES(&apos;jaking&apos;,&apos;60&apos;, &apos;518&apos;);</span><br><span class="line">Query OK, 1 row affected (0.00 sec)</span><br><span class="line">MariaDB [jaking]&gt; select * from mybook;</span><br><span class="line">+<span class="comment">------------+-------+-------+</span></span><br><span class="line">| name&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; | price | pages |</span><br><span class="line">+<span class="comment">------------+-------+-------+</span></span><br><span class="line">| jaking |&#xA0;&#xA0;&#xA0; 60 |&#xA0;&#xA0; 518 |</span><br><span class="line">+<span class="comment">------------+-------+-------+</span></span><br><span class="line">1 rows in <span class="keyword">set</span> (<span class="number">0.01</span> sec)</span><br></pre></td></tr></tbody></table></figure>
<p>&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x6765;&#x8BB2;&#xFF0C;&#x9700;&#x8981;&#x505A;&#x597D;&#x56DB;&#x95E8;&#x529F;&#x8BFE;&#x2014;&#x589E;&#x3001;&#x5220;&#x3001;&#x6539;&#x3001;&#x67E5;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x521B;&#x5EFA;&#x6570;&#x636E;&#x8868;&#x5355;&#x5E76;&#x5728;&#x5176;&#x4E2D;&#x63D2;&#x5165;&#x5185;&#x5BB9;&#x4EC5;&#x4EC5;&#x662F;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x638C;&#x63E1;&#x6570;&#x636E;&#x8868;&#x5355;&#x5185;&#x5BB9;&#x7684;&#x4FEE;&#x6539;&#x65B9;&#x6CD5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;update&#x547D;&#x4EE4;&#x5C06;&#x521A;&#x624D;&#x63D2;&#x5165;&#x7684;jaking&#x56FE;&#x4E66;&#x4FE1;&#x606F;&#x7684;&#x4EF7;&#x683C;&#x4FEE;&#x6539;&#x4E3A;55&#x5143;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4F7F;&#x7528;select&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x8BE5;&#x56FE;&#x4E66;&#x7684;&#x540D;&#x79F0;&#x548C;&#x5B9A;&#x4EF7;&#x4FE1;&#x606F;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x53EA;&#x67E5;&#x770B;&#x56FE;&#x4E66;&#x7684;&#x540D;&#x79F0;&#x548C;&#x5B9A;&#x4EF7;&#xFF0C;&#x800C;&#x4E0D;&#x6D89;&#x53CA;&#x9875;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x65E0;&#x987B;&#x518D;&#x7528;&#x661F;&#x53F7;&#x901A;&#x914D;&#x7B26;&#x6765;&#x663E;&#x793A;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x3002;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [jaking]&gt; UPDATE mybook SET price=55 ;</span><br><span class="line">Query OK, 1 row affected (0.00 sec)</span><br><span class="line">Rows matched: 1&#xA0; Changed: 1&#xA0; Warnings: 0</span><br><span class="line">MariaDB [jaking]&gt; SELECT name,price FROM mybook;</span><br><span class="line">+<span class="comment">------------+-------+</span></span><br><span class="line">| name&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; | price |</span><br><span class="line">+<span class="comment">------------+-------+</span></span><br><span class="line">| jaking |&#xA0;&#xA0;&#xA0; 55 |</span><br><span class="line">+<span class="comment">------------+-------+</span></span><br><span class="line">1 row in <span class="keyword">set</span> (<span class="number">0.00</span> sec)</span><br></pre></td></tr></tbody></table></figure>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;delete&#x547D;&#x4EE4;&#x5220;&#x9664;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x8868;&#x5355;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x4F7F;&#x7528;delete&#x547D;&#x4EE4;&#x5220;&#x9664;&#x6570;&#x636E;&#x8868;&#x5355;mybook&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x67E5;&#x770B;&#x8BE5;&#x8868;&#x5355;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x8BE5;&#x8868;&#x5355;&#x5185;&#x5BB9;&#x4E3A;&#x7A7A;&#x4E86;&#x3002;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [jaking]&gt; DELETE FROM mybook;</span><br><span class="line">Query OK, 1 row affected (0.01 sec)</span><br><span class="line">MariaDB [jaking]&gt; SELECT * FROM mybook;</span><br><span class="line">Empty <span class="keyword">set</span> (<span class="number">0.00</span> sec)</span><br></pre></td></tr></tbody></table></figure>
<p>&#x4E00;&#x822C;&#x6765;&#x8BB2;&#xFF0C;&#x6570;&#x636E;&#x8868;&#x5355;&#x4E2D;&#x4F1A;&#x5B58;&#x653E;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x6761;&#x6570;&#x636E;&#x4FE1;&#x606F;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x521B;&#x5EFA;&#x7684;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x56FE;&#x4E66;&#x4FE1;&#x606F;&#x7684;mybook&#x8868;&#x5355;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x56FE;&#x4E66;&#x4FE1;&#x606F;&#x4E5F;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EA;&#x60F3;&#x67E5;&#x770B;&#x5176;&#x4EF7;&#x683C;&#x5927;&#x4E8E;&#x67D0;&#x4E2A;&#x6570;&#x503C;&#x7684;&#x56FE;&#x4E66;&#x65F6;&#xFF0C;&#x53C8;&#x8BE5;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x67E5;&#x8BE2;&#x8BED;&#x53E5;&#x5462;&#xFF1F;<br>&#x4E0B;&#x9762;&#x5148;&#x4F7F;&#x7528;insert&#x63D2;&#x5165;&#x547D;&#x4EE4;&#x4F9D;&#x6B21;&#x63D2;&#x5165;4&#x6761;&#x56FE;&#x4E66;&#x4FE1;&#x606F;&#xFF1A;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">INSERT</span> <span class="keyword">INTO</span> mybook(<span class="keyword">name</span>,price,pages) <span class="keyword">VALUES</span>(<span class="string">&apos;jaking1&apos;</span>,<span class="string">&apos;30&apos;</span>,<span class="string">&apos;518&apos;</span>);</span><br><span class="line"><span class="keyword">INSERT</span> <span class="keyword">INTO</span> mybook(<span class="keyword">name</span>,price,pages) <span class="keyword">VALUES</span>(<span class="string">&apos;jaking2&apos;</span>,<span class="string">&apos;50&apos;</span>,<span class="string">&apos;518&apos;</span>);</span><br><span class="line"><span class="keyword">INSERT</span> <span class="keyword">INTO</span> mybook(<span class="keyword">name</span>,price,pages) <span class="keyword">VALUES</span>(<span class="string">&apos;jaking3&apos;</span>,<span class="string">&apos;80&apos;</span>,<span class="string">&apos;518&apos;</span>);</span><br><span class="line"><span class="keyword">INSERT</span> <span class="keyword">INTO</span> mybook(<span class="keyword">name</span>,price,pages) <span class="keyword">VALUES</span>(<span class="string">&apos;jaking4&apos;</span>,<span class="string">&apos;100&apos;</span>,<span class="string">&apos;518&apos;</span>);</span><br></pre></td></tr></tbody></table></figure>
<p>&#x8981;&#x60F3;&#x8BA9;&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#x66F4;&#x52A0;&#x7CBE;&#x51C6;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x4F7F;&#x7528;select&#x4E0E;where&#x547D;&#x4EE4;&#x4E86;&#x3002;&#x5176;&#x4E2D;&#xFF0C;where&#x547D;&#x4EE4;&#x662F;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8FDB;&#x884C;&#x5339;&#x914D;&#x67E5;&#x8BE2;&#x7684;&#x6761;&#x4EF6;&#x547D;&#x4EE4;&#x3002;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4EC5;&#x67E5;&#x627E;&#x51FA;&#x7B26;&#x5408;&#x8BE5;&#x6761;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x3002;&#x8868;3&#x5217;&#x51FA;&#x4E86;where&#x547D;&#x4EE4;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x67E5;&#x8BE2;&#x53C2;&#x6570;&#x4EE5;&#x53CA;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x8868;3. where&#x547D;&#x4EE4;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x53C2;&#x6570;&#x4EE5;&#x53CA;&#x4F5C;&#x7528;</p>
<table>
<thead>
<tr>
<th>&#x53C2;&#x6570;</th>
<th>&#x4F5C;&#x7528;</th>
</tr>
</thead>
<tbody>
<tr>
<td>=</td>
<td>&#x76F8;&#x7B49;</td>
</tr>
<tr>
<td>&lt;&gt; &#x6216; !=</td>
<td>&#x4E0D;&#x76F8;&#x7B49;</td>
</tr>
<tr>
<td>&gt;</td>
<td>&#x5927;&#x4E8E;</td>
</tr>
<tr>
<td>&lt;</td>
<td>&#x5C0F;&#x4E8E;</td>
</tr>
<tr>
<td>&gt;=</td>
<td>&#x5927;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;</td>
</tr>
<tr>
<td>&lt;=</td>
<td>&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;</td>
</tr>
<tr>
<td>BETWEEN</td>
<td>&#x5728;&#x67D0;&#x4E2A;&#x8303;&#x56F4;&#x5185;</td>
</tr>
<tr>
<td>LIKE</td>
<td>&#x641C;&#x7D22;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;</td>
</tr>
<tr>
<td>IN</td>
<td>&#x5728;&#x5217;&#x4E2D;&#x641C;&#x7D22;&#x591A;&#x4E2A;&#x503C;</td>
</tr>
</tbody>
</table>
<p>&#x73B0;&#x5728;&#x8FDB;&#x5165;&#x52A8;&#x624B;&#x73AF;&#x8282;&#x3002;&#x5206;&#x522B;&#x5728;mybook&#x8868;&#x5355;&#x4E2D;&#x67E5;&#x627E;&#x51FA;&#x4EF7;&#x683C;&#x5927;&#x4E8E;75&#x5143;&#x6216;&#x4EF7;&#x683C;&#x4E0D;&#x7B49;&#x4E8E;80&#x5143;&#x7684;&#x56FE;&#x4E66;&#xFF0C;&#x5176;&#x5BF9;&#x5E94;&#x7684;&#x547D;&#x4EE4;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;&#x5728;&#x719F;&#x6089;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x4E4B;&#x540E;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x5C1D;&#x8BD5;&#x7CBE;&#x786E;&#x67E5;&#x627E;&#x56FE;&#x4E66;&#x540D;&#x4E3A;jaking2&#x7684;&#x56FE;&#x4E66;&#x4FE1;&#x606F;&#x3002;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [jaking]&gt; SELECT * FROM mybook WHERE price&gt;75;</span><br><span class="line">+<span class="comment">-------------+-------+-------+</span></span><br><span class="line">| name&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; | price | pages |</span><br><span class="line">+<span class="comment">-------------+-------+-------+</span></span><br><span class="line">| jaking3 |&#xA0;&#xA0;&#xA0; 80 |&#xA0;&#xA0; 518 |</span><br><span class="line">| jaking4 |&#xA0;&#xA0; 100 |&#xA0;&#xA0; 518 |</span><br><span class="line">+<span class="comment">-------------+-------+-------+</span></span><br><span class="line">2 rows in <span class="keyword">set</span> (<span class="number">0.06</span> sec)</span><br><span class="line">MariaDB [jaking]&gt; <span class="keyword">SELECT</span> * <span class="keyword">FROM</span> mybook <span class="keyword">WHERE</span> price!=<span class="number">80</span>;</span><br><span class="line">+<span class="comment">-------------+-------+-------+</span></span><br><span class="line">| name | price | pages&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">+<span class="comment">-------------+-------+-------+</span></span><br><span class="line">| jaking1&#xA0; | 30&#xA0; | 518&#xA0;&#xA0;&#xA0; |</span><br><span class="line">| jaking2&#xA0; | 50&#xA0; | 518&#xA0;&#xA0;&#xA0; |</span><br><span class="line">| jaking4&#xA0; | 100 | 518&#xA0;&#xA0;&#xA0; |</span><br><span class="line">+<span class="comment">-------------+-------+-------+</span></span><br><span class="line">3 rows in <span class="keyword">set</span> (<span class="number">0.01</span> sec)</span><br><span class="line">MariaDB [mysql]&gt; <span class="keyword">exit</span></span><br><span class="line">Bye</span><br></pre></td></tr></tbody></table></figure>
<h2 id="6-&#x6570;&#x636E;&#x5E93;&#x7684;&#x5907;&#x4EFD;&#x53CA;&#x6062;&#x590D;"><a href="#6-&#x6570;&#x636E;&#x5E93;&#x7684;&#x5907;&#x4EFD;&#x53CA;&#x6062;&#x590D;" class="headerlink" title="6 &#x6570;&#x636E;&#x5E93;&#x7684;&#x5907;&#x4EFD;&#x53CA;&#x6062;&#x590D;"></a>6 &#x6570;&#x636E;&#x5E93;&#x7684;&#x5907;&#x4EFD;&#x53CA;&#x6062;&#x590D;</h2><p>&#x524D;&#x6587;&#x63D0;&#x5230;&#xFF0C;&#x672C;&#x4E66;&#x7684;&#x6280;&#x672F;&#x4E3B;&#x7EBF;&#x662F;Linux&#x7CFB;&#x7EDF;&#x7684;&#x8FD0;&#x7EF4;&#x65B9;&#x5411;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x6DF1;&#x5165;&#x7684;&#x8BB2;&#x89E3;&#xFF0C;&#x56E0;&#x6B64;&#x5927;&#x5BB6;&#x638C;&#x63E1;&#x4E86;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x547D;&#x4EE4;&#x4E4B;&#x540E;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x4E0B;&#x9762;&#x8981;&#x8BB2;&#x89E3;&#x7684;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5907;&#x4EFD;&#x4EE5;&#x53CA;&#x6062;&#x590D;&#xFF0C;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x6BD4;&#x8F83;&#x5B9E;&#x7528;&#xFF0C;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x80FD;&#x591F;&#x638C;&#x63E1;&#x3002;<br>mysqldump&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x5907;&#x4EFD;&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;&#xFF0C;&#x683C;&#x5F0F;&#x4E3A;&#x201C;mysqldump [&#x53C2;&#x6570;] [&#x6570;&#x636E;&#x5E93;&#x540D;&#x79F0;]&#x201D;&#x3002;&#x5176;&#x4E2D;&#x53C2;&#x6570;&#x4E0E;mysql&#x547D;&#x4EE4;&#x5927;&#x81F4;&#x76F8;&#x540C;&#xFF0C;-u&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x767B;&#x5F55;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8D26;&#x6237;&#x540D;&#x79F0;&#xFF0C;-p&#x53C2;&#x6570;&#x4EE3;&#x8868;&#x5BC6;&#x7801;&#x63D0;&#x793A;&#x7B26;&#x3002;&#x4E0B;&#x9762;&#x5C06;jaking&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x5BFC;&#x51FA;&#x6210;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x4FDD;&#x5B58;&#x5230;root&#x7BA1;&#x7406;&#x5458;&#x7684;&#x5BB6;&#x76EE;&#x5F55;&#x4E2D;&#xFF1A;</p>
<pre><code>[root@jaking ~]# mysqldump -u root -p jaking &gt; /root/jakingDB.dump
Enter password:&#x6B64;&#x5904;&#x8F93;&#x5165;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5BC6;&#x7801;
</code></pre><p>&#x7136;&#x540E;&#x8FDB;&#x5165;MariaDB&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x5F7B;&#x5E95;&#x5220;&#x9664;jaking&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8FD9;&#x6837;mybook&#x6570;&#x636E;&#x8868;&#x5355;&#x4E5F;&#x5C06;&#x88AB;&#x5F7B;&#x5E95;&#x5220;&#x9664;&#x3002;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x5EFA;&#x7ACB;jaking&#x6570;&#x636E;&#x5E93;&#xFF1A;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line">MariaDB [(none)]&gt; DROP DATABASE jaking;</span><br><span class="line">Query OK, 1 row affected (0.04 sec)</span><br><span class="line">MariaDB [(none)]&gt; SHOW databases;</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| Database&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">| information_schema |</span><br><span class="line">| mysql&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">| performance_schema |</span><br><span class="line">+<span class="comment">--------------------+</span></span><br><span class="line">3 rows in <span class="keyword">set</span> (<span class="number">0.02</span> sec)</span><br><span class="line">MariaDB [(<span class="keyword">none</span>)]&gt; <span class="keyword">CREATE</span> <span class="keyword">DATABASE</span> jaking;</span><br><span class="line">Query OK, 1 row affected (0.00 sec)</span><br></pre></td></tr></tbody></table></figure>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x6062;&#x590D;&#x6548;&#x679C;&#x7684;&#x65F6;&#x523B;&#xFF01;&#x4F7F;&#x7528;&#x8F93;&#x5165;&#x91CD;&#x5B9A;&#x5411;&#x7B26;&#x628A;&#x521A;&#x521A;&#x5907;&#x4EFD;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x5BFC;&#x5165;&#x5230;mysql&#x547D;&#x4EE4;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x8BE5;&#x547D;&#x4EE4;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x767B;&#x5F55;&#x5230;MariaDB&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5C31;&#x53C8;&#x80FD;&#x770B;&#x5230;jaking&#x6570;&#x636E;&#x5E93;&#x4EE5;&#x53CA;mybook&#x6570;&#x636E;&#x8868;&#x5355;&#x4E86;&#x3002;&#x6570;&#x636E;&#x5E93;&#x6062;&#x590D;&#x6210;&#x529F;&#xFF01;</p>
<figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br></pre></td><td class="code"><pre><span class="line">[root@jaking ~]<span class="comment"># mysql -u root -p jaking &lt; /root/jakingDB.dump </span></span><br><span class="line">Enter password: &#x6B64;&#x5904;&#x8F93;&#x5165;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5BC6;&#x7801;&#x503C;</span><br><span class="line">[root@jaking ~]<span class="comment"># mysql -u root -p</span></span><br><span class="line">Enter password: &#x6B64;&#x5904;&#x8F93;&#x5165;root&#x7BA1;&#x7406;&#x5458;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5BC6;&#x7801;&#x503C;</span><br><span class="line">MariaDB [(none)]&gt; use jaking;</span><br><span class="line">Reading table information for completion of table and column names</span><br><span class="line">You can turn off this feature to get a quicker startup <span class="keyword">with</span> -A</span><br><span class="line"><span class="keyword">Database</span> <span class="keyword">changed</span></span><br><span class="line">MariaDB [jaking]&gt; <span class="keyword">SHOW</span> <span class="keyword">tables</span>;</span><br><span class="line">+<span class="comment">----------------------+</span></span><br><span class="line">| Tables_in_jaking |</span><br><span class="line">+<span class="comment">----------------------+</span></span><br><span class="line">| mybook&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">+<span class="comment">----------------------+</span></span><br><span class="line">1 row in <span class="keyword">set</span> (<span class="number">0.05</span> sec)</span><br><span class="line">MariaDB [jaking]&gt; <span class="keyword">DESCRIBE</span> mybook;</span><br><span class="line">+<span class="comment">-------+----------+------+-----+---------+-------+</span></span><br><span class="line">| Field | Type&#xA0;&#xA0;&#xA0;&#xA0; | Null | Key | Default | Extra |</span><br><span class="line">+<span class="comment">-------+----------+------+-----+---------+-------+</span></span><br><span class="line">| name&#xA0; | char(15) | YES&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0; | NULL&#xA0;&#xA0;&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">| price | int(11)&#xA0; | YES&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0; | NULL&#xA0;&#xA0;&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">| pages | int(11)&#xA0; | YES&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0; | NULL&#xA0;&#xA0;&#xA0; |&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; |</span><br><span class="line">+<span class="comment">-------+----------+------+-----+---------+-------+</span></span><br><span class="line">3 rows in <span class="keyword">set</span> (<span class="number">0.02</span> sec)</span><br><span class="line">MariaDB [jaking]&gt; <span class="keyword">select</span> * <span class="keyword">from</span> mybook;</span><br><span class="line">+<span class="comment">---------+-------+-------+</span></span><br><span class="line">| name    | price | pages |</span><br><span class="line">+<span class="comment">---------+-------+-------+</span></span><br><span class="line">| jaking1 |    30 |   518 |</span><br><span class="line">| jaking2 |    50 |   518 |</span><br><span class="line">| jaking3 |    80 |   518 |</span><br><span class="line">| jaking4 |   100 |   518 |</span><br><span class="line">+<span class="comment">---------+-------+-------+</span></span><br><span class="line">4 rows in <span class="keyword">set</span> (<span class="number">0.00</span> sec)</span><br><span class="line"></span><br><span class="line">MariaDB [jaking]&gt;</span><br></pre></td></tr></tbody></table></figure>
<p>&#x8865;&#x5145;&#xFF1A;<br></p><figure class="highlight sql"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">create</span> <span class="keyword">database</span> jaking;</span><br><span class="line"><span class="keyword">use</span> jaking;</span><br><span class="line"><span class="keyword">CREATE</span> <span class="keyword">TABLE</span> mybook (<span class="keyword">name</span> <span class="built_in">char</span>(<span class="number">15</span>),price <span class="built_in">int</span>,pages <span class="built_in">int</span>);</span><br><span class="line"><span class="keyword">INSERT</span> <span class="keyword">INTO</span> mybook(<span class="keyword">name</span>,price,pages) <span class="keyword">VALUES</span>(<span class="string">&apos;jaking1&apos;</span>,<span class="string">&apos;30&apos;</span>,<span class="string">&apos;518&apos;</span>);</span><br><span class="line"><span class="keyword">INSERT</span> <span class="keyword">INTO</span> mybook(<span class="keyword">name</span>,price,pages) <span class="keyword">VALUES</span>(<span class="string">&apos;jaking2&apos;</span>,<span class="string">&apos;50&apos;</span>,<span class="string">&apos;518&apos;</span>);</span><br><span class="line"><span class="keyword">INSERT</span> <span class="keyword">INTO</span> mybook(<span class="keyword">name</span>,price,pages) <span class="keyword">VALUES</span>(<span class="string">&apos;jaking3&apos;</span>,<span class="string">&apos;80&apos;</span>,<span class="string">&apos;518&apos;</span>);</span><br><span class="line"><span class="keyword">INSERT</span> <span class="keyword">INTO</span> mybook(<span class="keyword">name</span>,price,pages) <span class="keyword">VALUES</span>(<span class="string">&apos;jaking4&apos;</span>,<span class="string">&apos;100&apos;</span>,<span class="string">&apos;518&apos;</span>);</span><br><span class="line"><span class="keyword">show</span> <span class="keyword">tables</span>;</span><br><span class="line"><span class="keyword">select</span> * <span class="keyword">from</span> mybook;</span><br></pre></td></tr></tbody></table></figure><p></p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    
        <div>
            <a href="/posts/fbf617b4/" class="post-more waves-button">
                阅读全文 »
            </a>
        </div>
    </div>
    
</article>

        </li>
    
        <li class="post-list-item fade">
            <article id="post-Linux无法挂载sysroot并自动进入紧急模式" class="article-card article-type-post" itemprop="blogPost">

    


  
    <h3 class="post-title" itemprop="name">
      <a href="/posts/aabbd398/">Linux无法挂载sysroot并自动进入紧急模式</a>
    </h3>
  




     <div class="post-meta">
        <time class="post-time" title="2022-06-07 12:56:22" datetime="2022-06-07T04:56:22.000Z" itemprop="datePublished">2022-06-07</time>

    </div>

    <div class="post-content" id="post-content" itemprop="postContent">

    
        <p>如果系统出现非正常关机之后；<br>如意外断电之后，使文件系统出现错误状态，导致系统无法正常开机</p>
<p>开机后会自动进入紧急模式：<br>
    
        <div>
            <a href="/posts/aabbd398/" class="post-more waves-button">
                阅读全文 »
            </a>
        </div>
    </p></div>
    
</article>

        </li>
    
        <li class="post-list-item fade">
            <article id="post-Linux常见日志文件" class="article-card article-type-post" itemprop="blogPost">

    


  
    <h3 class="post-title" itemprop="name">
      <a href="/posts/15c0e66c/">Linux常见日志文件</a>
    </h3>
  




     <div class="post-meta">
        <time class="post-time" title="2022-06-07 12:55:52" datetime="2022-06-07T04:55:52.000Z" itemprop="datePublished">2022-06-07</time>

    </div>

    <div class="post-content" id="post-content" itemprop="postContent">

    
        <table>
<thead>
<tr>
<th>&#x65E5;&#x5FD7;&#x6587;&#x4EF6;</th>
<th>&#x8BF4;&#x660E;</th>
</tr>
</thead>
<tbody>
<tr>
<td>/var/log/message</td>
<td>&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x65E5;&#x5FD7;&#x6D88;&#x606F;&#x8BB0;&#x5F55;&#x5728;&#x6B64;&#x5904;&#x3002;&#x4E5F;&#x6709;&#x4F8B;&#x5916;&#x7684;&#xFF1A;&#x5982;&#x4E0E;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#xFF0C;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5904;&#x7406;&#x76F8;&#x5173;&#x7684;&#x5B9A;&#x671F;&#x4F5C;&#x4E1A;&#x4EFB;&#x52A1;&#x7B49;</td>
</tr>
<tr>
<td>/var/log/secure</td>
<td>&#x5B89;&#x5168;&#x548C;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#x76F8;&#x5173;&#x7684;&#x6D88;&#x606F;&#x548C;&#x767B;&#x5F55;&#x5931;&#x8D25;&#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x3002;ssh&#x8FDC;&#x7A0B;&#x8FDE;&#x63A5;&#x4EA7;&#x751F;&#x7684;&#x65E5;&#x5FD7;</td>
</tr>
<tr>
<td>/var/log/maillog</td>
<td>&#x4E0E;&#x90AE;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x76F8;&#x5173;&#x7684;&#x6D88;&#x606F;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;</td>
</tr>
<tr>
<td>/var/log/cron</td>
<td>&#x4E0E;&#x5B9A;&#x671F;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x76F8;&#x5173;&#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;</td>
</tr>
<tr>
<td>/var/log/boot.log</td>
<td>&#x4E0E;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x76F8;&#x5173;&#x7684;&#x6D88;&#x606F;&#x8BB0;&#x5F55;</td>
</tr>
<tr>
<td>/var/log/dmesg</td>
<td>&#x4E0E;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x76F8;&#x5173;&#x7684;&#x6D88;&#x606F;&#x8BB0;&#x5F55;</td>
</tr>
<tr>
<td>/var/log/wtmp</td>
<td>&#x8BE5;&#x6587;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#xFF0C;&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x767B;&#x5F55;&#x6B21;&#x6570;&#x548C;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x7B49;&#x4FE1;&#x606F;&#x3002;&#x53EF;&#x4EE5;&#x7528;last&#x547D;&#x4EE4;&#x67E5;&#x770B;wtmp&#x7684;&#x5185;&#x5BB9;&#x3002;</td>
</tr>
<tr>
<td>/var/log/btmp</td>
<td>&#x8BB0;&#x5F55;&#x9519;&#x8BEF;&#x767B;&#x5F55;&#x7CFB;&#x7EDF;&#x7684;&#x65E5;&#x5FD7;&#x3002;&#x53EF;&#x4EE5;&#x7528;lastb&#x547D;&#x4EE4;&#x67E5;&#x770B;</td>
</tr>
<tr>
<td></td>
<td></td>
</tr>
</tbody>
</table>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    
        <div>
            <a href="/posts/15c0e66c/" class="post-more waves-button">
                阅读全文 »
            </a>
        </div>
    </div>
    
</article>

        </li>
    
        <li class="post-list-item fade">
            <article id="post-Linux的日志切割" class="article-card article-type-post" itemprop="blogPost">

    


  
    <h3 class="post-title" itemprop="name">
      <a href="/posts/c4bbfe69/">Linux的日志切割</a>
    </h3>
  




     <div class="post-meta">
        <time class="post-time" title="2022-06-07 12:55:37" datetime="2022-06-07T04:55:37.000Z" itemprop="datePublished">2022-06-07</time>

    </div>

    <div class="post-content" id="post-content" itemprop="postContent">

    
        <blockquote>
<p>&#x5982;&#x679C;&#x65E5;&#x5FD7;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x6CA1;&#x6709;&#x670D;&#x52A1;&#x5411;&#x91CC;&#x9762;&#x5199;&#x5185;&#x5BB9;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x5229;&#x7528;<code>split</code>&#x8FDB;&#x884C;&#x5207;&#x5272;<br>&#x5982;&#x679C;&#x65E5;&#x5FD7;&#x662F;&#x52A8;&#x6001;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>logrotate</code> &#x8FDB;&#x884C;&#x5207;&#x5272;</p>
</blockquote>
<h3 id="logrotate"><a href="#logrotate" class="headerlink" title="logrotate"></a>logrotate</h3><p><code>/etc/logrotate.conf</code> &#x9884;&#x8BBE;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;</p>
<h3 id="&#x793A;&#x4F8B;&#xFF1A;&#x5BF9;ssh&#x8FDB;&#x884C;&#x65E5;&#x5FD7;&#x5206;&#x5272;"><a href="#&#x793A;&#x4F8B;&#xFF1A;&#x5BF9;ssh&#x8FDB;&#x884C;&#x65E5;&#x5FD7;&#x5206;&#x5272;" class="headerlink" title="&#x793A;&#x4F8B;&#xFF1A;&#x5BF9;ssh&#x8FDB;&#x884C;&#x65E5;&#x5FD7;&#x5206;&#x5272;"></a>&#x793A;&#x4F8B;&#xFF1A;&#x5BF9;ssh&#x8FDB;&#x884C;&#x65E5;&#x5FD7;&#x5206;&#x5272;</h3><figure class="highlight bash"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">vim /etc/logrotate.d/sshd</span><br><span class="line"></span><br><span class="line">/var/<span class="built_in">log</span>/sshd.log{</span><br><span class="line">    missingok</span><br><span class="line">    weekly</span><br><span class="line">    create 0600 root root</span><br><span class="line">    minsize 1M</span><br><span class="line">    rotate 3</span><br><span class="line">}</span><br></pre></td></tr></tbody></table></figure>
<p><strong>&#x91CD;&#x542F;</strong><br></p><figure class="highlight bash"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">systemctl restart rsyslog</span><br></pre></td></tr></tbody></table></figure><p></p>
<p><strong>&#x65E5;&#x5FD7;&#x5207;&#x5272;</strong><br></p><figure class="highlight bash"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">logrotate -vf /etc/logrotate.d/sshd</span><br></pre></td></tr></tbody></table></figure><p></p>
<h3 id="&#x65E5;&#x5FD7;&#x96C6;&#x4E2D;&#x7BA1;&#x7406;"><a href="#&#x65E5;&#x5FD7;&#x96C6;&#x4E2D;&#x7BA1;&#x7406;" class="headerlink" title="&#x65E5;&#x5FD7;&#x96C6;&#x4E2D;&#x7BA1;&#x7406;"></a>&#x65E5;&#x5FD7;&#x96C6;&#x4E2D;&#x7BA1;&#x7406;</h3><script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    
        <div>
            <a href="/posts/c4bbfe69/" class="post-more waves-button">
                阅读全文 »
            </a>
        </div>
    </div>
    
</article>

        </li>
    
        <li class="post-list-item fade">
            <article id="post-web性能压测学习" class="article-card article-type-post" itemprop="blogPost">

    


  
    <h3 class="post-title" itemprop="name">
      <a href="/posts/d185f6ae/">web性能压测学习</a>
    </h3>
  




     <div class="post-meta">
        <time class="post-time" title="2022-06-07 12:55:14" datetime="2022-06-07T04:55:14.000Z" itemprop="datePublished">2022-06-07</time>

    </div>

    <div class="post-content" id="post-content" itemprop="postContent">

    
        <h1 id="&#x5E38;&#x7528;&#x6027;&#x80FD;&#x538B;&#x6D4B;&#x5DE5;&#x5177;&#x5B9E;&#x6218;&#x603B;&#x7ED3;"><a href="#&#x5E38;&#x7528;&#x6027;&#x80FD;&#x538B;&#x6D4B;&#x5DE5;&#x5177;&#x5B9E;&#x6218;&#x603B;&#x7ED3;" class="headerlink" title="&#x5E38;&#x7528;&#x6027;&#x80FD;&#x538B;&#x6D4B;&#x5DE5;&#x5177;&#x5B9E;&#x6218;&#x603B;&#x7ED3;"></a>&#x5E38;&#x7528;&#x6027;&#x80FD;&#x538B;&#x6D4B;&#x5DE5;&#x5177;&#x5B9E;&#x6218;&#x603B;&#x7ED3;</h1><h2 id="&#x4E00;&#x3001;&#x538B;&#x6D4B;&#x80CC;&#x666F;"><a href="#&#x4E00;&#x3001;&#x538B;&#x6D4B;&#x80CC;&#x666F;" class="headerlink" title="&#x4E00;&#x3001;&#x538B;&#x6D4B;&#x80CC;&#x666F;"></a>&#x4E00;&#x3001;&#x538B;&#x6D4B;&#x80CC;&#x666F;</h2><blockquote>
<p>&#x4EE5;&#x524D;&#xFF1A;&#x672A;&#x51FA;&#x793E;&#x4F1A;&#x4E4B;&#x524D;&#x7ECF;&#x5E38;&#x7528;AB&#x5DE5;&#x5177;&#x6765;&#x538B;&#x6D4B;&#x81EA;&#x5DF1;&#x7684; nginx &#x6B22;&#x8FCE;&#x9875;&#x9762;&#xFF0C;&#x770B;&#x7740;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8D44;&#x6E90;&#x4ECE;20%&#x5230;100%&#xFF0C;&#x53D1;&#x73B0;&#x539F;&#x6765;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x5DE5;&#x5177;&#x90FD;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x53F0;4C8G&#x7684;&#x865A;&#x62DF;&#x673A;&#x538B;&#x7206;&#x6EE1;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x9677;&#x5165;&#x6C89;&#x601D;&#xFF0C;&#x4F4E;&#x6210;&#x672C;&#x7684;&#x538B;&#x6D4B;&#x90FD;&#x53EF;&#x4EE5;&#x9020;&#x6210;&#x4E00;&#x53F0;&#x865A;&#x62DF;&#x673A;&#x7684;&#x8D44;&#x6E90;&#x6EE1;&#x8D1F;&#x8F7D;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x662F;&#x4E2A;&#x9759;&#x6001;&#x9875;&#x9762;&#xFF0C;&#x90A3;&#x5982;&#x679C;&#x53D1;&#x751F;&#x5728;&#x4F01;&#x4E1A;&#x8EAB;&#x4E0A;&#x4F1A;&#x5982;&#x4F55;&#xFF1F;&#x9020;&#x6210;&#x7684;&#x635F;&#x5931;&#x8FDC;&#x8FDC;&#x9AD8;&#x4E8E;&#x538B;&#x6D4B;&#x65B9;&#xFF0C;&#x540E;&#x679C;&#x4E0D;&#x6562;&#x60F3;&#x8C61;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x73B0;&#x5728;&#xFF1A;&#x6211;&#x627F;&#x8BA4;&#x4EE5;&#x524D;&#x592A;&#x5929;&#x771F;&#x4E86;&#xFF0C;&#x65E2;&#x7136;&#x6709;&#x538B;&#x6D4B;&#x65B9;&#xFF0C;&#x90A3;&#x80AF;&#x5B9A;&#x6709;&#x9632;&#x5FA1;&#x65B9;&#xFF0C;&#x9047;&#x5230;&#x6076;&#x610F;&#x538B;&#x6D4B;&#x4ED6;&#x4EBA;&#x7F51;&#x7AD9;&#x7684;&#xFF0C;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x5168;&#x5BB6;&#x6876;&#x62C9;&#x9ED1;&#x3001;&#x5C4F;&#x853D;&#x6389;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x90A3;&#x5BF9;&#x4E8E;&#x73B0;&#x5728;&#x4F01;&#x4E1A;&#x6765;&#x8BF4;&#xFF0C;&#x5404;&#x4EBA;&#x89C9;&#x5F97;&#x6700;&#x5927;&#x7684;&#x4EF7;&#x503C;&#x5C31;&#x662F;&#x63A2;&#x6D4B;&#x8D44;&#x6E90;&#x6027;&#x80FD;&#x3001;&#x8D44;&#x6E90;&#x5BB9;&#x91CF;&#x5408;&#x7406;&#x89C4;&#x5212;&#x3001;&#x589E;&#x5F3A;&#x4E1A;&#x52A1;&#x7A33;&#x5B9A;SLA&#x3001;&#x51CF;&#x5C11;&#x4E8B;&#x6545;&#x53D1;&#x751F;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BF9;&#x4E8E;&#x6D4B;&#x8BD5;&#x8FD8;&#x662F;&#x8FD0;&#x7EF4;&#x6765;&#x8BF4;&#x90FD;&#x662F;&#x5929;&#x5927;&#x7684;&#x597D;&#x4E8B;&#xFF0C;&#x4E5F;&#x662F;&#x4EF7;&#x503C;&#x7684;&#x4F53;&#x73B0;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x672A;&#x6765;&#xFF1A;&#x538B;&#x6D4B;&#x7684;&#x666E;&#x9002;&#x6027;&#xFF0C;&#x5BF9;&#x4F01;&#x4E1A;&#x5E26;&#x6765;&#x7684;&#x4EF7;&#x503C;&#x4E0D;&#x6B62;&#x63A2;&#x6D4B;&#x8D44;&#x6E90;&#x6027;&#x80FD;&#x3001;&#x8D44;&#x6E90;&#x5BB9;&#x91CF;&#x5408;&#x7406;&#x89C4;&#x5212;&#xFF0C;&#x8FD8;&#x6709;&#x6280;&#x672F;&#x67B6;&#x6784;&#x5347;&#x7EA7;&#x9A8C;&#x8BC1;&#x3001;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x4E0A;&#x7EBF;&#x6D4B;&#x8BD5;&#x3001;&#x4E1A;&#x52A1;&#x5CF0;&#x503C;&#x7A33;&#x5B9A;&#x6027;&#x6D4B;&#x8BD5;&#x7B49;&#x7B49;&#xFF0C;&#x901A;&#x8FC7;&#x538B;&#x6D4B;&#x6E05;&#x695A;&#x8D44;&#x6E90;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x964D;&#x4F4E;&#x76F2;&#x76EE;&#x9884;&#x4F30;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x63D0;&#x9AD8;&#x670D;&#x52A1;&#x7684;&#x53EF;&#x7528;&#x6027;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x3002;</p>
</blockquote>
<p><strong>&#x6240;&#x4EE5;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x505A;&#x538B;&#x6D4B;&#xFF1F;</strong><br>&#x538B;&#x6D4B;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x538B;&#x6D4B;(&#x6A21;&#x62DF;&#x771F;&#x5B9E;&#x7528;&#x6237;&#x7684;&#x884C;&#x4E3A;)&#xFF0C;&#x6D4B;&#x7B97;&#x51FA;&#x673A;&#x5668;&#x7684;&#x6027;&#x80FD;(&#x5355;&#x53F0;&#x673A;&#x5668;&#x7684;QPS)&#xFF0C;&#x4ECE;&#x800C;&#x63A8;&#x7B97;&#x51FA;&#x7CFB;&#x7EDF;&#x5728;&#x627F;&#x53D7;&#x6307;&#x5B9A;&#x7528;&#x6237;&#x6570;(100W)&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x5C11;&#x673A;&#x5668;&#x80FD;&#x652F;&#x6491;&#x5F97;&#x4F4F;&#x538B;&#x6D4B;&#x662F;&#x5728;&#x4E0A;&#x7EBF;&#x524D;&#x4E3A;&#x4E86;&#x5E94;&#x5BF9;&#x672A;&#x6765;&#x53EF;&#x80FD;&#x8FBE;&#x5230;&#x7684;&#x7528;&#x6237;&#x6570;&#x91CF;&#x7684;&#x4E00;&#x6B21;&#x9884;&#x4F30;(&#x63D0;&#x524D;&#x6F14;&#x7EC3;)&#xFF0C;&#x538B;&#x6D4B;&#x4EE5;&#x540E;&#x901A;&#x8FC7;&#x4F18;&#x5316;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x6216;&#x51C6;&#x5907;&#x5145;&#x8DB3;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x6765;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x7684;&#x4F53;&#x9A8C;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x538B;&#x6D4B;&#x5DE5;&#x5177;"><a href="#&#x4E8C;&#x3001;&#x538B;&#x6D4B;&#x5DE5;&#x5177;" class="headerlink" title="&#x4E8C;&#x3001;&#x538B;&#x6D4B;&#x5DE5;&#x5177;"></a>&#x4E8C;&#x3001;&#x538B;&#x6D4B;&#x5DE5;&#x5177;</h2><ol>
<li>&#x5DE5;&#x5177;&#x8BF4;&#x660E;</li>
</ol>
<p>AB&#xFF1A;ApacheBench &#x662F; Apache&#x670D;&#x52A1;&#x5668;&#x81EA;&#x5E26;&#x7684;&#x4E00;&#x4E2A;web&#x538B;&#x529B;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x7B80;&#x79F0;ab&#x3002;ab&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x5BF9;&#x53D1;&#x8D77;&#x8D1F;&#x8F7D;&#x7684;&#x672C;&#x673A;&#x8981;&#x6C42;&#x5F88;&#x4F4E;&#xFF0C;&#x6839;&#x636E;ab&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x5F88;&#x591A;&#x7684;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x7EBF;&#x7A0B;&#xFF0C;&#x6A21;&#x62DF;&#x591A;&#x4E2A;&#x8BBF;&#x95EE;&#x8005;&#x540C;&#x65F6;&#x5BF9;&#x67D0;&#x4E00;URL&#x5730;&#x5740;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6D4B;&#x8BD5;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8D1F;&#x8F7D;&#x538B;&#x529B;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;ab&#x5DE5;&#x5177;&#x5C0F;&#x5DE7;&#x7B80;&#x5355;&#x3001;&#x975E;&#x5E38;&#x8F7B;&#x91CF;&#x5316;&#x7684;&#x538B;&#x6D4B;&#x5DE5;&#x5177;&#xFF0C;&#x4E0A;&#x624B;&#x5B66;&#x4E60;&#x8F83;&#x5FEB;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x9700;&#x8981;&#x7684;&#x57FA;&#x672C;&#x6027;&#x80FD;&#x6307;&#x6807;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x56FE;&#x5F62;&#x5316;&#x7ED3;&#x679C;&#xFF0C;&#x4E0D;&#x80FD;&#x76D1;&#x63A7;&#x3002;</p>
<p>Jmeter&#xFF1A;Apache JMeter&#x662F;Apache&#x7EC4;&#x7EC7;&#x5F00;&#x53D1;&#x7684;&#x57FA;&#x4E8E;Java&#x7684;&#x538B;&#x529B;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#x3002;&#x7528;&#x4E8E;&#x5BF9;&#x8F6F;&#x4EF6;&#x505A;&#x538B;&#x529B;&#x6D4B;&#x8BD5;&#xFF0C;&#x5B83;&#x6700;&#x521D;&#x88AB;&#x8BBE;&#x8BA1;&#x7528;&#x4E8E;Web&#x5E94;&#x7528;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F46;&#x540E;&#x6765;&#x6269;&#x5C55;&#x5230;&#x5176;&#x4ED6;&#x6D4B;&#x8BD5;&#x9886;&#x57DF;&#x3002;JMeter&#x80FD;&#x591F;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x505A;&#x529F;&#x80FD;/&#x56DE;&#x5F52;&#x6D4B;&#x8BD5;&#xFF0C;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x5E26;&#x6709;&#x65AD;&#x8A00;&#x7684;&#x811A;&#x672C;&#x6765;&#x9A8C;&#x8BC1;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x8FD4;&#x56DE;&#x4E86;&#x4F60;&#x671F;&#x671B;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>LoadRunner&#xFF1A;LR&#x662F;HP&#x63A8;&#x51FA;&#x7684;&#x4E00;&#x79CD;&#x9884;&#x6D4B;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x548C;&#x6027;&#x80FD;&#x7684;&#x8D1F;&#x8F7D;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x901A;&#x8FC7;&#x4EE5;&#x6A21;&#x62DF;&#x4E0A;&#x5343;&#x4E07;&#x7528;&#x6237;&#x5B9E;&#x65BD;&#x5E76;&#x53D1;&#x8D1F;&#x8F7D;&#x53CA;&#x5B9E;&#x65F6;&#x6027;&#x80FD;&#x76D1;&#x6D4B;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x786E;&#x8BA4;&#x548C;&#x67E5;&#x627E;&#x95EE;&#x9898;&#xFF0C;&#x5206;&#x4E3A;Windows &#x7248;&#x672C;&#x548C;Unix &#x7248;&#x672C;&#x3002;LoadRunner&#x80FD;&#x591F;&#x5BF9;&#x6574;&#x4E2A;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x4F01;&#x4E1A;&#x4E5F;&#x80FD;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x7F29;&#x77ED;&#x6D4B;&#x8BD5;&#x65F6;&#x95F4;&#xFF0C;&#x4F18;&#x5316;&#x6027;&#x80FD;&#x548C;&#x52A0;&#x901F;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x5E03;&#x5468;&#x671F;&#x3002;&#x4E5F;&#x80FD;&#x9884;&#x6D4B;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x5E76;&#x4F18;&#x5316;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x3002;&#x5546;&#x4E1A;&#x7248;&#x652F;&#x6301;&#x5F55;&#x5C4F;+&#x811A;&#x672C;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x963F;&#x91CC;&#x4E91;PTS&#xFF1A;PTS&#xFF08;Performance Testing Service&#xFF09;&#x662F;&#x9762;&#x5411;&#x6240;&#x6709;&#x6280;&#x672F;&#x80CC;&#x666F;&#x4EBA;&#x5458;&#x7684;&#x4E91;&#x5316;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#x3002;&#x6709;&#x522B;&#x4E8E;&#x4F20;&#x7EDF;&#x5DE5;&#x5177;&#x7684;&#x7E41;&#x590D;&#xFF0C;PTS&#x4EE5;&#x4E92;&#x8054;&#x7F51;&#x5316;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x63D0;&#x4F9B;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x3001;API&#x8C03;&#x8BD5;&#x548C;&#x76D1;&#x6D4B;&#x7B49;&#x591A;&#x79CD;&#x80FD;&#x529B;&#x3002;&#x81EA;&#x7814;&#x548C;&#x9002;&#x914D;&#x5F00;&#x6E90;&#x7684;&#x529F;&#x80FD;&#x90FD;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x6A21;&#x62DF;&#x4EFB;&#x610F;&#x4F53;&#x91CF;&#x7684;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x4E1A;&#x52A1;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x4EFB;&#x52A1;&#x968F;&#x65F6;&#x53D1;&#x8D77;&#xFF0C;&#x514D;&#x53BB;&#x7E41;&#x7410;&#x7684;&#x642D;&#x5EFA;&#x548C;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x3002;&#x66F4;&#x662F;&#x7D27;&#x5BC6;&#x7ED3;&#x5408;&#x76D1;&#x63A7;&#x3001;&#x6D41;&#x63A7;&#x7B49;&#x5144;&#x5F1F;&#x4EA7;&#x54C1;&#x63D0;&#x4F9B;&#x4E00;&#x7AD9;&#x5F0F;&#x9AD8;&#x53EF;&#x7528;&#x80FD;&#x529B;&#xFF0C;&#x9AD8;&#x6548;&#x68C0;&#x9A8C;&#x548C;&#x7BA1;&#x7406;&#x4E1A;&#x52A1;&#x6027;&#x80FD;&#x3002;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x9ED1;&#x5BA2;&#x5BF9;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5168;&#x9762;&#x6DF1;&#x5165;&#x7684;&#x5B89;&#x5168;&#x6D4B;&#x8BD5;&#xFF0C;</p>
<ol start="2">
<li>&#x5E38;&#x7528;&#x5DE5;&#x5177;&#x5BF9;&#x6BD4;</li>
</ol>
<table>
<thead>
<tr>
<th>&#x5BF9;&#x6BD4;&#x9879;\&#x538B;&#x6D4B;&#x5DE5;&#x5177;</th>
<th>Apache Bench&#xFF08;ab&#xFF09;</th>
<th>JMeter</th>
<th>LoadRunner</th>
<th>PTS</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x5B66;&#x4E60;&#x6210;&#x672C;</td>
<td>&#x4F4E;</td>
<td>&#x9AD8;</td>
<td>&#x9AD8;</td>
<td>&#x4F4E;</td>
</tr>
<tr>
<td>&#x5B89;&#x88C5;&#x90E8;&#x7F72;&#x6210;&#x672C;</td>
<td>&#x4F4E;</td>
<td>&#x9AD8;</td>
<td>&#x9AD8;</td>
<td>&#x4F4E;</td>
</tr>
<tr>
<td>&#x8D39;&#x7528;</td>
<td>&#x65E0;</td>
<td>&#x65E0;</td>
<td>&#x6709;</td>
<td>&#x6709;</td>
</tr>
<tr>
<td>&#x591A;&#x534F;&#x8BAE;</td>
<td>&#x5426;</td>
<td>&#x662F;</td>
<td>&#x662F;</td>
<td>&#x662F;</td>
</tr>
<tr>
<td>&#x56FE;&#x5F62;&#x5316;&#x5C55;&#x793A;</td>
<td>&#x5426;</td>
<td>&#x662F;</td>
<td>&#x662F;</td>
<td>&#x662F;</td>
</tr>
<tr>
<td>TPS&#x6A21;&#x5F0F;</td>
<td>&#x5426;</td>
<td>&#x5426;</td>
<td>&#x5426;</td>
<td>&#x662F;</td>
</tr>
<tr>
<td>&#x538B;&#x6D4B;&#x94FE;&#x8DEF;&#x3001;&#x573A;&#x666F;&#x7F16;&#x6392;&#x7BA1;&#x7406;</td>
<td>&#x5426;</td>
<td>&#x662F;</td>
<td>&#x662F;</td>
<td>&#x662F;</td>
</tr>
<tr>
<td>&#x573A;&#x666F;&#x5F55;&#x5236;</td>
<td>&#x5426;</td>
<td>&#x662F;</td>
<td>&#x662F;</td>
<td>&#x662F;</td>
</tr>
<tr>
<td>&#x751F;&#x6001;&#x73AF;&#x5883;&#x5F3A;&#x5F31;</td>
<td>&#x5F31;</td>
<td>&#x5F31;</td>
<td>&#x5F31;</td>
<td>&#x5F3A;</td>
</tr>
<tr>
<td>&#x76D1;&#x63A7;&#x6307;&#x6807;&#x662F;&#x5426;&#x5B8C;&#x5907;</td>
<td>&#x5426;</td>
<td>&#x5426;</td>
<td>&#x5426;</td>
<td>&#x662F;</td>
</tr>
<tr>
<td>&#x6D41;&#x91CF;&#x5730;&#x57DF;&#x5B9A;&#x5236;</td>
<td>&#x5426;</td>
<td>&#x5426;</td>
<td>&#x5426;</td>
<td>&#x662F;</td>
</tr>
</tbody>
</table>
<ol start="3">
<li>&#x538B;&#x6D4B;&#x6807;&#x51C6;</li>
</ol>
<table>
<thead>
<tr>
<th>&#x538B;&#x6D4B;&#x7C7B;&#x578B;</th>
<th>&#x89E3;&#x91CA;&#x8BF4;&#x660E;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x538B;&#x529B;&#x6D4B;&#x8BD5;(Stress Testing)</td>
<td>&#x4E5F;&#x79F0;&#x4E4B;&#x4E3A;&#x5F3A;&#x5EA6;&#x6D4B;&#x8BD5;&#xFF0C;&#x6D4B;&#x8BD5;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x6700;&#x5927;&#x6297;&#x538B;&#x80FD;&#x529B;&#xFF0C;&#x5728;&#x5F3A;&#x8D1F;&#x8F7D;(&#x5927;&#x6570;&#x636E;&#x3001;&#x9AD8;&#x5E76;&#x53D1;)&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;&#x6240;&#x80FD;&#x627F;&#x53D7;&#x7684;&#x6700;&#x5927;&#x538B;&#x529B;&#xFF0C;&#x9884;&#x4F30;&#x7CFB;&#x7EDF;&#x7684;&#x74F6;&#x9888;</td>
</tr>
<tr>
<td>&#x5E76;&#x53D1;&#x6D4B;&#x8BD5;(Concurrency Testing)</td>
<td>&#x901A;&#x8FC7;&#x6A21;&#x62DF;&#x5F88;&#x591A;&#x7528;&#x6237;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x8BBF;&#x95EE;&#x7CFB;&#x7EDF;&#x6216;&#x5BF9;&#x7CFB;&#x7EDF;&#x67D0;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x6765;&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x4ECE;&#x4E2D;&#x53D1;&#x73B0;&#x95EE;&#x9898;(&#x5E76;&#x53D1;&#x8BFB;&#x5199;&#x3001;&#x7EBF;&#x7A0B;&#x63A7;&#x5236;&#x3001;&#x8D44;&#x6E90;&#x4E89;&#x62A2;)</td>
</tr>
<tr>
<td>&#x8010;&#x4E45;&#x6027;&#x6D4B;&#x8BD5;(Configuration Testing)</td>
<td>&#x901A;&#x8FC7;&#x5BF9;&#x7CFB;&#x7EDF;&#x5728;&#x5927;&#x8D1F;&#x8377;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#xFF0C;&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;&#x3001;&#x673A;&#x5668;&#x7684;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x4E0B;&#x7684;&#x72B6;&#x51B5;,&#x4ECE;&#x4E2D;&#x53D1;&#x73B0;&#x95EE;&#x9898;(&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x3001;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x6C60;&#x4E0D;&#x91CA;&#x653E;&#x3001;&#x8D44;&#x6E90;&#x4E0D;&#x56DE;&#x6536;)</td>
</tr>
</tbody>
</table>
<p>&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x6307;&#x6807;</p>
<p>3.1 &#x4EA4;&#x6613;&#x54CD;&#x5E94;&#x65F6;&#x95F4;  </p>
<blockquote>
<p>&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x6307;&#x7528;&#x6237;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x8D77;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x5F00;&#x59CB;&#xFF0C;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x63A5;&#x6536;&#x5230;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x7ED3;&#x675F;&#xFF0C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x6240;&#x8017;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5728;&#x6027;&#x80FD;&#x68C0;&#x6D4B;&#x4E2D;&#x4E00;&#x822C;&#x4EE5;&#x538B;&#x529B;&#x53D1;&#x8D77;&#x7AEF;&#x81F3;&#x88AB;&#x538B;&#x6D4B;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x5904;&#x7406;&#x7ED3;&#x679C;&#x7684;&#x65F6;&#x95F4;&#x4E3A;&#x8BA1;&#x91CF;&#xFF0C;&#x5355;&#x4F4D;&#x4E00;&#x822C;&#x4E3A;&#x79D2;&#x6216;&#x6BEB;&#x79D2;&#x3002;&#x5E73;&#x5747;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x6307;&#x7CFB;&#x7EDF;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#xFF0C;&#x540C;&#x4E00;&#x4EA4;&#x6613;&#x7684;&#x5E73;&#x5747;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x4EA4;&#x6613;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x5747;&#x6307;&#x5E73;&#x5747;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3002; &#x5E73;&#x5747;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x6307;&#x6807;&#x503C;&#x5E94;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x4EA4;&#x6613;&#x5206;&#x522B;&#x8BBE;&#x5B9A;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5206;&#x4E3A;&#x590D;&#x6742;&#x4EA4;&#x6613;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3001;&#x7B80;&#x5355;&#x4EA4;&#x6613;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3001;&#x7279;&#x6B8A;&#x4EA4;&#x6613;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x7279;&#x6B8A;&#x4EA4;&#x6613;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x7684;&#x8BBE;&#x5B9A;&#x5FC5;&#x987B;&#x660E;&#x786E;&#x8BE5;&#x4EA4;&#x6613;&#x5728;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x65B9;&#x9762;&#x7684;&#x7279;&#x6B8A;&#x6027;&#x3002;</p>
</blockquote>
<p>Response Time: &#x7B80;&#x79F0;RT</p>
<blockquote>
<p>&#x4E0D;&#x540C;&#x884C;&#x4E1A;&#x4E0D;&#x540C;&#x4E1A;&#x52A1;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#xFF0C;&#x5BF9;&#x4E8E;&#x5728;&#x7EBF;&#x5B9E;&#x65F6;&#x4EA4;&#x6613;&#xFF1A;<br>&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#xFF1A;500&#x6BEB;&#x79D2;&#x4EE5;&#x4E0B;&#xFF0C;&#x4F8B;&#x5982;&#x6DD8;&#x5B9D;&#x4E1A;&#x52A1;10&#x6BEB;&#x79D2;&#x5DE6;&#x53F3;&#x3002;<br>&#x91D1;&#x878D;&#x4F01;&#x4E1A;&#xFF1A;1&#x79D2;&#x4EE5;&#x4E0B;&#x4E3A;&#x4F73;&#xFF0C;&#x90E8;&#x5206;&#x590D;&#x6742;&#x4E1A;&#x52A1;3&#x79D2;&#x4EE5;&#x4E0B;&#x3002;<br>&#x4FDD;&#x9669;&#x4F01;&#x4E1A;&#xFF1A;3&#x79D2;&#x4EE5;&#x4E0B;&#x4E3A;&#x4F73;&#x3002;<br>&#x5236;&#x9020;&#x4E1A;&#xFF1A;5&#x79D2;&#x4EE5;&#x4E0B;&#x4E3A;&#x4F73;&#x3002;</p>
</blockquote>
<p>&#x5BF9;&#x4E8E;&#x6279;&#x91CF;&#x4EA4;&#x6613;&#xFF1A;</p>
<blockquote>
<p>&#x65F6;&#x95F4;&#x7A97;&#x53E3;&#xFF1A;&#x5373;&#x6574;&#x4E2A;&#x538B;&#x6D4B;&#x8FC7;&#x7A0B;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x91CF;&#x5219;&#x65F6;&#x95F4;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4F8B;&#x5982;&#x53CC;11&#x548C;99&#x5927;&#x4FC3;&#xFF0C;&#x6570;&#x636E;&#x91CF;&#x7EA7;&#x4E0D;&#x4E00;&#x6837;&#x5219;&#x65F6;&#x95F4;&#x7A97;&#x53E3;&#x4E0D;&#x540C;&#x3002;&#x5927;&#x6570;&#x636E;&#x91CF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;2&#x5C0F;&#x65F6;&#x5185;&#x53EF;&#x5B8C;&#x6210;&#x538B;&#x6D4B;&#x3002;</p>
</blockquote>
<p>3.2 &#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;</p>
<blockquote>
<p>&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x662F;&#x6307;&#x7CFB;&#x7EDF;&#x5728;&#x5229;&#x7528;&#x7CFB;&#x7EDF;&#x786C;&#x4EF6;&#x5E73;&#x53F0;&#x548C;&#x8F6F;&#x4EF6;&#x5E73;&#x53F0;&#x8FDB;&#x884C;&#x4FE1;&#x606F;&#x5904;&#x7406;&#x7684;&#x80FD;&#x529B;&#x3002; &#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x6BCF;&#x79D2;&#x949F;&#x80FD;&#x591F;&#x5904;&#x7406;&#x7684;&#x4EA4;&#x6613;&#x6570;&#x91CF;&#x6765;&#x8BC4;&#x4EF7;&#xFF0C;&#x4EA4;&#x6613;&#x6709;&#x4E24;&#x79CD;&#x7406;&#x89E3;&#xFF1A;&#x4E00;&#x662F;&#x4E1A;&#x52A1;&#x4EBA;&#x5458;&#x89D2;&#x5EA6;&#x7684;&#x4E00;&#x7B14;&#x4E1A;&#x52A1;&#x8FC7;&#x7A0B;&#xFF1B;&#x4E8C;&#x662F;&#x7CFB;&#x7EDF;&#x89D2;&#x5EA6;&#x7684;&#x4E00;&#x6B21;&#x4EA4;&#x6613;&#x7533;&#x8BF7;&#x548C;&#x54CD;&#x5E94;&#x8FC7;&#x7A0B;&#x3002;&#x524D;&#x8005;&#x79F0;&#x4E3A;&#x4E1A;&#x52A1;&#x4EA4;&#x6613;&#x8FC7;&#x7A0B;&#xFF0C;&#x540E;&#x8005;&#x79F0;&#x4E3A;&#x4E8B;&#x52A1;&#x3002;&#x4E24;&#x79CD;&#x4EA4;&#x6613;&#x6307;&#x6807;&#x90FD;&#x53EF;&#x4EE5;&#x8BC4;&#x4EF7;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x5904;&#x7406;&#x80FD;&#x529B;&#x3002;&#x4E00;&#x822C;&#x7684;&#x5EFA;&#x8BAE;&#x4E0E;&#x7CFB;&#x7EDF;&#x4EA4;&#x6613;&#x65E5;&#x5FD7;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x7EDF;&#x8BA1;&#x4E1A;&#x52A1;&#x91CF;&#x6216;&#x8005;&#x4EA4;&#x6613;&#x91CF;&#x3002;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x6307;&#x6807;&#x662F;&#x6280;&#x672F;&#x6D4B;&#x8BD5;&#x6D3B;&#x52A8;&#x4E2D;&#x91CD;&#x8981;&#x6307;&#x6807;&#x3002;</p>
</blockquote>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7528;&#x4EE5;&#x4E0B;&#x6307;&#x6807;&#x6765;&#x5EA6;&#x91CF;&#xFF1A;</p>
<blockquote>
<p>HPS&#xFF08;Hits Per Second&#xFF09; &#xFF1A;&#x6BCF;&#x79D2;&#x70B9;&#x51FB;&#x6B21;&#x6570;&#xFF0C;&#x5355;&#x4F4D;&#x662F;&#x6B21;/&#x79D2;&#x3002;<br>TPS&#xFF08;Transaction per Second&#xFF09;&#xFF1A;&#x7CFB;&#x7EDF;&#x6BCF;&#x79D2;&#x5904;&#x7406;&#x4EA4;&#x6613;&#x6570;&#xFF0C;&#x5355;&#x4F4D;&#x662F;&#x7B14;/&#x79D2;&#x3002;<br>QPS&#xFF08;Query per Second&#xFF09;&#xFF1A;&#x7CFB;&#x7EDF;&#x6BCF;&#x79D2;&#x5904;&#x7406;&#x67E5;&#x8BE2;&#x6B21;&#x6570;&#xFF0C;&#x5355;&#x4F4D;&#x662F;&#x6B21;/&#x79D2;&#x3002; &#x5BF9;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x4E1A;&#x52A1;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E9B;&#x4E1A;&#x52A1;&#x6709;&#x4E14;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x8FDE;&#x63A5;&#xFF0C;&#x90A3;&#x4E48;TPS=QPS=HPS&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x7528;TPS&#x6765;&#x8861;&#x91CF;&#x6574;&#x4E2A;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#xFF0C;&#x7528;QPS&#x6765;&#x8861;&#x91CF;&#x63A5;&#x53E3;&#x67E5;&#x8BE2;&#x6B21;&#x6570;&#xFF0C;&#x7528;HPS&#x6765;&#x8868;&#x793A;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x5355;&#x51FB;&#x8BF7;&#x6C42;&#x3002;  </p>
</blockquote>
<p>&#x6807;&#x51C6;</p>
<blockquote>
<p>&#x65E0;&#x8BBA;TPS&#x3001;QPS&#x3001;HPS&#xFF0C;&#x6B64;&#x6307;&#x6807;&#x662F;&#x8861;&#x91CF;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x8D8A;&#x5927;&#x8D8A;&#x597D;&#xFF0C;&#x6839;&#x636E;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF1A;<br>&#x91D1;&#x878D;&#x884C;&#x4E1A;&#xFF1A;1000 TPS&#x3002;<br>&#x4FDD;&#x9669;&#x884C;&#x4E1A;&#xFF1A;100000 TPS&#xFF0C;&#x4E0D;&#x5305;&#x62EC;&#x4E92;&#x8054;&#x7F51;&#x5316;&#x7684;&#x6D3B;&#x52A8;&#x3002;<br>&#x5236;&#x9020;&#x884C;&#x4E1A;&#xFF1A;10 TPS&#x3002;<br>&#x4E92;&#x8054;&#x7F51;&#x7535;&#x5B50;&#x5546;&#x52A1;&#xFF1A;1000000 TPS&#x3002;<br>&#x4E92;&#x8054;&#x7F51;&#x4E2D;&#x578B;&#x7F51;&#x7AD9;&#xFF1A;1000 TPS&#x3002;<br>&#x4E92;&#x8054;&#x7F51;&#x5C0F;&#x578B;&#x7F51;&#x7AD9;&#xFF1A;10000 TPS&#x3002;    </p>
</blockquote>
<p>3.3 &#x5E76;&#x53D1;&#x7528;&#x6237;</p>
<blockquote>
<p>&#x5E76;&#x53D1;&#x7528;&#x6237;&#x6570;&#x6307;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x5185;&#xFF0C;&#x767B;&#x5F55;&#x7CFB;&#x7EDF;&#x5E76;&#x8FDB;&#x884C;&#x4E1A;&#x52A1;&#x64CD;&#x4F5C;&#x7684;&#x7528;&#x6237;&#x6570;&#x91CF;&#x3002; &#x5E76;&#x53D1;&#x7528;&#x6237;&#x6570;&#x5BF9;&#x4E8E;&#x957F;&#x8FDE;&#x63A5;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x6700;&#x5927;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x6570;&#x5373;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x5E76;&#x53D1;&#x63A5;&#x5165;&#x80FD;&#x529B;&#x3002;&#x5BF9;&#x4E8E;&#x77ED;&#x8FDE;&#x63A5;&#x7CFB;&#x7EDF;&#x800C;&#x8A00;&#x6700;&#x5927;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x6570;&#x5E76;&#x4E0D;&#x7B49;&#x4E8E;&#x7CFB;&#x7EDF;&#x7684;&#x5E76;&#x53D1;&#x63A5;&#x5165;&#x80FD;&#x529B;&#xFF0C;&#x800C;&#x662F;&#x4E0E;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x3001;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x7B49;&#x5404;&#x79CD;&#x60C5;&#x51B5;&#x76F8;&#x5173;&#x3002;&#x4F8B;&#x5982;&#x7CFB;&#x7EDF;&#x541E;&#x5410;&#x80FD;&#x529B;&#x5F88;&#x5F3A;&#xFF0C;&#x52A0;&#x4E0A;&#x77ED;&#x8FDE;&#x63A5;&#x4E00;&#x822C;&#x90FD;&#x6709;&#x8FDE;&#x63A5;&#x590D;&#x7528;&#xFF0C;&#x5F80;&#x5F80;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x6570;&#x5927;&#x4E8E;&#x7CFB;&#x7EDF;&#x7684;&#x5E76;&#x53D1;&#x63A5;&#x5165;&#x8FDE;&#x63A5;&#x6570;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x5927;&#x90E8;&#x5206;&#x77ED;&#x8FDE;&#x63A5;&#x7C7B;&#x578B;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x541E;&#x5410;&#x91CF;&#x6A21;&#x5F0F;&#xFF08;RPS&#x6A21;&#x5F0F;&#xFF0C;Request Per Second&#xFF09;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#xFF0C;&#x4E5F;&#x662F;&#x963F;&#x91CC;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;PTS&#x652F;&#x6301;RPS&#x6A21;&#x5F0F;&#x7684;&#x538B;&#x6D4B;&#xFF0C;&#x541E;&#x5410;&#x91CF;&#x7684;&#x538B;&#x6D4B;&#x6784;&#x5EFA;&#x548C;&#x8861;&#x91CF;&#x4E00;&#x6B65;&#x5230;&#x4F4D;&#x3002; &#x5728;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x91C7;&#x7528;&#x865A;&#x62DF;&#x7528;&#x6237;&#x6765;&#x6A21;&#x62DF;&#x73B0;&#x5B9E;&#x4E2D;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x4E1A;&#x52A1;&#x64CD;&#x4F5C;&#x3002;</p>
</blockquote>
<p>Virtual User&#xFF1A;&#x7B80;&#x79F0;VU</p>
<p>&#x6807;&#x51C6;</p>
<blockquote>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x662F;&#x5C06;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x5BB9;&#x91CF;&#x6D4B;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6D4B;&#x8BD5;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x6570;&#xFF0C;&#x9664;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x957F;&#x8FDE;&#x63A5;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x6570;&#x5916;&#xFF0C;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x4E0D;&#x53D7;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x6570;&#x5F71;&#x54CD;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6700;&#x5C0F;&#x7684;&#x7528;&#x6237;&#x6570;&#x5C06;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x5BB9;&#x91CF;&#x6D4B;&#x8BD5;&#x51FA;&#x6765;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x66F4;&#x591A;&#x7684;&#x7528;&#x6237;&#x5C06;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x80FD;&#x529B;&#x5BB9;&#x91CF;&#x6D4B;&#x8BD5;&#x51FA;&#x6765;&#x3002;</p>
</blockquote>
<p>3.4 &#x9519;&#x8BEF;&#x7387;<br>&#x5B9A;&#x4E49;&#x53CA;&#x89E3;&#x91CA;</p>
<blockquote>
<p>&#x539F;&#x6587;<a href="https://www.leoheng.com/2021/06/25/%E5%B8%B8%E7%94%A8%E6%80%A7%E8%83%BD%E5%8E%8B%E6%B5%8B%E5%B7%A5%E5%85%B7%E5%AE%9E%E6%88%98%E6%80%BB%E7%BB%93/" target="_blank" rel="noopener">https://www.leoheng.com/2021/06/25/%E5%B8%B8%E7%94%A8%E6%80%A7%E8%83%BD%E5%8E%8B%E6%B5%8B%E5%B7%A5%E5%85%B7%E5%AE%9E%E6%88%98%E6%80%BB%E7%BB%93/</a></p>
</blockquote>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    
        <div>
            <a href="/posts/d185f6ae/" class="post-more waves-button">
                阅读全文 »
            </a>
        </div>
    </div>
    
</article>

        </li>
    
        <li class="post-list-item fade">
            <article id="post-Linux常用性能分析工具" class="article-card article-type-post" itemprop="blogPost">

    


  
    <h3 class="post-title" itemprop="name">
      <a href="/posts/d53cba09/">Linux常用性能分析工具</a>
    </h3>
  




     <div class="post-meta">
        <time class="post-time" title="2022-06-07 12:54:45" datetime="2022-06-07T04:54:45.000Z" itemprop="datePublished">2022-06-07</time>

    </div>

    <div class="post-content" id="post-content" itemprop="postContent">

    
        <script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    
        <div>
            <a href="/posts/d53cba09/" class="post-more waves-button">
                阅读全文 »
            </a>
        </div>
    </div>
    
</article>

        </li>
    
        <li class="post-list-item fade">
            <article id="post-Linux性能管理工具" class="article-card article-type-post" itemprop="blogPost">

    


  
    <h3 class="post-title" itemprop="name">
      <a href="/posts/480c215d/">Linux性能管理工具</a>
    </h3>
  




     <div class="post-meta">
        <time class="post-time" title="2022-06-07 12:54:32" datetime="2022-06-07T04:54:32.000Z" itemprop="datePublished">2022-06-07</time>

    </div>

    <div class="post-content" id="post-content" itemprop="postContent">

    
        <h2 id="&#x6027;&#x80FD;&#x6D4B;&#x8BD5;"><a href="#&#x6027;&#x80FD;&#x6D4B;&#x8BD5;" class="headerlink" title="&#x6027;&#x80FD;&#x6D4B;&#x8BD5;"></a>&#x6027;&#x80FD;&#x6D4B;&#x8BD5;</h2><h3 id="perf"><a href="#perf" class="headerlink" title="perf"></a>perf</h3><h4 id="&#x5E38;&#x7528;&#x7684;perf&#x547D;&#x4EE4;"><a href="#&#x5E38;&#x7528;&#x7684;perf&#x547D;&#x4EE4;" class="headerlink" title="&#x5E38;&#x7528;&#x7684;perf&#x547D;&#x4EE4;"></a>&#x5E38;&#x7528;&#x7684;perf&#x547D;&#x4EE4;</h4><ul>
<li>perf stat<br>  &#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x63D0;&#x4F9B;&#x5E38;&#x89C1;&#x7684;&#x6027;&#x80FD;&#x4E8B;&#x4EF6;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x8BF4;&#x660E;&#x6267;&#x884C;&#x548C;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x949F;&#x5468;&#x671F;&#x3002;</li>
<li>perf record<br>  &#x8BE5;&#x547D;&#x4EE4;&#x80FD;&#x591F;&#x5C06;&#x6570;&#x636E;&#x8BB0;&#x5F55;&#x5E76;&#x751F;&#x6210;&#x4E00;&#x4E2A;perf.data&#x6587;&#x4EF6;</li>
<li>perf report<br>  &#x8BE5;&#x547D;&#x4EE4;&#x4ECE;perf record&#x751F;&#x6210;&#x7684;perf.data&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6;&#x5E76;&#x663E;&#x793A;&#x4E8B;&#x4EF6;&#x6570;&#x636E;&#x3002;</li>
<li>perf list<br>  &#x5217;&#x51FA;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x53EF;&#x7528;&#x4E8B;&#x4EF6;</li>
<li><p>perf top<br>  &#x8BE5;&#x547D;&#x4EE4;&#x4E0E;<code>top</code>&#x547D;&#x4EE4;&#x7C7B;&#x4F3C;&#xFF0C;&#x5B9E;&#x65F6;&#x663E;&#x793A;&#x6027;&#x80FD;&#x4E8B;&#x4EF6;<br>  <img src="http://192.168.85.188:8081/uploads/165292411776693751202205072153614.png" alt=""></p>
</li>
<li><p>perf  trace<br>  &#x8BE5;&#x547D;&#x4EE4;&#x4E0E;<code>strace</code>&#x547D;&#x4EE4;&#x7C7B;&#x4F3C;&#xFF0C;&#x76D1;&#x89C6;&#x6307;&#x5B9A;&#x7EBF;&#x7A0B;&#x6216;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x4EE5;&#x53CA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x53F7;&#x3002;</p>
</li>
<li>perf help</li>
</ul>
<figure class="highlight bash"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">perf list   <span class="comment"># &#x67E5;&#x770B;&#x5F53;&#x524D;&#x652F;&#x6301;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x4EF6;</span></span><br><span class="line"><span class="comment"># [Software event]&#x8F6F;&#x4EF6;&#x4E8B;&#x4EF6;</span></span><br><span class="line"><span class="comment"># [Tool event]</span></span><br><span class="line"><span class="comment"># [Hardware cache event]  &#x786C;&#x4EF6;&#x7F13;&#x5B58;&#x4E8B;&#x4EF6;</span></span><br><span class="line"><span class="comment"># [Kernel PMU event] PMU&#x4E8B;&#x4EF6;</span></span><br><span class="line"><span class="comment"># [Hardware event]</span></span><br><span class="line"><span class="comment"># Tracepoint event</span></span><br><span class="line"><span class="comment">#</span></span><br></pre></td></tr></tbody></table></figure>
<h2 id="&#x6027;&#x80FD;&#x4F18;&#x5316;"><a href="#&#x6027;&#x80FD;&#x4F18;&#x5316;" class="headerlink" title="&#x6027;&#x80FD;&#x4F18;&#x5316;"></a>&#x6027;&#x80FD;&#x4F18;&#x5316;</h2><script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    
        <div>
            <a href="/posts/480c215d/" class="post-more waves-button">
                阅读全文 »
            </a>
        </div>
    </div>
    
</article>

        </li>
    
        <li class="post-list-item fade">
            <article id="post-性能测试指标详解" class="article-card article-type-post" itemprop="blogPost">

    


  
    <h3 class="post-title" itemprop="name">
      <a href="/posts/fa35a60d/">性能测试指标详解</a>
    </h3>
  




     <div class="post-meta">
        <time class="post-time" title="2022-06-07 12:54:19" datetime="2022-06-07T04:54:19.000Z" itemprop="datePublished">2022-06-07</time>

    </div>

    <div class="post-content" id="post-content" itemprop="postContent">

    
        <h1 id="&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x2014;&#x2014;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x5404;&#x6307;&#x6807;&#x8BF4;&#x660E;"><a href="#&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x2014;&#x2014;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x5404;&#x6307;&#x6807;&#x8BF4;&#x660E;" class="headerlink" title="&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x2014;&#x2014;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x5404;&#x6307;&#x6807;&#x8BF4;&#x660E;"></a>&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x2014;&#x2014;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x5404;&#x6307;&#x6807;&#x8BF4;&#x660E;</h1><p>&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x6307;&#x6807;&#x662F;&#x8861;&#x91CF;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x7684;&#x8BC4;&#x4EF7;&#x6807;&#x51C6;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x6307;&#x6807;&#x5305;&#x62EC;&#xFF1A;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3001;&#x5E76;&#x53D1;&#x3001;&#x70B9;&#x51FB;&#x7387;&#x3001;&#x541E;&#x5410;&#x91CF;&#x3001;TPS/QPS&#x3001;PV/UV&#xFF1B;Linux&#x670D;&#x52A1;&#x5668;&#x5E38;&#x7528;&#x7684;&#x6027;&#x80FD;&#x6307;&#x6807;&#x5305;&#x62EC;&#xFF1A;CPU&#x4F7F;&#x7528;&#x7387;&#x3001;&#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;&#x3001;&#x78C1;&#x76D8;IO&#x3001;&#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x7B49;&#x3002;</p>
<h2 id="&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x6307;&#x6807;"><a href="#&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x6307;&#x6807;" class="headerlink" title="&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x6307;&#x6807;"></a>&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x6307;&#x6807;</h2><h3 id="1-1-&#x54CD;&#x5E94;&#x65F6;&#x95F4;"><a href="#1-1-&#x54CD;&#x5E94;&#x65F6;&#x95F4;" class="headerlink" title="1.1 &#x54CD;&#x5E94;&#x65F6;&#x95F4;"></a>1.1 &#x54CD;&#x5E94;&#x65F6;&#x95F4;</h3><p>&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x662F;&#x6307;&#x67D0;&#x4E2A;&#x8BF7;&#x6C42;&#x6216;&#x64CD;&#x4F5C;&#x53D1;&#x51FA;&#x5230;&#x63A5;&#x6536;&#x5230;&#x53CD;&#x9988;&#x6240;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5305;&#x62EC;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#xFF08;&#x5BA2;&#x6237;&#x7AEF;&#xFF09;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x3001;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x65F6;&#x95F4;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x3002;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x4ECE;&#x70B9;&#x51FB;/&#x8F93;&#x5165;&#x5230;&#x5B8C;&#x5168;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x95F4;&#xFF1B;&#x5B8C;&#x6210;&#x4E00;&#x6B21;&#x589E;&#x52A0;&#x3001;&#x5220;&#x9664;&#x3001;&#x4FEE;&#x6539;&#x6216;&#x8005;&#x67E5;&#x8BE2;&#x52A8;&#x4F5C;&#x7684;&#x4E8B;&#x52A1;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x7B49;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x4F20;&#x8F93;&#x5F80;&#x5F80;&#x8981;&#x7ECF;&#x5386;&#x591A;&#x4E2A;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x624D;&#x80FD;&#x5230;&#x8FBE;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8BF7;&#x6C42;&#x7ECF;&#x5386;&#x4E86;&#x4E09;&#x4E2A;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x7684;&#x4F20;&#x8F93;&#x65F6;&#x95F4;B1&#x3001;B2&#x3001;B3&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x4E3A;A&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4E3A;C&#x3002;&#x5219;&#x4E00;&#x6B21;&#x8BF7;&#x6C42;&#x7684;&#x5B8C;&#x6574;&#x8DEF;&#x5F84;&#x53EF;&#x4EE5;&#x63CF;&#x8FF0;&#x4E3A;&#x4E0B;&#x56FE;&#xFF1A;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="http://192.168.84.188:8081/uploads/16529237626752468130515.png" alt="" title="">
                </div>
                <div class="image-caption"></div>
            </figure>
<p>&#x5BA2;&#x6237;&#x7AEF;&#x4ECE;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#x5230;&#x63A5;&#x6536;&#x5230;&#x670D;&#x52A1;&#x5668;&#x53CD;&#x9988;&#x7684;&#x5B8C;&#x6574;&#x94FE;&#x8DEF;&#x65F6;&#x95F4;&#x4E3A;A&#x2014;&gt;B1&#x2014;&gt;B2&#x2014;&gt;B3&#x2014;&gt;C&#xFF08;&#x8282;&#x70B9;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x90FD;&#x5305;&#x62EC;&#x63A5;&#x6536;&#x548C;&#x53D1;&#x9001;&#x4E24;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF09;&#x3002;&#x5219;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4E3A;&#xFF1A;</p>
<p>&#x54CD;&#x5E94;&#x65F6;&#x95F4;=A+B1+B2+B3+C</p>
<h3 id="1-2-&#x5E76;&#x53D1;"><a href="#1-2-&#x5E76;&#x53D1;" class="headerlink" title="1.2 &#x5E76;&#x53D1;"></a>1.2 &#x5E76;&#x53D1;</h3><p>&#x5E76;&#x53D1;&#x662F;&#x6307;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x671F;&#x5185;&#x8FDB;&#x884C;&#x76F8;&#x540C;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x6216;&#x64CD;&#x4F5C;&#x3002;&#x7531;&#x4E8E;&#x7528;&#x6237;&#x5728;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x6D41;&#x7A0B;&#x65F6;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#xFF08;&#x5373;&#x7528;&#x6237;&#x601D;&#x8003;&#x65F6;&#x95F4;&#xFF09;&#x6216;&#x8005;&#x670D;&#x52A1;&#x5668;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x6709;&#x5148;&#x540E;&#x987A;&#x5E8F;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x5C31;&#x4EA7;&#x751F;&#x4E86;&#x7EDD;&#x5BF9;&#x5E76;&#x53D1;&#x548C;&#x76F8;&#x5BF9;&#x5E76;&#x53D1;&#x6982;&#x5FF5;&#x7684;&#x533A;&#x5206;&#x3002;</p>
<p>&#x7EDD;&#x5BF9;&#x5E76;&#x53D1;&#x662F;&#x6307;&#x540C;&#x4E00;&#x65F6;&#x523B;&#xFF08;&#x5373;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x70B9;&#xFF09;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x540C;&#x65F6;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x76F8;&#x5BF9;&#x5E76;&#x53D1;&#x662F;&#x6307;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF08;&#x5373;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x533A;&#x95F4;&#xFF09;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x5E76;&#x53D1;&#x91CF;&#x4E3A;10000&#x4EBA;&#xFF08;&#x53EF;&#x540C;&#x65F6;&#x5BB9;&#x7EB3;10000&#x4EBA;&#xFF09;&#x7684;&#x52A8;&#x7269;&#x56ED;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x5E76;&#x53D1;&#x91CF;&#x662F;&#x6307;&#x7EDD;&#x5BF9;&#x5E76;&#x53D1;&#x8FD8;&#x662F;&#x76F8;&#x5BF9;&#x5E76;&#x53D1;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E76;&#x53D1;&#x6307;&#x7684;&#x662F;&#x76F8;&#x5BF9;&#x5E76;&#x53D1;&#xFF0C;&#x56E0;&#x4E3A;&#x6574;&#x4E2A;&#x52A8;&#x7269;&#x56ED;&#x662F;&#x4E00;&#x4E2A;&#x4EA4;&#x7EC7;&#x7684;&#x7F51;&#x72B6;&#x7ED3;&#x6784;&#xFF0C;&#x51FA;&#x5165;&#x53E3;&#x3001;&#x8001;&#x864E;&#x3001;&#x72EE;&#x5B50;&#x3001;&#x5927;&#x8C61;&#x7B49;&#x5404;&#x4E2A;&#x52A8;&#x7269;&#x7AD9;&#x70B9;&#x90FD;&#x6709;&#x5206;&#x6D41;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x57FA;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x51FA;&#x5165;&#x53E3;&#x6216;&#x8005;&#x7AD9;&#x70B9;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x627F;&#x8F7D;10000&#x4EBA;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x51FA;&#x5165;&#x53E3;&#x7684;&#x5E76;&#x53D1;&#x53EF;&#x80FD;&#x53EA;&#x6709;200&#x4EBA;&#x3002;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x52A8;&#x7269;&#x56ED;&#x7684;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x5E76;&#x53D1;&#x91CF;10000&#x662F;&#x6307;&#x5404;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x603B;&#x548C;&#xFF0C;&#x53C2;&#x89C2;&#x8005;&#x53C2;&#x89C2;&#x52A8;&#x7269;&#x56ED;&#x6709;&#x8DEF;&#x5F84;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#xFF0C;&#x662F;&#x76F8;&#x5BF9;&#x5E76;&#x53D1;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x800C;&#x51FA;&#x5165;&#x53E3;&#x7684;&#x5E76;&#x53D1;&#x91CF;&#x662F;200&#x4EBA;&#xFF0C;&#x5219;&#x662F;&#x6307;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x5728;&#x51FA;&#x5165;&#x53E3;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x5BB9;&#x7EB3;200&#x4EBA;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7EDD;&#x5BF9;&#x5E76;&#x53D1;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x7CFB;&#x7EDF;&#x6216;&#x8005;&#x6A21;&#x5757;&#x7684;&#x5E76;&#x53D1;&#x66F4;&#x591A;&#x662F;&#x6307;&#x76F8;&#x5BF9;&#x5E76;&#x53D1;&#xFF0C;&#x800C;&#x63A5;&#x53E3;&#x7684;&#x5E76;&#x53D1;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x7EDD;&#x5BF9;&#x5E76;&#x53D1;&#x3002;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#x7684;&#x6982;&#x5FF5;&#x662F;&#x6307;&#x7CFB;&#x7EDF;&#x3001;&#x6A21;&#x5757;&#x6216;&#x63A5;&#x53E3;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#xFF0C;&#x4E0D;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x6240;&#x80FD;&#x591F;&#x627F;&#x8F7D;&#x7684;&#x5E76;&#x53D1;&#x91CF;&#x3002;</p>
<p>&#x5728;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x4E2D;&#x5E38;&#x7528;&#x5230;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x6570;&#x548C;&#x5E76;&#x53D1;&#x8BF7;&#x6C42;&#x6570;&#x4E24;&#x4E2A;&#x6307;&#x6807;&#x3002;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x6570;&#x662F;&#x6307;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#xFF08;&#x70B9;&#x6216;&#x533A;&#x95F4;&#xFF09;&#xFF0C;&#x7CFB;&#x7EDF;&#x3001;&#x6A21;&#x5757;&#x6216;&#x63A5;&#x53E3;&#x80FD;&#x591F;&#x627F;&#x8F7D;&#x7684;&#x7528;&#x6237;&#x6570;&#x91CF;&#xFF1B;&#x5E76;&#x53D1;&#x8BF7;&#x6C42;&#x6570;&#x662F;&#x6307;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#xFF08;&#x70B9;&#x6216;&#x533A;&#x95F4;&#xFF09;&#xFF0C;&#x7CFB;&#x7EDF;&#x3001;&#x6A21;&#x5757;&#x6216;&#x63A5;&#x53E3;&#x80FD;&#x591F;&#x627F;&#x8F7D;&#x7684;&#x8BF7;&#x6C42;&#x6570;&#x91CF;&#x3002;</p>
<h3 id="1-3-&#x70B9;&#x51FB;&#x91CF;-&#x70B9;&#x51FB;&#x7387;"><a href="#1-3-&#x70B9;&#x51FB;&#x91CF;-&#x70B9;&#x51FB;&#x7387;" class="headerlink" title="1.3 &#x70B9;&#x51FB;&#x91CF;/&#x70B9;&#x51FB;&#x7387;"></a>1.3 &#x70B9;&#x51FB;&#x91CF;/&#x70B9;&#x51FB;&#x7387;</h3><p>&#x70B9;&#x51FB;&#x91CF;&#x662F;&#x8861;&#x91CF;&#x7F51;&#x7AD9;&#x6D41;&#x91CF;&#x7684;&#x4E00;&#x4E2A;&#x6307;&#x6807;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x70B9;&#x51FB;&#x6570;clicks&#xFF0C;&#x662F;&#x5BF9;&#x7F51;&#x7AD9;&#x70B9;&#x51FB;&#x6570;&#x636E;&#x7684;&#x7EDF;&#x8BA1;&#x3002;</p>
<p>&#x70B9;&#x51FB;&#x7387;&#xFF08;Clicks Ratio&#xFF09;&#x4E5F;&#x53EF;&#x4EE5;&#x53EB;&#x505A;&#x70B9;&#x8FDB;&#x7387;&#xFF08;&#x201C;Click-through Rate&#xFF09;&#xFF0C;&#x5B83;&#x662F;&#x7F51;&#x7AD9;&#x4E0A;&#x67D0;&#x4E00;&#x5185;&#x5BB9;&#x88AB;&#x70B9;&#x51FB;&#x7684;&#x6B21;&#x6570;&#x4E0E;&#x6574;&#x4E2A;&#x7F51;&#x7AD9;&#x5185;&#x5BB9;&#x88AB;&#x663E;&#x793A;&#x6B21;&#x6570;&#x4E4B;&#x6BD4;&#xFF0C;&#x5373;clicks/views&#x3002;&#x53CD;&#x5E94;&#x4E86;&#x7F51;&#x7AD9;&#x4E0A;&#x67D0;&#x4E00;&#x9875;&#x9762;&#x6216;&#x5185;&#x5BB9;&#x7684;&#x53D7;&#x5173;&#x6CE8;&#x7A0B;&#x5EA6;&#xFF0C;&#x7ECF;&#x5E38;&#x7528;&#x6765;&#x8861;&#x91CF;&#x5E7F;&#x544A;&#x7684;&#x5438;&#x5F15;&#x7A0B;&#x5EA6;&#x3002;&#x6BD4;&#x5982;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x88AB;&#x6D4F;&#x89C8;&#x4E86;10w&#x6B21;&#xFF0C;&#x6587;&#x7AE0;&#x4E2D;&#x7684;&#x5E7F;&#x544A;&#x94FE;&#x63A5;&#x88AB;&#x70B9;&#x51FB;&#x4E86;2000&#x6B21;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x6761;&#x5E7F;&#x544A;&#x7684;&#x70B9;&#x51FB;&#x7387;&#x662F;2%&#xFF08;2000/100000*100%&#xFF09;&#x3002;</p>
<p>&#x5728;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x9886;&#x57DF;&#xFF0C;&#x70B9;&#x51FB;&#x7387;&#xFF08;hit rate&#xFF09;&#x5E38;&#x6307;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#xFF08;&#x6BCF;&#x79D2;&#x949F;&#xFF09;&#x9875;&#x9762;&#x7684;&#x70B9;&#x51FB;&#x6570;&#xFF0C;&#x5373;&#x6BCF;&#x79D2;&#x949F;&#x53D1;&#x9001;&#x7684;http&#x8BF7;&#x6C42;&#x6570;&#x91CF;&#xFF0C;&#x70B9;&#x51FB;&#x7387;&#x8D8A;&#x5927;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x9020;&#x6210;&#x7684;&#x538B;&#x529B;&#x4E5F;&#x8D8A;&#x5927;&#xFF0C;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6027;&#x80FD;&#x8981;&#x6C42;&#x4E5F;&#x8D8A;&#x9AD8;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x4EBA;&#x5BB9;&#x6613;&#x6DF7;&#x6DC6;&#x70B9;&#x51FB;&#x7387;&#x548C;&#x70B9;&#x51FB;&#x91CF;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F1A;&#x542C;&#x5230;&#x6709;&#x4EBA;&#x8BF4;&#x67D0;&#x7F51;&#x7AD9;&#x7684;&#x70B9;&#x51FB;&#x7387;&#x662F;&#x591A;&#x591A;&#x4E07;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x91CC;&#x7684;&#x70B9;&#x51FB;&#x7387;&#x6307;&#x7684;&#x662F;&#x70B9;&#x51FB;&#x91CF;&#xFF0C;&#x66DD;&#x5149;&#x7387;&#x6216;&#x8005;&#x8BF4;&#x9875;&#x9762;&#x6D4F;&#x89C8;&#x91CF;&#x3002;</p>
<h3 id="1-4-&#x541E;&#x5410;&#x91CF;-&#x541E;&#x5410;&#x7387;"><a href="#1-4-&#x541E;&#x5410;&#x91CF;-&#x541E;&#x5410;&#x7387;" class="headerlink" title="1.4 &#x541E;&#x5410;&#x91CF;/&#x541E;&#x5410;&#x7387;"></a>1.4 &#x541E;&#x5410;&#x91CF;/&#x541E;&#x5410;&#x7387;</h3><p>&#x541E;&#x5410;&#x91CF;&#x662F;&#x6307;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x5BA2;&#x6237;&#x8BF7;&#x6C42;&#x6570;&#x91CF;&#x7684;&#x603B;&#x548C;&#xFF0C;&#x53EF;&#x4EE5;&#x6307;&#x7F51;&#x7EDC;&#x4E0A;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x5305;&#x7684;&#x603B;&#x548C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6307;&#x4E1A;&#x52A1;&#x4E2D;&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x4EA4;&#x4E92;&#x6570;&#x636E;&#x91CF;&#x7684;&#x603B;&#x548C;&#x3002;</p>
<p>&#x541E;&#x5410;&#x7387;&#x662F;&#x6307;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x5BA2;&#x6237;&#x8BF7;&#x6C42;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;&#x53EF;&#x4EE5;&#x4ECE;&#x591A;&#x4E2A;&#x7EF4;&#x5EA6;&#x8861;&#x91CF;&#x541E;&#x5410;&#x7387;&#xFF1A;&#x2460;&#x4E1A;&#x52A1;&#x89D2;&#x5EA6;&#xFF1A;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#xFF08;&#x6BCF;&#x79D2;&#xFF09;&#x7684;&#x8BF7;&#x6C42;&#x6570;&#x6216;&#x9875;&#x9762;&#x6570;&#xFF0C;&#x5373;&#x8BF7;&#x6C42;&#x6570;/&#x79D2;&#x6216;&#x9875;&#x9762;&#x6570;/&#x79D2;&#xFF1B;&#x2461;&#x7F51;&#x7EDC;&#x89D2;&#x5EA6;&#xFF1A;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#xFF08;&#x6BCF;&#x79D2;&#xFF09;&#x7F51;&#x7EDC;&#x4E2D;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x5305;&#x5927;&#x5C0F;&#xFF0C;&#x5373;&#x5B57;&#x8282;&#x6570;/&#x79D2;&#x7B49;&#xFF1B;&#x2462;&#x7CFB;&#x7EDF;&#x89D2;&#x5EA6;&#xFF0C;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x670D;&#x52A1;&#x5668;&#x6240;&#x627F;&#x53D7;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x5373;&#x7CFB;&#x7EDF;&#x7684;&#x8D1F;&#x8F7D;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x541E;&#x5410;&#x7387;&#xFF08;&#x6216;&#x541E;&#x5410;&#x91CF;&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x591A;&#x7EF4;&#x5EA6;&#x91CF;&#x7684;&#x6027;&#x80FD;&#x6307;&#x6807;&#xFF0C;&#x5B83;&#x4E0E;&#x8BF7;&#x6C42;&#x5904;&#x7406;&#x6240;&#x6D88;&#x8017;&#x7684;CPU&#x3001;&#x5185;&#x5B58;&#x3001;IO&#x548C;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x90FD;&#x5F3A;&#x76F8;&#x5173;&#x3002;</p>
<h3 id="1-5-TPS-QPS"><a href="#1-5-TPS-QPS" class="headerlink" title="1.5 TPS/QPS"></a>1.5 TPS/QPS</h3><p>TPS&#xFF08;Transaction Per Second&#xFF09;&#x662F;&#x6307;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#xFF08;&#x6BCF;&#x79D2;&#xFF09;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x7684;&#x4E8B;&#x52A1;&#x91CF;&#x3002;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x662F;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x6216;&#x8005;&#x52A8;&#x4F5C;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x6BD4;&#x5982;&#x201C;&#x7528;&#x6237;&#x6CE8;&#x518C;&#x201C;&#x4E8B;&#x52A1;&#x662F;&#x70B9;&#x51FB;&#x6CE8;&#x518C;&#x6309;&#x94AE;&#xFF0C;&#x586B;&#x5199;&#x7528;&#x6237;&#x6CE8;&#x518C;&#x4FE1;&#x606F;&#xFF0C;&#x70B9;&#x51FB;&#x63D0;&#x4EA4;&#x6309;&#x94AE;&#xFF0C;&#x4EE5;&#x53CA;&#x52A0;&#x8F7D;&#x6CE8;&#x518C;&#x6210;&#x529F;&#x9875;&#x9762;&#x7684;&#x52A8;&#x4F5C;&#x96C6;&#x5408;&#x3002;</p>
<p>QPS&#xFF08;Query Per Second&#xFF09;&#x662F;&#x6307;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x67E5;&#x8BE2;&#x6216;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6B21;&#x6570;&#x3002;</p>
<p>TPS&#x548C;QPS&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x591A;&#x6B21;&#x67E5;&#x8BE2;&#x6216;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x53EA;&#x67E5;&#x8BE2;&#x6216;&#x8BBF;&#x95EE;&#x4E00;&#x6B21;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5F53;&#x591A;&#x6B21;&#x67E5;&#x8BE2;&#x6216;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;TPS&#x76F8;&#x5F53;&#x4E8E;&#x591A;&#x4E2A;QPS&#xFF1B;&#x5F53;&#x53EA;&#x67E5;&#x8BE2;&#x6216;&#x8BBF;&#x95EE;&#x4E00;&#x6B21;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;TPS&#x5219;&#x7B49;&#x4EF7;&#x4E8E;&#x4E00;&#x4E2A;QPS&#x3002;</p>
<h3 id="1-6-PV-UV"><a href="#1-6-PV-UV" class="headerlink" title="1.6 PV/UV"></a>1.6 PV/UV</h3><p>PV&#x548C;UV&#x662F;&#x8861;&#x91CF;web&#x7F51;&#x7AD9;&#x6027;&#x80FD;&#x5BB9;&#x91CF;&#x7684;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x5EA6;&#x91CF;&#x6307;&#x6807;&#xFF0C;&#x7ECF;&#x5E38;&#x7528;&#x5728;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7F51;&#x7AD9;&#x9886;&#x57DF;&#x4E2D;&#x7528;&#x6765;&#x8861;&#x91CF;&#x7F51;&#x7AD9;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x3002;</p>
<p>PV&#xFF08;Page View&#xFF09;&#x662F;&#x9875;&#x9762;&#x7684;&#x6D4F;&#x89C8;&#x91CF;&#x6216;&#x70B9;&#x51FB;&#x91CF;&#xFF0C;&#x7528;&#x6237;&#x5BF9;&#x7CFB;&#x7EDF;&#x6216;&#x8005;&#x7F51;&#x7AD9;&#x4EFB;&#x4F55;&#x9875;&#x9762;&#x7684;&#x6BCF;&#x4E00;&#x6B21;&#x70B9;&#x51FB;&#x6216;&#x8005;&#x8BBF;&#x95EE;&#x90FD;&#x4F1A;&#x88AB;&#x8BB0;&#x5F55;&#x4E00;&#x6B21;&#x6D4F;&#x89C8;&#x91CF;&#x6216;&#x70B9;&#x51FB;&#x91CF;&#xFF0C;&#x5BF9;&#x76F8;&#x540C;&#x9875;&#x9762;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x8BBF;&#x95EE;&#x6D4F;&#x89C8;&#x91CF;&#x6216;&#x70B9;&#x51FB;&#x91CF;&#x4E5F;&#x4F1A;&#x8FDB;&#x884C;&#x7D2F;&#x8BA1;&#x3002;</p>
<p>UV&#xFF08;Unique Vistor&#xFF09;&#x662F;&#x7CFB;&#x7EDF;&#x6216;&#x8005;&#x7F51;&#x7AD9;&#x7684;&#x72EC;&#x7ACB;&#x8BBF;&#x5BA2;&#xFF0C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x76F8;&#x540C;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x6216;PC&#xFF09;&#x8BBF;&#x95EE;&#x7CFB;&#x7EDF;&#x6216;&#x8005;&#x7F51;&#x7AD9;&#x53EA;&#x4F1A;&#x88AB;&#x8BB0;&#x5F55;&#x4E00;&#x6B21;&#xFF0C;&#x8FDE;&#x7EED;&#x91CD;&#x590D;&#x8BBF;&#x95EE;&#x6216;&#x8005;&#x6D4F;&#x89C8;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x9875;&#x9762;&#x6B21;&#x6570;&#x4E0D;&#x4F1A;&#x8FDB;&#x884C;&#x7D2F;&#x8BA1;&#x3002;</p>
<p>PV&#x548C;UV&#x6309;&#x7167;&#x7EDF;&#x8BA1;&#x5468;&#x671F;&#x5212;&#x5206;&#xFF0C;&#x53EF;&#x4EE5;&#x5212;&#x5206;&#x4E3A;&#x5168;&#x5929;PV&#x3001;&#x6BCF;&#x5C0F;&#x65F6;PV&#x3001;&#x5168;&#x5929;UV&#x548C;&#x6BCF;&#x5C0F;&#x65F6;UV&#x7B49;&#x3002;&#x5728;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x6216;&#x4EA4;&#x6613;&#x91CF;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x53CC;11&#x6216;618&#x7B49;&#x5168;&#x6C11;&#x8D2D;&#x7269;&#x6D3B;&#x52A8;&#x65F6;&#xFF0C;&#x5E38;&#x5E38;&#x8FD8;&#x4F1A;&#x7EDF;&#x8BA1;&#x5CF0;&#x503C;PV&#x548C;&#x5CF0;&#x503C;UV&#x3002;</p>
<h2 id="Linux&#x670D;&#x52A1;&#x5668;&#x6027;&#x80FD;&#x6307;&#x6807;"><a href="#Linux&#x670D;&#x52A1;&#x5668;&#x6027;&#x80FD;&#x6307;&#x6807;" class="headerlink" title="Linux&#x670D;&#x52A1;&#x5668;&#x6027;&#x80FD;&#x6307;&#x6807;"></a>Linux&#x670D;&#x52A1;&#x5668;&#x6027;&#x80FD;&#x6307;&#x6807;</h2><h3 id="2-1-CPU&#x4F7F;&#x7528;&#x7387;"><a href="#2-1-CPU&#x4F7F;&#x7528;&#x7387;" class="headerlink" title="2.1 CPU&#x4F7F;&#x7528;&#x7387;"></a>2.1 CPU&#x4F7F;&#x7528;&#x7387;</h3><p>CPU&#x4F7F;&#x7528;&#x7387;&#x662F;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x670D;&#x52A1;&#x5668;CPU&#x7684;&#x4F7F;&#x7528;&#x7EDF;&#x8BA1;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x9664;CPU&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#x5916;&#x5176;&#x4ED6;&#x65F6;&#x95F4;&#x5360;&#x603B;CPU&#x65F6;&#x95F4;&#x7684;&#x767E;&#x5206;&#x6BD4;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x5373;&#xFF1A;CPU&#x4F7F;&#x7528;&#x7387;=1-CPU&#x7A7A;&#x95F2;&#x65F6;&#x95F4;/&#x603B;CPU&#x65F6;&#x95F4;</p>
<figure class="highlight shell"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">top ## top&#x547D;&#x4EE4;&#x95F4;&#x9694;3s&#x4F1A;&#x52A8;&#x6001;&#x6EDA;&#x52A8;&#x66F4;&#x65B0;&#x4E00;&#x6B21;&#x6570;&#x636E;</span><br></pre></td></tr></tbody></table></figure>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="http://192.168.84.188:8081/uploads/1652923805160103382topcmd.png" alt="" title="">
                </div>
                <div class="image-caption"></div>
            </figure>
<p>&#x5B57;&#x6BB5;&#x8BF4;&#x660E;&#xFF1A;</p>
<p>us (user)&#xFF1A;&#x7528;&#x6237;&#x6001;&#x7684;CPU&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#x6BD4;&#x4F8B;&#xFF0C;&#x662F;&#x7528;&#x6237;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x771F;&#x6B63;&#x65F6;&#x95F4;&#xFF0C;&#x5B83;&#x4E0D;&#x5305;&#x62EC;&#x540E;&#x9762;&#x7684;ni&#x65F6;&#x95F4;&#xFF1B;</p>
<p>sy (system): &#x5185;&#x6838;&#x6001;&#x7684;CPU&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#x6BD4;&#x4F8B;&#xFF0C;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x5F80;&#x5F80;&#x5904;&#x4E8E;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#xFF1B;</p>
<p>ni (nice): &#x8868;&#x793A;&#x4F4E;&#x4F18;&#x5148;&#x7EA7;&#x7528;&#x6237;&#x6001;&#x7684;CPU&#x65F6;&#x95F4;&#x6BD4;&#x4F8B;&#xFF0C;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4E3A;[-20,19]&#xFF0C;&#x6570;&#x503C;&#x8D8A;&#x5927;&#xFF0C;&#x5219;&#x4F18;&#x5148;&#x7EA7;&#x8D8A;&#x4F4E;&#xFF1B;</p>
<p>id (idle): &#x8868;&#x793A;&#x7A7A;&#x95F2;&#x7684;CPU&#x65F6;&#x95F4;&#x6BD4;&#x4F8B;&#xFF0C;&#x503C;&#x8D8A;&#x5927;&#xFF0C;CPU&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#x6BD4;&#x4F8B;&#x8D8A;&#x9AD8;&#xFF0C;&#x5229;&#x7528;&#x7387;&#x8D8A;&#x4F4E;&#xFF1B;</p>
<p>wa (iowait): &#x8868;&#x793A;&#x5904;&#x4E8E;IO&#x7B49;&#x5F85;&#x72B6;&#x6001;&#x7684;CPU&#x65F6;&#x95F4;&#x6BD4;&#x4F8B;&#xFF1B;</p>
<p>hi (hard interrupt): &#x8868;&#x793A;&#x5904;&#x7406;&#x786C;&#x4E2D;&#x65AD;&#x7684;CPU&#x65F6;&#x95F4;&#x6BD4;&#x4F8B;&#xFF1B;</p>
<p>si (soft interrupt): &#x4E0E;hi&#x76F8;&#x53CD;&#xFF0C;&#x8868;&#x793A;&#x5904;&#x7406;&#x8F6F;&#x4E2D;&#x65AD;&#x7684;CPU&#x65F6;&#x95F4;&#x6BD4;&#x4F8B;&#xFF1B;</p>
<p>st (steal): &#x8868;&#x793A;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x88AB;&#x5176;&#x4ED6;&#x865A;&#x62DF;&#x673A;&#x5360;&#x7528;&#x7684;CPU&#x65F6;&#x95F4;&#x6BD4;&#x4F8B;&#x3002;</p>
<p>&#x5728;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x7684;CPU&#x4F7F;&#x7528;&#x7387;&#x53EF;&#x4EE5;&#x7528;&#xFF08;1-id&#xFF09;&#x6765;&#x8BA1;&#x7B97;&#x3002;&#x5F53;us&#x5F88;&#x9AD8;&#x65F6;&#xFF0C;&#x8BF4;&#x660E;CPU&#x65F6;&#x95F4;&#x4E3B;&#x8981;&#x6D88;&#x8017;&#x5728;&#x7528;&#x6237;&#x4EE3;&#x7801;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x7528;&#x6237;&#x4EE3;&#x7801;&#x89D2;&#x5EA6;&#x8003;&#x8651;&#x4F18;&#x5316;&#x6027;&#x80FD;&#xFF1B;&#x5F53;sy&#x5F88;&#x9AD8;&#x65F6;&#xFF0C;&#x8BF4;&#x660E;CPU&#x65F6;&#x95F4;&#x4E3B;&#x8981;&#x6D88;&#x8017;&#x5728;&#x5185;&#x6838;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x662F;&#x5426;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x9891;&#x7E41;&#x3001;CPU&#x8FDB;&#x7A0B;&#x6216;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x9891;&#x7E41;&#x89D2;&#x5EA6;&#x8003;&#x8651;&#x6027;&#x80FD;&#x7684;&#x4F18;&#x5316;&#xFF1B;&#x5F53;wa&#x5F88;&#x9AD8;&#x65F6;&#xFF0C;&#x8BF4;&#x660E;&#x6709;&#x8FDB;&#x7A0B;&#x5728;&#x8FDB;&#x884C;&#x9891;&#x7E41;&#x7684;IO&#x64CD;&#x4F5C;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x78C1;&#x76D8;IO&#x6216;&#x8005;&#x7F51;&#x7EDC;IO&#x3002;</p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;%us+%sy&lt;=70%&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x7CFB;&#x7EDF;&#x7684;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x826F;&#x597D;&#x3002;</p>
<h3 id="2-2-&#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;"><a href="#2-2-&#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;" class="headerlink" title="2.2 &#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;"></a>2.2 &#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;</h3><p>Linux&#x7684;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#x9075;&#x5FAA;&#x5185;&#x5B58;&#x5229;&#x7528;&#x7387;&#x6700;&#x5927;&#x5316;&#x7684;&#x539F;&#x5219;&#x3002;&#x5185;&#x6838;&#x4F1A;&#x5C06;&#x7A7A;&#x4F59;&#x7684;&#x5185;&#x5B58;&#x5212;&#x5206;&#x4E3A;cached&#xFF08;&#x4E0D;&#x5C5E;&#x4E8E;free&#xFF09;&#xFF0C;&#x5BF9;&#x4E8E;&#x6709;&#x9891;&#x7E41;&#x8BFB;&#x53D6;&#x64CD;&#x4F5C;&#x7684;&#x6587;&#x4EF6;&#x6216;&#x6570;&#x636E;&#x4F1A;&#x88AB;&#x4FDD;&#x5B58;&#x5728;cached&#x4E2D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x4E8E;linux&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x4E0D;&#x6B62;free&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x5305;&#x62EC;cached&#x7684;&#x5185;&#x5B58;&#xFF08;&#x5176;&#x5B9E;&#x8FD8;&#x5305;&#x62EC;buffers&#x7684;&#x5185;&#x5B58;&#xFF09;&#x3002;</p>
<p>cached&#x548C;buffers&#x90FD;&#x5C5E;&#x4E8E;&#x7F13;&#x5B58;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x533A;&#x522B;&#x4E3B;&#x8981;&#x5728;&#x4E8E;cached&#x4E3B;&#x8981;&#x7528;&#x6765;&#x7F13;&#x51B2;&#x9891;&#x7E41;&#x8BFB;&#x53D6;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BB0;&#x5FC6;&#x6211;&#x4EEC;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#xFF1B;&#x800C;buffers&#x4E3B;&#x8981;&#x7528;&#x6765;&#x7ED9;&#x5757;&#x8BBE;&#x5907;&#x505A;&#x7684;&#x7F13;&#x51B2;&#x5927;&#x5C0F;&#xFF0C;&#x53EA;&#x8BB0;&#x5F55;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;metadata&#x4EE5;&#x53CA;tracking in-flight pages&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x5B58;&#x50A8;&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6743;&#x9650;&#x7B49;&#x3002;</p>
<p>top&#x5DE5;&#x5177;&#x65E2;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x7CFB;&#x7EDF;CPU&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x4FE1;&#x606F;&#x3002;</p>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="http://192.168.84.188:8081/uploads/1652923863850081274topmemory.png" alt="" title="">
                </div>
                <div class="image-caption"></div>
            </figure>
<p>&#x5728;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x7528;&#x5230;&#x7CFB;&#x7EDF;&#x5DF2;&#x7528;&#x5185;&#x5B58;&#x3001;&#x7269;&#x7406;&#x5DF2;&#x7528;&#x5185;&#x5B58;&#x3001;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;&#x4EE5;&#x53CA;&#x7269;&#x7406;&#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;&#x8FD9;&#x51E0;&#x4E2A;&#x6307;&#x6807;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x8BA1;&#x7B97;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x7CFB;&#x7EDF;&#x5DF2;&#x7528;&#x5185;&#x5B58;MemUsed=MemTotal-MemFree           //&#x5305;&#x542B;buffers&#x548C;cached</p>
<p>&#x7269;&#x7406;&#x5DF2;&#x7528;&#x5185;&#x5B58;-/+Used= MemTotal-MemFree-MemBuffers-MemCached</p>
<p>&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;MemUsed%=&#xFF08;MemUsed/ MemTotal&#xFF09;*100%</p>
<p>&#x7269;&#x7406;&#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;-/+Used%=(-/+Used/ MemTotal&#xFF09;*100%</p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;&lt;=70%&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x826F;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x8D85;&#x51FA;&#x5219;&#x8BF4;&#x660E;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x8D44;&#x6E90;&#x7D27;&#x5F20;&#x3002;</p>
<h3 id="2-3-&#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;"><a href="#2-3-&#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;" class="headerlink" title="2.3 &#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;"></a>2.3 &#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;</h3><p>&#x5F53;&#x53D1;&#x73B0;&#x7CFB;&#x7EDF;&#x51FA;&#x73B0;&#x5361;&#x65AD;&#x6216;&#x8005;&#x8FD0;&#x884C;&#x4E0D;&#x987A;&#x7545;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;uptime&#xFF0C;top&#x6216;&#x8005;w&#x547D;&#x4EE4;&#x6765;&#x67E5;&#x770B;&#x7CFB;&#x7EDF;&#x7684;&#x8D1F;&#x8F7D;&#x60C5;&#x51B5;&#x3002;</p>
<pre><code>uptime
</code></pre><p><code>uptime</code>command<br></p><figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="http://192.168.84.188:8081/uploads/1652923897275247246uptime_loadaverage.png" alt="" title="">
                </div>
                <div class="image-caption"></div>
            </figure><p></p>
<p><code>w</code>command<br></p><figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="http://192.168.84.188:8081/uploads/1652923915145507123w_loadaverage.png" alt="" title="">
                </div>
                <div class="image-caption"></div>
            </figure><p></p>
<p><code>top</code>command<br></p><figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="http://192.168.84.188:8081/uploads/1652923943410185712top_loadaverage.png" alt="" title="">
                </div>
                <div class="image-caption"></div>
            </figure><p></p>
<p>Linux&#x7684;load average&#x8868;&#x793A;&#x7CFB;&#x7EDF;&#x8D1F;&#x8F7D;&#x7684;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x663E;&#x793A;&#x7684;&#x4E09;&#x4E2A;&#x6570;&#x503C;&#x5206;&#x522B;&#x8868;&#x793A;1&#x5206;&#x949F;&#x3001;5&#x5206;&#x949F;&#x548C;15&#x5206;&#x949F;&#x5185;&#x7684;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x662F;&#x6307;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x7CFB;&#x7EDF;&#x5904;&#x4E8E;&#x53EF;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x548C;&#x4E0D;&#x53EF;&#x4E2D;&#x65AD;&#x72B6;&#x6001;&#x7684;&#x5E73;&#x5747;&#x8FDB;&#x7A0B;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x7406;&#x89E3;&#x4E3A;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x5C31;&#x662F;&#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x6D3B;&#x8DC3;&#x8FDB;&#x7A0B;&#x6570;&#x3002;&#x5176;&#x4E2D;&#x53EF;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x662F;&#x6307;&#x6B63;&#x5728;&#x4F7F;&#x7528;CPU&#x6216;&#x8005;&#x6B63;&#x5728;&#x7B49;&#x5F85;CPU&#x7684;&#x8FDB;&#x7A0B;&#xFF08;&#x5904;&#x4E8E;R&#x72B6;&#x6001;&#xFF1A;Running&#x6216;&#x8005;Runnable&#x7684;&#x8FDB;&#x7A0B;&#xFF09;&#xFF1B;&#x4E0D;&#x53EF;&#x4E2D;&#x65AD;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#x6307;&#x7684;&#x662F;&#x6B63;&#x5904;&#x4E8E;&#x5185;&#x6838;&#x6001;&#x5173;&#x952E;&#x6D41;&#x7A0B;&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x5904;&#x4E8E;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#x7684;&#x8FDB;&#x7A0B;&#x662F;&#x4E0D;&#x53EF;&#x6253;&#x65AD;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x7B49;&#x5F85;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#x7684;I/O&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5F53;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x7684;&#x503C;&#x4E3A;4&#xFF1A;</p>
<p>&#x5BF9;&#x4E8E;&#x53EA;&#x6709;1&#x4E2A;CPU&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5E73;&#x5747;&#x6709;3&#x4E2A;&#x8FDB;&#x7A0B;&#x7ADE;&#x4E89;&#x4E0D;&#x5230;CPU&#xFF1B;</p>
<p>&#x5BF9;&#x4E8E;&#x62E5;&#x6709;4&#x4E2A;CPU&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x610F;&#x5473;&#x7740;CPU&#x5229;&#x7528;&#x7387;&#x4E3A;100%&#xFF1B;</p>
<p>&#x5BF9;&#x4E8E;&#x62E5;&#x6709;8&#x4E2A;CPU&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x610F;&#x5473;&#x7740;CPU&#x5229;&#x7528;&#x7387;&#x4E3A;50%&#xFF0C;&#x6709;&#x4E00;&#x534A;&#x7A7A;&#x95F2;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5F53;&#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x7684;&#x503C;&#x5982;&#x679C;&#x8D85;&#x8FC7;&#x7CFB;&#x7EDF;CPU&#x7684;&#x6570;&#x91CF;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x6027;&#x80FD;&#x74F6;&#x9888;&#xFF0C;&#x8981;&#x89C6;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x800C;&#x5B9A;&#x3002;</p>
<p>&#x5728;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x7ECF;&#x5E38;&#x4F1A;&#x901A;&#x8FC7;&#x6BD4;&#x8F83;1min&#x3001;5min&#x6216;&#x8005;15min&#x7684;&#x503C;&#xFF0C;&#x6765;&#x5224;&#x65AD;&#x7CFB;&#x7EDF;&#x5E73;&#x5747;&#x8D1F;&#x8F7D;&#x7684;&#x53D8;&#x5316;&#x60C5;&#x51B5;&#xFF1A;</p>
<p>&#x5982;&#x679C;1min&#x7684;&#x503C;&#x5927;&#x4E8E;5min&#x6216;&#x8005;15min&#x7684;&#x503C;&#xFF0C;&#x8BF4;&#x660E;&#x8D1F;&#x8F7D;&#x5728;&#x589E;&#x52A0;&#xFF1B;</p>
<p>&#x5982;&#x679C;1min&#x7684;&#x503C;&#x5C0F;&#x4E8E;5min&#x6216;&#x8005;15min&#x7684;&#x503C;&#xFF0C;&#x8BF4;&#x660E;&#x8D1F;&#x8F7D;&#x5728;&#x51CF;&#x5C0F;&#xFF1B;</p>
<h3 id="2-4-&#x78C1;&#x76D8;I-O"><a href="#2-4-&#x78C1;&#x76D8;I-O" class="headerlink" title="2.4 &#x78C1;&#x76D8;I/O"></a>2.4 &#x78C1;&#x76D8;I/O</h3><p>Linux&#x670D;&#x52A1;&#x5668;&#x6027;&#x80FD;&#x9664;&#x4E86;CPU&#x548C;&#x5185;&#x5B58;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x78C1;&#x76D8;IO&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x6027;&#x80FD;&#x6307;&#x6807;&#x3002;</p>
<figure class="highlight shell"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="meta">#</span><span class="bash"> RHEL/CentOS</span></span><br><span class="line"><span class="meta">#</span><span class="bash"> yum install sysstat</span></span><br><span class="line"></span><br><span class="line">iostat -x -k 2 3   # &#x6BCF;&#x9694;2S&#x8F93;&#x51FA;&#x78C1;&#x76D8;IO&#x7684;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x5171;&#x91C7;&#x6837;3&#x6B21;</span><br></pre></td></tr></tbody></table></figure>
<figure class="image-bubble">
                <div class="img-lightbox">
                    <div class="overlay"></div>
                    <img src="http://192.168.84.188:8081/uploads/1652923992503954646iostat.png" alt="" title="">
                </div>
                <div class="image-caption"></div>
            </figure>
<p>&#x5B57;&#x6BB5;&#x8BF4;&#x660E;&#xFF1A;</p>
<p>rrqm/s: &#x6BCF;&#x79D2;&#x5BF9;&#x8BE5;&#x8BBE;&#x5907;&#x7684;&#x8BFB;&#x8BF7;&#x6C42;&#x88AB;&#x5408;&#x5E76;&#x6B21;&#x6570;&#xFF0C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4F1A;&#x5BF9;&#x8BFB;&#x53D6;&#x540C;&#x5757;(block)&#x7684;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF1B;</p>
<p>wrqm/s: &#x6BCF;&#x79D2;&#x5BF9;&#x8BE5;&#x8BBE;&#x5907;&#x7684;&#x5199;&#x8BF7;&#x6C42;&#x88AB;&#x5408;&#x5E76;&#x6B21;&#x6570;&#xFF1B;</p>
<p>r/s: &#x6BCF;&#x79D2;&#x5B8C;&#x6210;&#x7684;&#x8BFB;&#x6B21;&#x6570;&#xFF1B;</p>
<p>w/s: &#x6BCF;&#x79D2;&#x5B8C;&#x6210;&#x7684;&#x5199;&#x6B21;&#x6570;&#xFF1B;</p>
<p>rkB/s: &#x6BCF;&#x79D2;&#x8BFB;&#x6570;&#x636E;&#x91CF;(kB&#x4E3A;&#x5355;&#x4F4D;)&#xFF1B;</p>
<p>wkB/s: &#x6BCF;&#x79D2;&#x5199;&#x6570;&#x636E;&#x91CF;(kB&#x4E3A;&#x5355;&#x4F4D;)&#xFF1B;</p>
<p>avgrq-sz:&#x5E73;&#x5747;&#x6BCF;&#x6B21;IO&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x636E;&#x91CF;(&#x6247;&#x533A;&#x6570;&#x4E3A;&#x5355;&#x4F4D;)&#xFF1B;</p>
<p>avgqu-sz: &#x5E73;&#x5747;&#x7B49;&#x5F85;&#x5904;&#x7406;&#x7684;IO&#x8BF7;&#x6C42;&#x961F;&#x5217;&#x957F;&#x5EA6;&#xFF1B;</p>
<p>await: &#x5E73;&#x5747;&#x6BCF;&#x6B21;IO&#x8BF7;&#x6C42;&#x7B49;&#x5F85;&#x65F6;&#x95F4;(&#x5305;&#x62EC;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#x548C;&#x5904;&#x7406;&#x65F6;&#x95F4;&#xFF0C;&#x6BEB;&#x79D2;&#x4E3A;&#x5355;&#x4F4D;)&#xFF1B;</p>
<p>svctm: &#x5E73;&#x5747;&#x6BCF;&#x6B21;IO&#x8BF7;&#x6C42;&#x7684;&#x5904;&#x7406;&#x65F6;&#x95F4;(&#x6BEB;&#x79D2;&#x4E3A;&#x5355;&#x4F4D;)&#xFF1B;</p>
<p>%util: &#x91C7;&#x7528;&#x5468;&#x671F;&#x5185;&#x7528;&#x4E8E;IO&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x7387;&#xFF0C;&#x5373;IO&#x961F;&#x5217;&#x975E;&#x7A7A;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x7387;&#xFF1B;</p>
<p>&#x5728;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91CD;&#x70B9;&#x5173;&#x6CE8;iowait%&#x548C;%util&#x53C2;&#x6570;&#x3002;&#x5176;&#x4E2D;iowait% &#x8868;&#x793A;CPU&#x7B49;&#x5F85;IO&#x65F6;&#x95F4;&#x5360;&#x6574;&#x4E2A;CPU&#x5468;&#x671F;&#x7684;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x5982;&#x679C;iowait&#x503C;&#x8D85;&#x8FC7;50%&#xFF0C;&#x6216;&#x8005;&#x660E;&#x663E;&#x5927;&#x4E8E;%system&#x3001;%user&#x4EE5;&#x53CA;%idle&#xFF0C;&#x8868;&#x793A;IO&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x4E86;&#xFF1B;%util&#x8868;&#x793A;&#x78C1;&#x76D8;&#x5FD9;&#x788C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x822C;%util&lt;=70%&#x8868;&#x793A;&#x8BE5;&#x78C1;&#x76D8;IO&#x4F7F;&#x7528;&#x72B6;&#x6001;&#x826F;&#x597D;&#x3002;</p>
<h3 id="2-5-Linux&#x5E38;&#x7528;&#x6027;&#x80FD;&#x547D;&#x4EE4;"><a href="#2-5-Linux&#x5E38;&#x7528;&#x6027;&#x80FD;&#x547D;&#x4EE4;" class="headerlink" title="2.5 Linux&#x5E38;&#x7528;&#x6027;&#x80FD;&#x547D;&#x4EE4;"></a>2.5 Linux&#x5E38;&#x7528;&#x6027;&#x80FD;&#x547D;&#x4EE4;</h3><h4 id="2-5-1-CPU"><a href="#2-5-1-CPU" class="headerlink" title="2.5.1 CPU"></a>2.5.1 CPU</h4><pre><code># &#x83B7;&#x53D6;CPU&#x8BE6;&#x60C5;
cat /proc/sys/cpuinfo
</code></pre><figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br></pre></td><td class="code"><pre><span class="line">[root@rhel7 ~]# cat /proc/cpuinfo</span><br><span class="line">processor       : 0</span><br><span class="line">vendor_id       : GenuineIntel</span><br><span class="line">cpu family      : 6</span><br><span class="line">model           : 158</span><br><span class="line">model name      : Intel(R) Core(TM) i5-7400 CPU @ 3.00GHz</span><br><span class="line">stepping        : 9</span><br><span class="line">microcode       : 0xffffffff</span><br><span class="line">cpu MHz         : 2998.708</span><br><span class="line">cache size      : 6144 KB</span><br><span class="line">physical id     : 0</span><br><span class="line">siblings        : 1</span><br><span class="line">core id         : 0</span><br><span class="line">cpu cores       : 1</span><br><span class="line">apicid          : 0</span><br><span class="line">initial apicid  : 0</span><br><span class="line">fpu             : yes</span><br><span class="line">fpu_exception   : yes</span><br><span class="line">cpuid level     : 22</span><br><span class="line">wp              : yes</span><br><span class="line">flags           : fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 ss syscall nx pdpe1gb rdtscp lm constant_tsc arch_perfmon nopl xtopology tsc_reliable nonstop_tsc eagerfpu pni pclmulqdq ssse3 fma cx16 pcid sse4_1 sse4_2 x2apic movbe popcnt tsc_deadline_timer aes xsave avx f16c rdrand hypervisor lahf_lm abm 3dnowprefetch arat fsgsbase tsc_adjust bmi1 avx2 smep bmi2 invpcid rdseed adx smap clflushopt xsaveopt xsavec xgetbv1</span><br><span class="line">bogomips        : 5999.99</span><br><span class="line">clflush size    : 64</span><br><span class="line">cache_alignment : 64</span><br><span class="line">address sizes   : 45 bits physical, 48 bits virtual</span><br><span class="line">power management:</span><br><span class="line"></span><br><span class="line">[root@rhel7 ~]#</span><br></pre></td></tr></tbody></table></figure>
<p><strong>top</strong></p>
<figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br></pre></td><td class="code"><pre><span class="line">top - 05:37:21 up 2 days, 14:06,  2 users,  load average: 0.00, 0.05, 0.07</span><br><span class="line">Tasks: 164 total,   1 running, 163 sleeping,   0 stopped,   0 zombie</span><br><span class="line">%Cpu(s):  0.3 us,  0.7 sy,  0.0 ni, 99.0 id,  0.0 wa,  0.0 hi,  0.0 si,  0.0 st</span><br><span class="line">KiB Mem :   999696 total,   162172 free,   482632 used,   354892 buff/cache</span><br><span class="line">KiB Swap:  2097148 total,  2064164 free,    32984 used.   303396 avail Mem</span><br><span class="line"></span><br><span class="line">   PID USER      PR  NI    VIRT    RES    SHR S %CPU %MEM     TIME+ COMMAND</span><br><span class="line">   759 root      20   0  305248   3152   2824 S  0.3  0.3   5:39.77 vmtoolsd</span><br><span class="line">  1196 mysql     20   0 1131704 193936    564 S  0.3 19.4   1:15.66 mysqld</span><br><span class="line"> 13017 root      20   0 1621100  76124   4316 S  0.3  7.6   1:13.35 mongod</span><br><span class="line">     1 root      20   0  128212   4532   2512 S  0.0  0.5   0:11.69 systemd</span><br><span class="line">     2 root      20   0       0      0      0 S  0.0  0.0   0:00.02 kthreadd</span><br><span class="line">     3 root      20   0       0      0      0 S  0.0  0.0   0:06.71 ksoftirqd/0</span><br><span class="line">     5 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 kworker/0:0H</span><br><span class="line">     7 root      rt   0       0      0      0 S  0.0  0.0   0:00.00 migration/0</span><br><span class="line">     8 root      20   0       0      0      0 S  0.0  0.0   0:00.00 rcu_bh</span><br><span class="line">     9 root      20   0       0      0      0 S  0.0  0.0   0:12.27 rcu_sched</span><br><span class="line">    10 root      rt   0       0      0      0 S  0.0  0.0   0:03.50 watchdog/0</span><br><span class="line">    12 root      20   0       0      0      0 S  0.0  0.0   0:00.00 kdevtmpfs</span><br><span class="line">    13 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 netns</span><br><span class="line">    14 root      20   0       0      0      0 S  0.0  0.0   0:00.13 khungtaskd</span><br><span class="line">    15 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 writeback</span><br><span class="line">    16 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 kintegrityd</span><br><span class="line">    17 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 bioset</span><br><span class="line">    18 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 kblockd</span><br><span class="line">    19 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 md</span><br><span class="line">    25 root      20   0       0      0      0 S  0.0  0.0   0:01.89 kswapd0</span><br><span class="line">    26 root      25   5       0      0      0 S  0.0  0.0   0:00.00 ksmd</span><br><span class="line">    27 root      39  19       0      0      0 S  0.0  0.0   0:01.39 khugepaged</span><br><span class="line">    28 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 crypto</span><br><span class="line">    36 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 kthrotld</span><br><span class="line">    38 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 kmpath_rdacd</span><br><span class="line">    39 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 kpsmoused</span><br><span class="line">    41 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 ipv6_addrconf</span><br><span class="line">    60 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 deferwq</span><br><span class="line">    93 root      20   0       0      0      0 S  0.0  0.0   0:13.32 kauditd</span><br><span class="line">   272 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 ata_sff</span><br><span class="line">   273 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 mpt_poll_0</span><br><span class="line">   274 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 mpt/0</span><br><span class="line">   278 root      20   0       0      0      0 S  0.0  0.0   0:00.00 scsi_eh_0</span><br><span class="line">   280 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 scsi_tmf_0</span><br><span class="line">   284 root      20   0       0      0      0 S  0.0  0.0   0:00.01 scsi_eh_1</span><br><span class="line">   286 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 scsi_tmf_1</span><br></pre></td></tr></tbody></table></figure>
<h4 id="2-5-2-&#x5185;&#x5B58;"><a href="#2-5-2-&#x5185;&#x5B58;" class="headerlink" title="2.5.2 &#x5185;&#x5B58;"></a>2.5.2 &#x5185;&#x5B58;</h4><p><strong>free -h</strong><br></p><figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">[root@rhel7 ~]# free -h</span><br><span class="line">              total        used        free      shared  buff/cache   available</span><br><span class="line">Mem:           976M        659M        142M        1.4M        175M        140M</span><br><span class="line">Swap:          2.0G        215M        1.8G</span><br><span class="line">[root@rhel7 ~]#</span><br></pre></td></tr></tbody></table></figure><p></p>
<p><strong>top</strong></p>
<figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br></pre></td><td class="code"><pre><span class="line">top - 05:38:40 up 2 days, 14:07,  2 users,  load average: 0.50, 0.16, 0.23</span><br><span class="line">Tasks: 158 total,   1 running, 157 sleeping,   0 stopped,   0 zombie</span><br><span class="line">%Cpu(s):  1.4 us,  0.7 sy,  0.0 ni, 98.0 id,  0.0 wa,  0.0 hi,  0.0 si,  0.0 st</span><br><span class="line">KiB Mem :   999936 total,   144896 free,   675384 used,   179656 buff/cache</span><br><span class="line">KiB Swap:  2097148 total,  1876980 free,   220168 used.   143004 avail Mem</span><br><span class="line"></span><br><span class="line">   PID USER      PR  NI    VIRT    RES    SHR S %CPU %MEM     TIME+ COMMAND</span><br><span class="line">  2492 root      20   0 1476824  89756   3588 S  1.0  9.0   4:59.62 mongod</span><br><span class="line">  2521 root      20   0 1508032  86256   3612 S  1.0  8.6   5:00.86 mongod</span><br><span class="line">  1410 root      20   0 1075224  65992   2844 S  0.3  6.6  13:18.62 mongod</span><br><span class="line">  1876 root      20   0  140832   1128    464 S  0.3  0.1   0:07.76 sshd</span><br><span class="line">  2802 root      20   0 1591648 110528   3800 S  0.3 11.1   4:43.63 mongod</span><br><span class="line">  3155 root      20   0 1062216  83944   3040 S  0.3  8.4   2:25.67 mongod</span><br><span class="line">     1 root      20   0  128044   2288    604 S  0.0  0.2   0:02.73 systemd</span><br><span class="line">     2 root      20   0       0      0      0 S  0.0  0.0   0:00.01 kthreadd</span><br><span class="line">     3 root      20   0       0      0      0 S  0.0  0.0   0:05.51 ksoftirqd/0</span><br><span class="line">     7 root      rt   0       0      0      0 S  0.0  0.0   0:00.00 migration/0</span><br><span class="line">     8 root      20   0       0      0      0 S  0.0  0.0   0:00.00 rcu_bh</span><br><span class="line">     9 root      20   0       0      0      0 S  0.0  0.0   0:15.00 rcu_sched</span><br><span class="line">    10 root      rt   0       0      0      0 S  0.0  0.0   0:05.00 watchdog/0</span><br><span class="line">    12 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 khelper</span><br><span class="line">    13 root      20   0       0      0      0 S  0.0  0.0   0:00.00 kdevtmpfs</span><br><span class="line">    14 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 netns</span><br><span class="line">    15 root      20   0       0      0      0 S  0.0  0.0   0:00.15 khungtaskd</span><br><span class="line">    16 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 writebac</span><br></pre></td></tr></tbody></table></figure>
<h4 id="2-5-3-&#x8D1F;&#x8F7D;"><a href="#2-5-3-&#x8D1F;&#x8F7D;" class="headerlink" title="2.5.3 &#x8D1F;&#x8F7D;"></a>2.5.3 &#x8D1F;&#x8F7D;</h4><p><strong>uptime</strong><br></p><figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">[root@rhel7 ~]# uptime</span><br><span class="line"> 05:39:08 up 2 days, 14:07,  2 users,  load average: 0.33, 0.15, 0.22</span><br><span class="line">[root@rhel7 ~]#</span><br></pre></td></tr></tbody></table></figure><p></p>
<p><strong>top</strong><br></p><figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br></pre></td><td class="code"><pre><span class="line">[root@rhel7 ~]# top</span><br><span class="line">top - 05:38:40 up 2 days, 14:07,  2 users,  load average: 0.50, 0.16, 0.23</span><br><span class="line">Tasks: 158 total,   1 running, 157 sleeping,   0 stopped,   0 zombie</span><br><span class="line">%Cpu(s):  1.4 us,  0.7 sy,  0.0 ni, 98.0 id,  0.0 wa,  0.0 hi,  0.0 si,  0.0 st</span><br><span class="line">KiB Mem :   999936 total,   144896 free,   675384 used,   179656 buff/cache</span><br><span class="line">KiB Swap:  2097148 total,  1876980 free,   220168 used.   143004 avail Mem</span><br><span class="line"></span><br><span class="line">   PID USER      PR  NI    VIRT    RES    SHR S %CPU %MEM     TIME+ COMMAND</span><br><span class="line">  2492 root      20   0 1476824  89756   3588 S  1.0  9.0   4:59.62 mongod</span><br><span class="line">  2521 root      20   0 1508032  86256   3612 S  1.0  8.6   5:00.86 mongod</span><br><span class="line">  1410 root      20   0 1075224  65992   2844 S  0.3  6.6  13:18.62 mongod</span><br><span class="line">  1876 root      20   0  140832   1128    464 S  0.3  0.1   0:07.76 sshd</span><br><span class="line">  2802 root      20   0 1591648 110528   3800 S  0.3 11.1   4:43.63 mongod</span><br><span class="line">  3155 root      20   0 1062216  83944   3040 S  0.3  8.4   2:25.67 mongod</span><br><span class="line">     1 root      20   0  128044   2288    604 S  0.0  0.2   0:02.73 systemd</span><br><span class="line">     2 root      20   0       0      0      0 S  0.0  0.0   0:00.01 kthreadd</span><br><span class="line">     3 root      20   0       0      0      0 S  0.0  0.0   0:05.51 ksoftirqd/0</span><br><span class="line">     7 root      rt   0       0      0      0 S  0.0  0.0   0:00.00 migration/0</span><br><span class="line">     8 root      20   0       0      0      0 S  0.0  0.0   0:00.00 rcu_bh</span><br><span class="line">     9 root      20   0       0      0      0 S  0.0  0.0   0:15.00 rcu_sched</span><br><span class="line">    10 root      rt   0       0      0      0 S  0.0  0.0   0:05.00 watchdog/0</span><br><span class="line">    12 root       0 -20       0      0      0 S  0.0  0.0   0:00.00 khelper</span><br><span class="line">    13 root      20   0       0      0      0 S  0.0  0.0   0:00.00 kdevtmpfs</span><br></pre></td></tr></tbody></table></figure><p></p>
<p><strong>w</strong><br></p><figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">[root@rhel7 ~]# w</span><br><span class="line"> 05:39:57 up 2 days, 14:08,  2 users,  load average: 0.14, 0.13, 0.22</span><br><span class="line">USER     TTY      FROM             LOGIN@   IDLE   JCPU   PCPU WHAT</span><br><span class="line">root     pts/1    192.168.73.1     Sat17    5.00s  0.56s  0.00s w</span><br><span class="line">root     pts/2    192.168.73.1     Sat17    9:33   0.30s  0.26s ping www.163.com</span><br><span class="line">[root@rhel7 ~]#</span><br></pre></td></tr></tbody></table></figure><p></p>
<h4 id="2-5-4-&#x78C1;&#x76D8;"><a href="#2-5-4-&#x78C1;&#x76D8;" class="headerlink" title="2.5.4 &#x78C1;&#x76D8;"></a>2.5.4 &#x78C1;&#x76D8;</h4><p><strong>fdisk</strong><br></p><figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br></pre></td><td class="code"><pre><span class="line">[root@rhel7 ~]# fdisk -l</span><br><span class="line"></span><br><span class="line">Disk /dev/sda: 21.5 GB, 21474836480 bytes, 41943040 sectors</span><br><span class="line">Units = sectors of 1 * 512 = 512 bytes</span><br><span class="line">Sector size (logical/physical): 512 bytes / 512 bytes</span><br><span class="line">I/O size (minimum/optimal): 512 bytes / 512 bytes</span><br><span class="line">Disk label type: dos</span><br><span class="line">Disk identifier: 0x000d2bb3</span><br><span class="line"></span><br><span class="line">   Device Boot      Start         End      Blocks   Id  System</span><br><span class="line">/dev/sda1   *        2048     2099199     1048576   83  Linux</span><br><span class="line">/dev/sda2         2099200    41943039    19921920   8e  Linux LVM</span><br><span class="line"></span><br><span class="line">Disk /dev/sdb: 10.7 GB, 10737418240 bytes, 20971520 sectors</span><br><span class="line">Units = sectors of 1 * 512 = 512 bytes</span><br><span class="line">Sector size (logical/physical): 512 bytes / 512 bytes</span><br><span class="line">I/O size (minimum/optimal): 512 bytes / 512 bytes</span><br><span class="line"></span><br><span class="line"></span><br><span class="line">Disk /dev/sdc: 10.7 GB, 10737418240 bytes, 20971520 sectors</span><br><span class="line">Units = sectors of 1 * 512 = 512 bytes</span><br><span class="line">Sector size (logical/physical): 512 bytes / 512 bytes</span><br><span class="line">I/O size (minimum/optimal): 512 bytes / 512 bytes</span><br><span class="line"></span><br><span class="line"></span><br><span class="line">Disk /dev/sde: 10.7 GB, 10737418240 bytes, 20971520 sectors</span><br><span class="line">Units = sectors of 1 * 512 = 512 bytes</span><br><span class="line">Sector size (logical/physical): 512 bytes / 512 bytes</span><br><span class="line">I/O size (minimum/optimal): 512 bytes / 512 bytes</span><br><span class="line"></span><br><span class="line"></span><br><span class="line">Disk /dev/sdf: 10.7 GB, 10737418240 bytes, 20971520 sectors</span><br><span class="line">Units = sectors of 1 * 512 = 512 bytes</span><br><span class="line">Sector size (logical/physical): 512 bytes / 512 bytes</span><br><span class="line">I/O size (minimum/optimal): 512 bytes / 512 bytes</span><br><span class="line"></span><br><span class="line"></span><br><span class="line">Disk /dev/sdd: 10.7 GB, 10737418240 bytes, 20971520 sectors</span><br><span class="line">Units = sectors of 1 * 512 = 512 bytes</span><br><span class="line">Sector size (logical/physical): 512 bytes / 512 bytes</span><br><span class="line">I/O size (minimum/optimal): 512 bytes / 512 bytes</span><br><span class="line"></span><br><span class="line"></span><br><span class="line">Disk /dev/sdg: 10.7 GB, 10737418240 bytes, 20971520 sectors</span><br><span class="line">Units = sectors of 1 * 512 = 512 bytes</span><br><span class="line">Sector size (logical/physical): 512 bytes / 512 bytes</span><br><span class="line">I/O size (minimum/optimal): 512 bytes / 512 bytes</span><br><span class="line"></span><br><span class="line"></span><br><span class="line">Disk /dev/mapper/rhel-root: 18.2 GB, 18249416704 bytes, 35643392 sectors</span><br><span class="line">Units = sectors of 1 * 512 = 512 bytes</span><br><span class="line">Sector size (logical/physical): 512 bytes / 512 bytes</span><br><span class="line">I/O size (minimum/optimal): 512 bytes / 512 bytes</span><br><span class="line"></span><br><span class="line"></span><br><span class="line">Disk /dev/mapper/rhel-swap: 2147 MB, 2147483648 bytes, 4194304 sectors</span><br><span class="line">Units = sectors of 1 * 512 = 512 bytes</span><br><span class="line">Sector size (logical/physical): 512 bytes / 512 bytes</span><br><span class="line">I/O size (minimum/optimal): 512 bytes / 512 bytes</span><br><span class="line"></span><br><span class="line">[root@rhel7 ~]#</span><br></pre></td></tr></tbody></table></figure><p></p>
<p><strong>df</strong><br></p><figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line">[root@rhel7 ~]# df -h</span><br><span class="line">Filesystem             Size  Used Avail Use% Mounted on</span><br><span class="line">/dev/mapper/rhel-root   17G  4.7G   13G  28% /</span><br><span class="line">devtmpfs               478M     0  478M   0% /dev</span><br><span class="line">tmpfs                  489M     0  489M   0% /dev/shm</span><br><span class="line">tmpfs                  489M  6.8M  482M   2% /run</span><br><span class="line">tmpfs                  489M     0  489M   0% /sys/fs/cgroup</span><br><span class="line">/dev/sr0               3.6G  3.6G     0 100% /media/cdrom</span><br><span class="line">/dev/sda1             1014M  121M  894M  12% /boot</span><br><span class="line">tmpfs                   98M     0   98M   0% /run/user/0</span><br><span class="line">[root@rhel7 ~]#</span><br></pre></td></tr></tbody></table></figure><p></p>
<h4 id="2-5-5-&#x6574;&#x4F53;"><a href="#2-5-5-&#x6574;&#x4F53;" class="headerlink" title="2.5.5 &#x6574;&#x4F53;"></a>2.5.5 &#x6574;&#x4F53;</h4><p><strong>vmstat</strong><br></p><figure class="highlight plain"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">[root@rhel7 ~]# vmstat</span><br><span class="line">procs -----------memory---------- ---swap-- -----io---- -system-- ------cpu-----</span><br><span class="line"> r  b   swpd   free   buff  cache   si   so    bi    bo   in   cs us sy id wa st</span><br><span class="line"> 2  0 220132 137404     56 185372    0    1     6     6   87   12  0  0 99  0  0</span><br><span class="line">[root@rhel7 ~]#</span><br></pre></td></tr></tbody></table></figure><p></p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    
        <div>
            <a href="/posts/fa35a60d/" class="post-more waves-button">
                阅读全文 »
            </a>
        </div>
    </div>
    
</article>

        </li>
    
        <li class="post-list-item fade">
            <article id="post-OpenSSL使用教程" class="article-card article-type-post" itemprop="blogPost">

    


  
    <h3 class="post-title" itemprop="name">
      <a href="/posts/e8c4eb08/">OpenSSL使用教程</a>
    </h3>
  




     <div class="post-meta">
        <time class="post-time" title="2022-06-07 12:54:01" datetime="2022-06-07T04:54:01.000Z" itemprop="datePublished">2022-06-07</time>

    </div>

    <div class="post-content" id="post-content" itemprop="postContent">

    
        <h2 id="OpenSSL"><a href="#OpenSSL" class="headerlink" title="OpenSSL"></a>OpenSSL</h2><h3 id="OpenSSL&#x7684;&#x652F;&#x6301;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;"><a href="#OpenSSL&#x7684;&#x652F;&#x6301;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;" class="headerlink" title="OpenSSL&#x7684;&#x652F;&#x6301;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;"></a>OpenSSL&#x7684;&#x652F;&#x6301;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;</h3><p><strong>OpenSSL&#x4E00;&#x5171;&#x63D0;&#x4F9B;&#x4E86;8&#x79CD;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;</strong><br>7&#x79CD;&#x5206;&#x7EC4;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5; + 1&#x79CD;&#x6D41;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;RC4<br>&#x5206;&#x7EC4;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x5206;&#x522B;&#x662F;&#xFF1A;AES&#x3001;DES&#x3001;Blowfish&#x3001;CAST&#x3001;IDEA&#x3001;RC2&#x3001;RC5</p>
<p><strong>&#x56DB;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x5206;&#x7EC4;&#x5BC6;&#x7801;&#x52A0;&#x5BC6;&#x6A21;&#x5F0F;</strong>  </p>
<ul>
<li>&#x7535;&#x5B50;&#x5BC6;&#x7801;&#x672C;&#x6A21;&#x5F0F;&#xFF08;ECB&#xFF09;&#x3001;</li>
<li>&#x52A0;&#x5BC6;&#x5206;&#x7EC4;&#x94FE;&#x63A5;&#x6A21;&#x5F0F;&#xFF08;CBC&#xFF09;&#x3001;</li>
<li>&#x52A0;&#x5BC6;&#x53CD;&#x9988;&#x6A21;&#x5F0F;&#xFF08;CFB&#xFF09;  </li>
<li>&#x8F93;&#x51FA;&#x53CD;&#x9988;&#x6A21;&#x5F0F;&#xFF08;OFB&#xFF09;</li>
</ul>
<p><strong>&#x5176;&#x4E2D;&#xFF1A;</strong><br>AES&#x4F7F;&#x7528;&#x52A0;&#x5BC6;&#x53CD;&#x9988;&#x6A21;&#x5F0F;&#xFF08;CFB&#xFF09;&#x548C;&#x8F93;&#x51FA;&#x53CD;&#x9988;&#x6A21;&#x5F0F;&#xFF08;OFB&#xFF09;&#x5206;&#x7EC4;&#x957F;&#x5EA6;&#x662F;128&#x4F4D;<br>&#x5176;&#x5B83;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x5219;&#x662F;64&#x4F4D;&#x3002;<br>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;DES&#x7B97;&#x6CD5;&#x91CC;&#x9762;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5E38;&#x7528;&#x7684;DES&#x7B97;&#x6CD5;&#xFF0C;&#x8FD8;&#x652F;&#x6301;&#x4E09;&#x4E2A;&#x5BC6;&#x94A5;&#x548C;&#x4E24;&#x4E2A;&#x5BC6;&#x94A5;3DES&#x7B97;&#x6CD5;&#x3002; </p>
<h3 id="OpenSSL&#x652F;&#x6301;&#x7684;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;"><a href="#OpenSSL&#x652F;&#x6301;&#x7684;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;" class="headerlink" title="OpenSSL&#x652F;&#x6301;&#x7684;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;"></a>OpenSSL&#x652F;&#x6301;&#x7684;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;</h3><p><strong>OpenSSL&#x4E00;&#x5171;&#x5B9E;&#x73B0;&#x4E86;4&#x79CD;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;</strong>&#xFF0C;&#x5305;&#x62EC;<code>DH</code>&#x7B97;&#x6CD5;&#x3001;<code>RSA</code>&#x7B97;&#x6CD5;&#x3001;<code>DSA</code>&#x7B97;&#x6CD5;&#x548C;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7B97;&#x6CD5;&#xFF08;<code>EC</code>&#xFF09;&#x3002;<br><code>DH</code>&#x7B97;&#x6CD5;&#x4E00;&#x822C;&#x7528;&#x4E8E;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#x3002;<br><code>RSA</code>&#x7B97;&#x6CD5;&#x65E2;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5BC6;&#x94A5;&#x4EA4;&#x6362;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x591F;&#x5FCD;&#x53D7;&#x5176;&#x7F13;&#x6162;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x90A3;&#x4E48;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x3002;<br><code>DSA</code>&#x7B97;&#x6CD5;&#x5219;&#x4E00;&#x822C;&#x53EA;&#x7528;&#x4E8E;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3002;</p>
<h3 id="OpenSSL&#x652F;&#x6301;&#x7684;&#x4FE1;&#x606F;&#x6458;&#x8981;&#x7B97;&#x6CD5;"><a href="#OpenSSL&#x652F;&#x6301;&#x7684;&#x4FE1;&#x606F;&#x6458;&#x8981;&#x7B97;&#x6CD5;" class="headerlink" title="OpenSSL&#x652F;&#x6301;&#x7684;&#x4FE1;&#x606F;&#x6458;&#x8981;&#x7B97;&#x6CD5;"></a>OpenSSL&#x652F;&#x6301;&#x7684;&#x4FE1;&#x606F;&#x6458;&#x8981;&#x7B97;&#x6CD5;</h3><p><strong>OpenSSL&#x5B9E;&#x73B0;&#x4E86;5&#x79CD;&#x4FE1;&#x606F;&#x6458;&#x8981;&#x7B97;&#x6CD5;</strong>&#xFF0C;&#x5206;&#x522B;&#x662F;<code>MD2</code>&#x3001;<code>MD5</code>&#x3001;<code>MDC2</code>&#x3001;<code>SHA&#xFF08;SHA1&#xFF09;</code>&#x548C;<code>RIPEMD</code>&#x3002;SHA&#x7B97;&#x6CD5;&#x4E8B;&#x5B9E;&#x4E0A;&#x5305;&#x62EC;&#x4E86;SHA&#x548C;SHA1&#x4E24;&#x79CD;&#x4FE1;&#x606F;&#x6458;&#x8981;&#x7B97;&#x6CD5;&#xFF0C;&#x6B64;&#x5916;&#xFF0C;OpenSSL&#x8FD8;&#x5B9E;&#x73B0;&#x4E86;DSS&#x6807;&#x51C6;&#x4E2D;&#x89C4;&#x5B9A;&#x7684;&#x4E24;&#x79CD;&#x4FE1;&#x606F;&#x6458;&#x8981;&#x7B97;&#x6CD5;DSS&#x548C;DSS1&#x3002; </p>
<h3 id="&#x57FA;&#x4E8E;OpenSSL&#x7684;&#x5BC6;&#x94A5;&#x4E0E;&#x8BC1;&#x4E66;&#x7BA1;&#x7406;"><a href="#&#x57FA;&#x4E8E;OpenSSL&#x7684;&#x5BC6;&#x94A5;&#x4E0E;&#x8BC1;&#x4E66;&#x7BA1;&#x7406;" class="headerlink" title="&#x57FA;&#x4E8E;OpenSSL&#x7684;&#x5BC6;&#x94A5;&#x4E0E;&#x8BC1;&#x4E66;&#x7BA1;&#x7406;"></a>&#x57FA;&#x4E8E;OpenSSL&#x7684;&#x5BC6;&#x94A5;&#x4E0E;&#x8BC1;&#x4E66;&#x7BA1;&#x7406;</h3><p>&#x5BC6;&#x94A5;&#x548C;&#x8BC1;&#x4E66;&#x7BA1;&#x7406;&#x662F;PKI&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;OpenSSL&#x4E3A;&#x4E4B;&#x63D0;&#x4F9B;&#x4E86;&#x4E30;&#x5BCC;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x652F;&#x6301;&#x591A;&#x79CD;&#x6807;&#x51C6;&#x3002; </p>
<p>&#x9996;&#x5148;&#xFF0C;OpenSSL&#x5B9E;&#x73B0;&#x4E86;ASN.1&#x7684;&#x8BC1;&#x4E66;&#x548C;&#x5BC6;&#x94A5;&#x76F8;&#x5173;&#x6807;&#x51C6;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x8BC1;&#x4E66;&#x3001;&#x516C;&#x94A5;&#x3001;&#x79C1;&#x94A5;&#x3001;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x4EE5;&#x53CA;CRL&#x7B49;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x7684;DER&#x3001;PEM&#x548C;BASE64&#x7684;&#x7F16;&#x89E3;&#x7801;&#x529F;&#x80FD;&#x3002;<br>OpenSSL&#x63D0;&#x4F9B;&#x4E86;&#x4EA7;&#x751F;&#x5404;&#x79CD;&#x516C;&#x5F00;&#x5BC6;&#x94A5;&#x5BF9;&#x548C;&#x5BF9;&#x79F0;&#x5BC6;&#x94A5;&#x7684;&#x65B9;&#x6CD5;&#x3001;&#x51FD;&#x6570;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#x7684;DER&#x7F16;&#x89E3;&#x7801;&#x529F;&#x80FD;&#x3002;&#x5E76;&#x5B9E;&#x73B0;&#x4E86;&#x79C1;&#x94A5;&#x7684;PKCS#12&#x548C;PKCS#8&#x7684;&#x7F16;&#x89E3;&#x7801;&#x529F;&#x80FD;&#x3002;OpenSSL&#x5728;&#x6807;&#x51C6;&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x79C1;&#x94A5;&#x7684;&#x52A0;&#x5BC6;&#x4FDD;&#x62A4;&#x529F;&#x80FD;&#xFF0C;&#x4F7F;&#x5F97;&#x5BC6;&#x94A5;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x548C;&#x5206;&#x53D1;&#x3002; </p>
<p>&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;OpenSSL&#x5B9E;&#x73B0;&#x4E86;&#x5BF9;&#x8BC1;&#x4E66;&#x7684;X.509&#x6807;&#x51C6;&#x7F16;&#x89E3;&#x7801;&#x3001;PKCS#12&#x683C;&#x5F0F;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x4EE5;&#x53CA;PKCS#7&#x7684;&#x7F16;&#x89E3;&#x7801;&#x529F;&#x80FD;&#x3002;&#x5E76;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6587;&#x672C;&#x6570;&#x636E;&#x5E93;&#xFF0C;<strong>&#x652F;&#x6301;&#x8BC1;&#x4E66;&#x7684;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#xFF0C;&#x5305;&#x62EC;&#x8BC1;&#x4E66;&#x5BC6;&#x94A5;&#x4EA7;&#x751F;&#x3001;&#x8BF7;&#x6C42;&#x4EA7;&#x751F;&#x3001;&#x8BC1;&#x4E66;&#x7B7E;&#x53D1;&#x3001;&#x540A;&#x9500;&#x548C;&#x9A8C;&#x8BC1;&#x7B49;&#x529F;&#x80FD;&#x3002;</strong> </p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;OpenSSL&#x63D0;&#x4F9B;&#x7684;CA&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x578B;&#x7684;&#x8BC1;&#x4E66;&#x7BA1;&#x7406;&#x4E2D;&#x5FC3;&#xFF08;CA&#xFF09;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x8BC1;&#x4E66;&#x7B7E;&#x53D1;&#x7684;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x548C;&#x8BC1;&#x4E66;&#x7BA1;&#x7406;&#x7684;&#x5927;&#x90E8;&#x5206;&#x673A;&#x5236;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
    
        <div>
            <a href="/posts/e8c4eb08/" class="post-more waves-button">
                阅读全文 »
            </a>
        </div>
    </div>
    
</article>

        </li>
    
    </ul>

    
<nav id="page-nav">
    <div class="inner">
    <a class="extend prev" rel="prev" href="/page/4/">上一页</a><a class="page-number" href="/">1</a><span class="space">&hellip;</span><a class="page-number" href="/page/3/">3</a><a class="page-number" href="/page/4/">4</a><span class="page-number current">5</span><a class="page-number" href="/page/6/">6</a><a class="page-number" href="/page/7/">7</a><span class="space">&hellip;</span><a class="page-number" href="/page/16/">16</a><a class="extend next" rel="next" href="/page/6/">下一页</a>
    </div>
</nav>


</div>

        <footer class="footer">
    <div class="footer-content">
        <span class="power">
            <i class="icon icon-lg icon-copyright"></i>
            2022
            <i class="icon icon-lg icon-heart"></i>
            <a href="https://marnm.github.io">marnm.github.io</a>
            <br>
            Power by
            <a href="https://hexo.io/" target="_blank" rel="external nofollow">Hexo</a>&nbsp;·&nbsp;
            Theme
            <a class="tomotoeslink" href="https://github.com/tomotoes/hexo-theme-tomotoes/" target="_blank" rel="external nofollow">tomotoes</a>
        </span>

        <br>

        <span id="RunTime" style="color:#a7a7a2;"></span>
        <br>

        <span>
            

        </span>
        <br>

        <span class="license"><a target="_blank" rel="license" href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh">博客内容遵循 知识共享 署名 - 非商业性 - 相同方式共享 4.0 国际协议</a></span>
    </div>
</footer>

    </main>
    
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>


    <!-- waves按钮特效 -->
<script src="//cdn.bootcss.com/node-waves/0.7.4/waves.min.js"></script>

<!-- 主题配置脚本 -->
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: false };
</script>

<!-- jquery -->
<script src="/js/jquery.min.js?v=3.0"></script>

<!-- 搜索 -->

<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item waves-block waves-effect" onclick="location.href='{path}'">
    <div class="title ellipsis" title="{title}">{title}</div>
</li>
</template>


<!-- main博客脚本 -->
<script src="/js/main.min.js?v=3.0"></script>

<!-- 动画&配置 -->
<script src="/js/script.min.js?v=3.0"></script>

<!-- 脚本管理 -->
<script>

if(window.innerWidth > 800){
	/* 3D标题 */
	$(".content-header").on("mousemove", threedee);

	/* 底部追随鼠标 */
	$(".footer").hover(2);

	/* gotop键的涟漪 */
	$("#gotop").hover(1);

	/* 赞赏的粒子雨 */
	$("#reward").hover(3);

	/* 微信公众号的底部渲染 */
	$("#wechat").hover(4);

    /* 标题跳动 */
    $(".archivestitle").bumpyText();

	/* 图片点击放大 */
	const postimg = jQuery(".post-content img:not(.github-emoji)");
	postimg.on("click",function(){

		mask.classList.add("in");
		main.classList.add("Mask");
		menu.classList.add("Mask");
		var myimg = this.cloneNode(true);
		myimg.classList.add("imgShow");

		setTimeout(function(){
			jQuery(myimg).animate({
				opacity:"1"
			},1000);
		},0);

		document.body.appendChild(myimg);

		myimg.onclick=function(){
			document.body.removeChild(myimg);
			mask.classList.remove("in");
			main.classList.remove("Mask");
			menu.classList.remove("Mask");
		};

	});

}

/* 名字跳动 */
$("#name").bumpyText();


/* 网站运行时间 */
setInterval(function () {
	setTime("2019/01/01");
}, 1000);

/* 文章块的淡出 */
postshow();

/* 座右铭 */

   getHitokoto();



/* 粘贴提示 */
G($(".post-content"), location.href, "Echo");


/* 控制台 */
if (window.console && window.console.log) {
	setTimeout(function () {
		console.log("\n %c 一个坏掉的番茄 %c  © Simon Ma  http://tomotoes.com \n\n", "color:#FFFFFB;background:#1abc9c;padding:5px 0;border-radius:.5rem 0 0 .5rem;", "color:#FFFFFB;background:#080808;padding:5px 0;border-radius:0 .5rem .5rem 0;");
	}, 0);
}

</script>




<!-- 公式渲染 -->



<!-- 不蒜子 -->


</body>
</html>
