<!DOCTYPE html>
<html>
<head><meta name="generator" content="Hexo 3.8.0">
    <meta http-equiv="Content-Language" content="zh-cn">
    <meta charset="utf-8">
    
    
    
    <title>计算机概述 | Deops&#39;s blog | 运维开发工程师</title>
    <meta name="viewport" content="width=device-width,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no">
    
    <meta name="theme-color" content="#77AAFF">
    
    
    <meta name="keywords" content="">
    
    

    

    <!-- Baidu Push -->
<script>
	(function(){
		var bp = document.createElement('script');
		var curProtocol = window.location.protocol.split(':')[0];
		if (curProtocol === 'https') {
			bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';
		}
		else {
			bp.src = 'http://push.zhanzhang.baidu.com/push.js';
		}
		var s = document.getElementsByTagName("script")[0];
		s.parentNode.insertBefore(bp, s);
	})();

	var _hmt = _hmt || [];
</script>



    
    <meta name="description" content="计算机概述 今天1024，浅谈以下计算机历史….  计算机发展的历史自古以来人类就在不断地发明和改进计算工具，从结绳计数到算盘，计算尺，手摇计算机，直到1946年第一台电子计算机诞生，虽然电子计算机至今虽然只有短短的半个多世纪，但取得了惊人的发展吗，已经经历了五代的变革。计算机的发展和电子技术的发展密切相关，故每次电子技术有突破性的发展，就会导致计算机的一次重大变革。所以计算机发展史中的 ‘’代‘">
<meta name="keywords" content="Echo">
<meta property="og:type" content="article">
<meta property="og:title" content="计算机概述">
<meta property="og:url" content="https://marnm.github.io/posts/217dc297/index.html">
<meta property="og:site_name" content="Deops&#39;s blog">
<meta property="og:description" content="计算机概述 今天1024，浅谈以下计算机历史….  计算机发展的历史自古以来人类就在不断地发明和改进计算工具，从结绳计数到算盘，计算尺，手摇计算机，直到1946年第一台电子计算机诞生，虽然电子计算机至今虽然只有短短的半个多世纪，但取得了惊人的发展吗，已经经历了五代的变革。计算机的发展和电子技术的发展密切相关，故每次电子技术有突破性的发展，就会导致计算机的一次重大变革。所以计算机发展史中的 ‘’代‘">
<meta property="og:locale" content="zh-Hans">
<meta property="og:updated_time" content="2022-05-27T01:37:50.116Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="计算机概述">
<meta name="twitter:description" content="计算机概述 今天1024，浅谈以下计算机历史….  计算机发展的历史自古以来人类就在不断地发明和改进计算工具，从结绳计数到算盘，计算尺，手摇计算机，直到1946年第一台电子计算机诞生，虽然电子计算机至今虽然只有短短的半个多世纪，但取得了惊人的发展吗，已经经历了五代的变革。计算机的发展和电子技术的发展密切相关，故每次电子技术有突破性的发展，就会导致计算机的一次重大变革。所以计算机发展史中的 ‘’代‘">
    
        <link rel="alternate" type="application/atom+xml" title="Deops&#39;s blog" href="/atom.xml">
    
    <link rel="shortcut icon" href="/img/favicon.ico">
    <link id="style" rel="stylesheet" href="/css/style.css?v=3.0">
    <script>window.lazyScripts=[]</script>

    <!-- custom head -->
    
            
</head>

<body>
    <div id="loading" class="active"></div>
    <aside id="menu" class="hide">
  <div class="inner flex-row-vertical">
    <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="menu-off">
        <i class="icon icon-lg icon-close"></i>
    </a>
    <div class="brand-wrap">
      <div class="brand">
        <a href="/" class="avatar waves-effect waves-circle waves-light">
          <img src="/img/avatar.gif" alt="avatar">
        </a>
        <hgroup class="introduce">
          <h5 class="nickname" id="name">Echo</h5>
          
            <div id="yiyanmotto" class="motto">&nbsp;</div>
          
        </hgroup>
      </div>
    </div>
    <div class="scroll-wrap flex-col">
      <ul class="nav">
        
              <li class="waves-block waves-effect">
                  <a href="/">
                    <i class="icon icon-lg icon-home"></i>
                    <span>主 页</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/archives">
                    <i class="icon icon-lg icon-archives"></i>
                    <span>归 档</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/categories">
                    <i class="icon icon-lg icon-th-list"></i>
                    <span>分 类</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/tags">
                    <i class="icon icon-lg icon-tags"></i>
                    <span>标 签</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
              <li class="waves-block waves-effect">
                  <a href="/about">
                    <i class="icon icon-lg icon-smile-o"></i>
                    <span>关 于</span><i class="icon icon-lg icon-caret-left"></i>
                  </a>
              </li>
            
      <div class="nav2">
          
              <a class="nav2item" data-title="Email" href="http://mail.qq.com/cgi-bin/qm_share?t=qm_mailme&email=442KgIbNhZajhYybjoKKj82AjI4" target="_parent" title="Email">
                <i class="icon icon-lg icon-envelope-o envelope-o"></i>
              </a>
          
              <a class="nav2item" data-title="Github" href="https://github.com/Marnm" target="_blank" title="Github">
                <i class="icon icon-lg icon-github github"></i>
              </a>
          
              <a class="nav2item" data-title="我的哔哩哔哩" href="https://space.bilibili.com/31374976" target="_blank" title="我的哔哩哔哩">
                <i class="icon icon-lg icon-tv tv"></i>
              </a>
          

            </div>
        
      </ul>
        
    </div>
  </div>
 
</aside>


    <main id="main">
        <header class="top-header" id="header">
    <div class="flex-row">
        <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light on" id="menu-toggle">
          <i class="icon icon-lg icon-navicon"></i>
        </a>
        <div class="flex-col header-title ellipsis">计算机概述</div>
        
        <div class="search-wrap" id="search-wrap">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="back">
                <i class="icon icon-lg icon-chevron-left"></i>
            </a>
            <input type="text" id="key" class="search-input" autocomplete="off" placeholder="输入感兴趣的关键字">
            <a href="javascript:;" class="header-icon waves-effect waves-circle waves-light" id="search">
                <i class="icon icon-lg icon-search"></i>
            </a>
        </div>
        
        <a href="../../atom.xml" target="_blank" class="header-icon waves-effect waves-circle waves-light" id="Rss">
            <i class="icon icon-lg icon-rss"></i>
        </a>
    </div>
</header>
<header class="content-header post-header">
    
    
    <div class="container fade-scale">
        <div id="myheader">
            <h1 class="title">
                
            </h1>
            <h5 class="subtitle">
                
                
            </h5>
        </div>
    </div>

</header>


<div class="container body-wrap">
    
    <aside class="post-widget">
        <nav class="post-toc-wrap" id="post-toc">
            <h4>TOC</h4>
            <ol class="post-toc"><li class="post-toc-item post-toc-level-2"><a class="post-toc-link" href="#计算机概述"><span class="post-toc-number">1.</span> <span class="post-toc-text">计算机概述</span></a><ol class="post-toc-child"><li class="post-toc-item post-toc-level-3"><a class="post-toc-link" href="#计算机发展的历史"><span class="post-toc-number">1.1.</span> <span class="post-toc-text">计算机发展的历史</span></a></li></ol></li></ol>
        </nav>
    </aside>
   
<article id="post-计算机概述" class="post-article article-type-post fade" itemprop="blogPost">

    <div class="post-card">
        <h1 class="post-card-title">计算机概述</h1>
        <div class="post-meta">
            <i class="icon icon-lg icon-calendar-o"></i>
            发表于
            <time class="post-time" title="2020-10-24 21:39:04" datetime="2020-10-24T13:39:04.000Z" itemprop="datePublished">2020-10-24</time>

            <br id="mybreak">
            
<script>
	mybreak.style="display:none";
</script>


            <i>·</i>
            

        </div>
        <div class="post-count-custom">
            <i class="icon icon-lg icon-comment-o"></i>
            阅读本文可能花费您&nbsp;<span class="post-count">10</span>&nbsp;分钟
        </div>
        <div class="post-content" id="post-content" itemprop="postContent">
            <h2 id="&#x8BA1;&#x7B97;&#x673A;&#x6982;&#x8FF0;"><a href="#&#x8BA1;&#x7B97;&#x673A;&#x6982;&#x8FF0;" class="headerlink" title="&#x8BA1;&#x7B97;&#x673A;&#x6982;&#x8FF0;"></a>&#x8BA1;&#x7B97;&#x673A;&#x6982;&#x8FF0;</h2><blockquote>
<p>&#x4ECA;&#x5929;1024&#xFF0C;&#x6D45;&#x8C08;&#x4EE5;&#x4E0B;&#x8BA1;&#x7B97;&#x673A;&#x5386;&#x53F2;&#x2026;.</p>
</blockquote>
<h3 id="&#x8BA1;&#x7B97;&#x673A;&#x53D1;&#x5C55;&#x7684;&#x5386;&#x53F2;"><a href="#&#x8BA1;&#x7B97;&#x673A;&#x53D1;&#x5C55;&#x7684;&#x5386;&#x53F2;" class="headerlink" title="&#x8BA1;&#x7B97;&#x673A;&#x53D1;&#x5C55;&#x7684;&#x5386;&#x53F2;"></a>&#x8BA1;&#x7B97;&#x673A;&#x53D1;&#x5C55;&#x7684;&#x5386;&#x53F2;</h3><p>&#x81EA;&#x53E4;&#x4EE5;&#x6765;&#x4EBA;&#x7C7B;&#x5C31;&#x5728;&#x4E0D;&#x65AD;&#x5730;&#x53D1;&#x660E;&#x548C;&#x6539;&#x8FDB;&#x8BA1;&#x7B97;&#x5DE5;&#x5177;&#xFF0C;&#x4ECE;&#x7ED3;&#x7EF3;&#x8BA1;&#x6570;&#x5230;&#x7B97;&#x76D8;&#xFF0C;&#x8BA1;&#x7B97;&#x5C3A;&#xFF0C;&#x624B;&#x6447;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x76F4;&#x5230;1946&#x5E74;&#x7B2C;&#x4E00;&#x53F0;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x8BDE;&#x751F;&#xFF0C;&#x867D;&#x7136;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x81F3;&#x4ECA;&#x867D;&#x7136;&#x53EA;&#x6709;&#x77ED;&#x77ED;&#x7684;&#x534A;&#x4E2A;&#x591A;&#x4E16;&#x7EAA;&#xFF0C;&#x4F46;&#x53D6;&#x5F97;&#x4E86;&#x60CA;&#x4EBA;&#x7684;&#x53D1;&#x5C55;&#x5417;&#xFF0C;&#x5DF2;&#x7ECF;&#x7ECF;&#x5386;&#x4E86;&#x4E94;&#x4EE3;&#x7684;&#x53D8;&#x9769;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x53D1;&#x5C55;&#x548C;&#x7535;&#x5B50;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#xFF0C;&#x6545;&#x6BCF;&#x6B21;&#x7535;&#x5B50;&#x6280;&#x672F;&#x6709;&#x7A81;&#x7834;&#x6027;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4E00;&#x6B21;&#x91CD;&#x5927;&#x53D8;&#x9769;&#x3002;&#x6240;&#x4EE5;&#x8BA1;&#x7B97;&#x673A;&#x53D1;&#x5C55;&#x53F2;&#x4E2D;&#x7684; &#x2018;&#x2019;&#x4EE3;&#x2018;&#x2019; &#x901A;&#x5E38;&#x4EE5;&#x5176;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x4E3B;&#x8981;&#x5668;&#x4EF6;&#x6765;&#x5212;&#x5206;&#x7684;&#xFF08;&#x7535;&#x5B50;&#x7BA1;&#xFF0C;&#x6676;&#x4F53;&#x7BA1;&#xFF0C;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#xFF0C;&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#xFF0C;&#x8D85;&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#xFF09;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#x6240;&#x914D;&#x7F6E;&#x7684;&#x8F6F;&#x4EF6;&#x548C;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x4E5F;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x6210;&#x4E3A;&#x5212;&#x5206; &#x201C;&#x4EE3;&#x201D; &#x7684;&#x6807;&#x5FD7;&#x4E4B;&#x4E00;&#x3002;<br><a id="more"></a><br><strong>1&#xFF1A;&#x7B2C;&#x4E00;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#xFF08;1946-1957&#xFF09;</strong></p>
<p>&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x65E9;&#x671F;&#x7814;&#x7A76;&#x662F;&#x4ECE;20&#x4E16;&#x7EAA;30&#x5E74;&#x4EE3;&#x672B;&#x5F00;&#x59CB;&#x7684;&#x3002;&#x82F1;&#x56FD;&#x6570;&#x5B66;&#x5BB6; &#x827E;&#x4F26;&#x25AA;&#x56FE;&#x7075; &#x5728;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#x63CF;&#x8FF0;&#x4E86;&#x901A;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x5E94;&#x5177;&#x6709;&#x7684;&#x5168;&#x90E8;&#x529F;&#x80FD;&#x53CA;&#x5176;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x8FD9;&#x79CD;&#x673A;&#x5668;&#x88AB;&#x6210;&#x4E3A;&#x56FE;&#x7075;&#x673A;&#x3002;&#xFF08;&#x4E16;&#x754C;&#x7B2C;&#x4E00;&#x53F0;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A; ENIAC &#x5728;1946&#x5E74;&#x8BDE;&#x751F;&#x4E8E;&#x7F8E;&#x56FD;&#x5BBE;&#x5915;&#x6CD5;&#x5C3C;&#x4E9A;&#x5927;&#x5B66;&#xFF0C;&#x4F46;&#x5B66;&#x672F;&#x754C;&#x516C;&#x8BA4;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x7406;&#x8BBA;&#x548C;&#x6A21;&#x578B;&#x662F;&#x7531;&#x82F1;&#x56FD;&#x6570;&#x5B66;&#x5BB6;&#x56FE;&#x7075;&#x5728;&#x6B64;10&#x5E74;&#x524D;&#x53D1;&#x8868;&#x7684;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#x300A;&#x8BBA;&#x53EF;&#x8BA1;&#x7B97;&#x6570;&#x53CA;&#x5176;&#x5728;&#x5224;&#x5B9A;&#x95EE;&#x9898;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x300B;&#x4E2D;&#x5960;&#x5B9A;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x7F8E;&#x56FD;&#x8BA1;&#x7B97;&#x673A;&#x534F;&#x4F1A;&#x5728;1966&#x5E74;&#x7EAA;&#x5FF5;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#x8BDE;&#x751F;20&#x5468;&#x5E74;&#x65F6;&#xFF0C;&#x8BBE;&#x7ACB;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x754C;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5956;&#x9879; &#x201C;&#x56FE;&#x7075;&#x5956;&#x201D; &#xFF0C;&#x4EE5;&#x7EAA;&#x5FF5;&#x8FD9;&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7406;&#x8BBA;&#x7684;&#x5960;&#x57FA;&#x4EBA;&#xFF09;</p>
<p>1939&#x5E74;&#xFF0C;&#x7F8E;&#x56FD;&#x8863;&#x963F;&#x534E;&#x5DDE;&#x7ACB;&#x5927;&#x5B66;&#x7684;&#x7EA6;&#x7FF0;&#x25AA;&#x963F;&#x5854;&#x7EB3;&#x7D22;&#x592B;&#x6559;&#x6388;&#x548C;&#x4ED6;&#x7684;&#x7814;&#x7A76;&#x751F;&#x514B;&#x91CC;&#x798F;&#x5FB7;&#x25AA;&#x8D1D;&#x91CC;&#x4E00;&#x8D77;&#x5236;&#x4F5C;&#x4E86;&#x4E00;&#x53F0;&#x79F0;&#x4E3A;ABC&#x7684;&#x673A;&#x5668;&#xFF0C;&#x4F46;&#x5176;&#x4EC5;&#x80FD;&#x6C42;&#x89E3;&#x65B9;&#x7A0B;&#x5F0F;&#x7684;&#x4E13;&#x7528;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF1B;</p>
<p>1944&#x5E74;&#xFF0C;&#x54C8;&#x4F5B;&#x5927;&#x5B66;&#x970D;&#x534E;&#x5FB7;&#x25AA;&#x827E;&#x80AF;&#x535A;&#x58EB;&#x548C;IBM&#x516C;&#x53F8;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x5C0F;&#x7EC4;&#x5408;&#x4F5C;&#xFF0C;&#x4EE5;100&#x4E07;&#x7F8E;&#x5143;&#x7814;&#x5236;&#x4E86;&#x4E00;&#x53F0;&#x79F0;&#x4E3A;Mark-I&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5B83;&#x4F53;&#x79EF;&#x5927;&#xFF0C;&#x8FD0;&#x7B97;&#x901F;&#x5EA6;&#x4E5F;&#x6162;&#xFF0C;&#x4E14;&#x4EC5;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x7535;&#x5B50;&#x5F0F;&#x7684;&#xFF0C;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x673A;&#x68B0;&#x5F0F;&#x7684;&#xFF1B;</p>
<p>1946&#x5E74;&#xFF0C;&#x5BBE;&#x5915;&#x6CD5;&#x5C3C;&#x4E9A;&#x5927;&#x5B66;&#x7684;&#x7EA6;&#x7FF0;&#x25AA;&#x83AB;&#x514B;&#x83B1;&#x548C;&#x4ED6;&#x7684;&#x7814;&#x7A76;&#x751F;&#x666E;&#x96F7;&#x65AF;&#x5E15;&#x25AA;&#x57C3;&#x514B;&#x7279;&#x4E00;&#x8D77;&#x7814;&#x5236;&#x4E86;ENIAC&#xFF08;&#x7535;&#x5B50;&#x6570;&#x5B57;&#x79EF;&#x5206;&#x8BA1;&#x7B97;&#x673A;&#xFF09;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x662F;&#x516C;&#x8BA4;&#x7684;&#x4E16;&#x754C;&#x4E0A;&#x7B2C;&#x4E00;&#x53F0;&#x7535;&#x5B50;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8BE5;&#x8BA1;&#x7B97;&#x673A;&#x91C7;&#x53D6;&#x4E86;&#x666E;&#x6797;&#x65AF;&#x987F;&#x5927;&#x5B66;&#x6570;&#x5B66;&#x6559;&#x6388; &#x51AF;&#x25AA;&#x4F0A;&#x8BFA;&#x66FC; &#x201C;&#x5B58;&#x50A8;&#x7A0B;&#x5E8F;&#x201D;&#x7684;&#x5EFA;&#x8BAE;&#xFF08;&#x628A;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x4E0E;&#x6570;&#x636E;&#x4E00;&#x8D77;&#x5B58;&#x50A8;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x8FD4;&#x56DE;&#x524D;&#x9762;&#x7684;&#x6307;&#x4EE4;&#x6216;&#x53CD;&#x590D;&#x6267;&#x884C;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;ENIAC&#x5728;&#x64CD;&#x4F5C;&#x4E0A;&#x7684;&#x4E0D;&#x4FBF;&#xFF09;&#xFF1B;</p>
<p>&#x4E00;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5171;&#x540C;&#x7279;&#x70B9;&#xFF1A;&#x903B;&#x8F91;&#x5668;&#x4EF6;&#x4F7F;&#x7528;&#x7535;&#x5B50;&#x7BA1;&#xFF1B;&#x7528;&#x7A7F;&#x5B54;&#x5361;&#x7247;&#x673A;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x548C;&#x6307;&#x4EE4;&#x7684;&#x8F93;&#x5165;&#x8BBE;&#x5907;&#xFF1B;&#x7528;&#x78C1;&#x9F13;&#x6216;&#x78C1;&#x5E26;&#x4F5C;&#x4E3A;&#x5916;&#x5B58;&#x50A8;&#x5668;&#xFF1B;&#x4F7F;&#x7528;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x7F16;&#x7A0B;&#x3002;</p>
<p><strong>2&#xFF1A;&#x7B2C;&#x4E8C;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#xFF08;1958-1964&#xFF09;</strong></p>
<p>&#x5728;&#x4E8C;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x6676;&#x4F53;&#x7BA1;&#xFF0C;&#x4E0E;&#x4E00;&#x4EE3;&#x673A;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x4F53;&#x79EF;&#x5C0F;&#xFF0C;&#x901F;&#x5EA6;&#x5FEB;&#xFF0C;&#x80FD;&#x8017;&#x4F4E;&#xFF0C;&#x53EF;&#x9760;&#x6027;&#x9AD8;&#xFF1B;</p>
<p>&#x9AD8;&#x7EA7;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x7684;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x5C06;&#x8BA1;&#x7B97;&#x673A;&#x4ECE;&#x5C11;&#x6570;&#x4E13;&#x4E1A;&#x4EBA;&#x5458;&#x624B;&#x4E2D;&#x89E3;&#x653E;&#x51FA;&#x6765;&#xFF0C;&#x63A8;&#x8FDB;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x666E;&#x53CA;&#x4E0E;&#x5E94;&#x7528;&#xFF1B;</p>
<p>&#x4E8C;&#x4EE3;&#x673A;&#x5668;&#x4E2D;&#x8F93;&#x5165;&#x3001;&#x8F93;&#x51FA;&#x8BBE;&#x5907;&#x901F;&#x5EA6;&#x5F88;&#x6162;&#xFF0C;&#x65E0;&#x6CD5;&#x4E0E;&#x4E3B;&#x673A;&#x7684;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x76F8;&#x5339;&#x914D;&#x3002;</p>
<p>&#x4E8C;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x7279;&#x70B9;&#x4E3A;&#xFF1A;&#x7528;&#x6676;&#x4F53;&#x7BA1;&#x4EE3;&#x66FF;&#x7535;&#x5B50;&#x7BA1;&#xFF1B;&#x5185;&#x5B58;&#x50A8;&#x5668;&#x91C7;&#x7528;&#x4E86;&#x78C1;&#x5FC3;&#x4F53;&#xFF1B;&#x5F15;&#x5165;&#x4E86;&#x53D8;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x6D6E;&#x70B9;&#x8FD0;&#x7B97;&#x786C;&#x4EF6;&#xFF1B;&#x5229;&#x7528; I/O &#x5904;&#x7406;&#x673A;&#x63D0;&#x9AD8;&#x4E86;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x80FD;&#x529B;&#xFF1B;&#x8F6F;&#x4EF6;&#x65B9;&#x9762;&#x914D;&#x7F6E;&#x4E86;&#x5B50;&#x7A0B;&#x5E8F;&#x5E93;&#x548C;&#x6279;&#x5904;&#x7406;&#x7BA1;&#x7406;&#x7A0B;&#x5E8F;&#x3002;</p>
<p><strong>3&#xFF1A;&#x7B2C;&#x4E09;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#xFF08;1965-1971&#xFF09;</strong></p>
<p>1958&#x5E74;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x95EE;&#x4E16;&#xFF08;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x5C31;&#x662F;&#x5C06;&#x5927;&#x91CF;&#x7684;&#x6676;&#x4F53;&#x7BA1;&#x548C;&#x7535;&#x5B50;&#x7EBF;&#x8DEF;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x5757;&#x7845;&#x6676;&#x7247;&#x4E0A;&#xFF0C;&#x6545;&#x79F0;&#x4E3A;&#x82AF;&#x7247;&#xFF09;&#x3002;</p>
<p>&#x4E09;&#x4EE3;&#x8BA1;&#x7B97;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x7528;&#x5C0F;&#x89C4;&#x6A21;&#xFF08;100&#x4EE5;&#x4E0B;&#x5143;&#x4EF6;&#xFF09;&#x6216;&#x4E2D;&#x89C4;&#x6A21;&#xFF08;100-1000&#x5143;&#x4EF6;&#xFF09;&#x7684;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x6765;&#x4EE3;&#x66FF;&#x6676;&#x4F53;&#x7BA1;&#x7B49;&#x5206;&#x7ACB;&#x5143;&#x4EF6;&#xFF1B;&#x7528;&#x534A;&#x5BFC;&#x4F53;&#x5B58;&#x50A8;&#x5668;&#x4EE3;&#x66FF;&#x78C1;&#x5FC3;&#x5B58;&#x50A8;&#x5668;&#xFF1B;&#x4F7F;&#x7528;&#x5FAE;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x7B80;&#x5316;&#x5904;&#x7406;&#x673A;&#x7684;&#x7ED3;&#x6784;&#xFF1B;&#x5728;&#x8F6F;&#x4EF6;&#x65B9;&#x9762;&#x5E7F;&#x6CDB;&#x5F15;&#x5165;&#x591A;&#x9053;&#x7A0B;&#x5E8F;&#x3001;&#x5E76;&#x884C;&#x5904;&#x7406;&#x3001;&#x865A;&#x62DF;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x529F;&#x80FD;&#x5B8C;&#x5907;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x5927;&#x91CF;&#x9762;&#x5411;&#x7528;&#x6237;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p><strong>4&#xFF1A;&#x7B2C;&#x56DB;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#xFF08;1972&#x5E74;&#x81F3;&#x4ECA;&#xFF09;</strong></p>
<p>&#x5FAE;&#x578B;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8BDE;&#x751F;&#x662F;&#x8D85;&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x5E94;&#x7528;&#x7684;&#x76F4;&#x63A5;&#x7ED3;&#x679C;&#xFF0C;1975&#x5E74;&#x7B2C;&#x4E00;&#x53F0;&#x5546;&#x4E1A;&#x5316;&#x7684;&#x5FAE;&#x578B;&#x8BA1;&#x7B97;&#x673A; MITS Altair &#x95EE;&#x4E16;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x4E86;Intel&#x516C;&#x53F8;&#x7684;8080&#x82AF;&#x7247;&#xFF1B;</p>
<p>&#x65F6;&#x81F3;&#x4ECA;&#x65E5;&#xFF0C;&#x5954;&#x817E;&#x7CFB;&#x5217;&#x5FAE;&#x5904;&#x7406;&#x5668;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#xFF0C;&#x73B0;&#x5728;&#x5FAE;&#x578B;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4F53;&#x79EF;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#x3001;&#x6027;&#x80FD;&#x8D8A;&#x6765;&#x5F3A;&#x3001;&#x53EF;&#x9760;&#x6027;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#x3001;&#x4EF7;&#x683C;&#x8D8A;&#x6765;&#x8D8A;&#x4F4E;&#x3001;&#x5E94;&#x7528;&#x8303;&#x56F4;&#x8D8A;&#x6765;&#x8D8A;&#x5E7F;&#xFF0C;&#x52A0;&#x4E0A;&#x5B8C;&#x5584;&#x7684;&#x7CFB;&#x7EDF;&#x8F6F;&#x4EF6;&#x3001;&#x4E30;&#x5BCC;&#x7684;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x548C;&#x5546;&#x54C1;&#x5316;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5927;&#x91CF;&#x6D8C;&#x73B0;&#xFF0C;&#x901A;&#x4FE1;&#x6280;&#x672F;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x7684;&#x98DE;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x4F7F;&#x5F97;&#x8BA1;&#x7B97;&#x673A;&#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x5927;&#x53D1;&#x5C55;&#x7684;&#x9636;&#x6BB5;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x6700;&#x4E3A;&#x663E;&#x8457;&#x7684;&#x7279;&#x5F81;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E86;&#x5927;&#x89C4;&#x6A21;&#xFF08;1000-10000&#xFF09;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x548C;&#x8D85;&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#xFF08;10000&#x4EE5;&#x4E0A;&#xFF09;&#xFF1B;&#x4F7F;&#x7528;&#x5927;&#x5BB9;&#x91CF;&#x7684;&#x534A;&#x5BFC;&#x4F53;&#x4F5C;&#x4E3A;&#x5185;&#x5B58;&#x50A8;&#x5668;&#xFF1B;&#x5728;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x65B9;&#x9762;&#x8FDB;&#x4E00;&#x6B65;&#x53D1;&#x5C55;&#x4E86;&#x5E76;&#x884C;&#x5904;&#x7406;&#x3001;&#x591A;&#x673A;&#x7CFB;&#x7EDF;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x7CFB;&#x7EDF;&#xFF1B;&#x5728;&#x8F6F;&#x4EF6;&#x65B9;&#x9762;&#x63A8;&#x51FA;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x6807;&#x51C6;&#x7B49;&#x3002;</p>
<p><strong>5&#xFF1A;&#x7B2C;&#x4E94;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;</strong></p>
<p>&#x4E94;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x5C1A;&#x5728;&#x7814;&#x5236;&#x4E4B;&#x4E2D;&#xFF0C;&#x7814;&#x7A76;&#x76EE;&#x6807;&#x662F;&#x8BD5;&#x56FE;&#x6253;&#x7834;&#x8BA1;&#x7B97;&#x673A;&#x73B0;&#x6709;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x4F7F;&#x5F97;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x591F;&#x5177;&#x6709;&#x50CF;&#x4EBA;&#x90A3;&#x6837;&#x7684;&#x601D;&#x7EF4;&#x3001;&#x63A8;&#x7406;&#x548C;&#x5224;&#x65AD;&#x80FD;&#x529B;&#xFF08;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF09;&#x3002;</p>
<script>
        document.querySelectorAll('.github-emoji')
          .forEach(el => {
            if (!el.dataset.src) { return; }
            const img = document.createElement('img');
            img.style = 'display:none !important;';
            img.src = el.dataset.src;
            img.addEventListener('error', () => {
              img.remove();
              el.style.color = 'inherit';
              el.style.backgroundImage = 'none';
              el.style.background = 'none';
            });
            img.addEventListener('load', () => {
              img.remove();
            });
            document.body.appendChild(img);
          });
      </script>
        </div>

        <blockquote class="post-copyright">
    <div class="content">
        
<span class="post-time">
    最后更新：<time datetime="2022-05-27T01:37:50.116Z" itemprop="dateUpdated">2022-05-27 09:37:50</time>
</span>


        
        原文链接：<a href="/posts/217dc297/" target="_blank" rel="external">https://marnm.github.io/posts/217dc297/</a>
        
    </div>
    <footer>
        <div onclick="location.href='https://marnm.github.io'">
            <img src="/img/avatar.gif" alt="Echo">
            <a>Echo</a>
        </div>
    </footer>
</blockquote>

        
    <div class="page-reward">
        <nav class="myreward">
            <a id="rewardBtn" href="javascript:;"><span>打&nbsp;赏</span><span>装成好像很多人打赏的样子</span></a>
        </nav>
    </div>



        <div class="post-footer">
            

            
<div class="page-share-wrap">
    

<div class="page-share" id="pageShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://marnm.github.io/posts/217dc297/&title=《计算机概述》 — Deops's blog&pic=https://marnm.github.io/img/avatar.gif" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://marnm.github.io/posts/217dc297/&title=《计算机概述》 — Deops's blog&source=计算机概述
今天1024，浅谈以下计算机历史….

计算机发展的历史自古以来人类就在不断地发明和改进计算工具，从结绳计数到算盘，计算尺，手摇计算机，直到1..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://marnm.github.io/posts/217dc297/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《计算机概述》 — Deops's blog&url=https://marnm.github.io/posts/217dc297/&via=https://marnm.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://marnm.github.io/posts/217dc297/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>



    <a href="javascript:;" id="shareFab" class="page-share-fab waves-effect waves-circle">
        <i class="icon icon-share-alt icon-lg"></i>
    </a>
</div>



        </div>
    </div>

    
<nav class="post-nav flex-row flex-justify-between">
  
    <div class="waves-block waves-effect prev">
      <a href="/posts/c45f2736/" id="post-prev" class="post-nav-link">
        <h4 class="title">
          上一篇：SQL Server 2008安装配置
        </h4>
      </a>
    </div>
  

  
    <div class="waves-block waves-effect next">
      <a href="/posts/dded0e80/" id="post-next" class="post-nav-link">
        <h4 class="title" data-hover="下一篇：运维发展史">下一篇：运维发展史</h4>
      </a>
    </div>
  
</nav>



    
    

    

    


</article>

</div>

        <footer class="footer">
    <div class="footer-content">
        <span class="power">
            <i class="icon icon-lg icon-copyright"></i>
            2022
            <i class="icon icon-lg icon-heart"></i>
            <a href="https://marnm.github.io">marnm.github.io</a>
            <br>
            Power by
            <a href="https://hexo.io/" target="_blank" rel="external nofollow">Hexo</a>&nbsp;·&nbsp;
            Theme
            <a class="tomotoeslink" href="https://github.com/tomotoes/hexo-theme-tomotoes/" target="_blank" rel="external nofollow">tomotoes</a>
        </span>

        <br>

        <span id="RunTime" style="color:#a7a7a2;"></span>
        <br>

        <span>
            

        </span>
        <br>

        <span class="license"><a target="_blank" rel="license" href="https://creativecommons.org/licenses/by-nc-sa/4.0/deed.zh">博客内容遵循 知识共享 署名 - 非商业性 - 相同方式共享 4.0 国际协议</a></span>
    </div>
</footer>

    </main>
    
        
<div id="reward" class="page-modal reward-lay">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <h3 class="reward-title">
        <i class="icon icon-quote-left"></i>
        <span>感谢您的鼓励支持！</span>
        <i class="icon icon-quote-right"></i>
    </h3>
    <div class="reward-content">
        
        <div class="reward-code">
            <img id="rewardCode" data-img="/img/dog.png" alt="打赏二维码">
        </div>
        
        <label class="reward-toggle">
            <input id="rewardToggle" type="checkbox" class="reward-toggle-check" data-wechat="/img/wechat.png" data-alipay="/img/alipay.png">
            <div class="reward-toggle-ctrol">
                <span class="reward-toggle-item wechatPay">&nbsp;&nbsp;微信&nbsp;&nbsp;</span>
                <span class="reward-toggle-item alipayPay">支付宝</span>
            </div>
        </label>
        
        <i class="icon icon-caret-up"></i>
    </div>
</div>


    
    <div class="mask" id="mask"></div>
<a href="javascript:;" id="gotop" class="waves-effect waves-circle waves-light"><span class="icon icon-lg icon-chevron-up"></span></a>



<div class="global-share" id="globalShare">
    <ul class="reset share-icons">
      <li>
        <a class="weibo share-sns" target="_blank" href="http://service.weibo.com/share/share.php?url=https://marnm.github.io/posts/217dc297/&title=《计算机概述》 — Deops's blog&pic=https://marnm.github.io/img/avatar.gif" data-title="微博">
          <i class="icon icon-weibo"></i>
        </a>
      </li>
      <li>
        <a class="weixin share-sns wxFab" href="javascript:;" data-title="微信">
          <i class="icon icon-weixin"></i>
        </a>
      </li>
      <li>
        <a class="qq share-sns" target="_blank" href="http://connect.qq.com/widget/shareqq/index.html?url=https://marnm.github.io/posts/217dc297/&title=《计算机概述》 — Deops's blog&source=计算机概述
今天1024，浅谈以下计算机历史….

计算机发展的历史自古以来人类就在不断地发明和改进计算工具，从结绳计数到算盘，计算尺，手摇计算机，直到1..." data-title=" QQ">
          <i class="icon icon-qq"></i>
        </a>
      </li>
      <li>
        <a class="facebook share-sns" target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https://marnm.github.io/posts/217dc297/" data-title=" Facebook">
          <i class="icon icon-facebook"></i>
        </a>
      </li>
      <li>
        <a class="twitter share-sns" target="_blank" href="https://twitter.com/intent/tweet?text=《计算机概述》 — Deops's blog&url=https://marnm.github.io/posts/217dc297/&via=https://marnm.github.io" data-title=" Twitter">
          <i class="icon icon-twitter"></i>
        </a>
      </li>
      <li>
        <a class="google share-sns" target="_blank" href="https://plus.google.com/share?url=https://marnm.github.io/posts/217dc297/" data-title=" Google+">
          <i class="icon icon-google-plus"></i>
        </a>
      </li>
    </ul>
 </div>


<div class="page-modal wx-share" id="wxShare">
    <a class="close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p class="wechatshare">扫一扫，分享到微信</p>
    <img src="data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAK4AAACuCAAAAACKZ2kyAAABvklEQVR42u3aS27DMAwFwNz/0inQbWD3UZQYFxitDCO2R1kQ/Oj1itf7d31e39/5vH//1LaFi4vb5r5vV0K8+n3n/uWGcXFxB7lJ8Eo+nASs5O+4vI+Li/sw7lq6c5+l4OLi/nfuVdjqJDS4uLhP5ibFTweUBLLNtRouLm6D22mY7roe6u/i4uK2pxLVgFJNXMpfx8XFHeFWWxtJYzRPbtbKIVxc3EnufSJS3dIiJdk2Li7uILcTsPqNkoIHFxf3MDcPWHnYysubciDDxcUd4eZJTD72yJ+qjm9xcXEnudUkpjoIycuhxcEqLi7uMW5/WNIpdcrDV1xc3MPcagFzIkgVGqy4uLgj3LW2aXWAmm8vOsKFi4t7jHu/g7zRmbxnMWDh4uKOc/MAVG2b7mq4/NHfxcXFPcBdK136xdJiaxUXF3eQ+yquKnpXQYWLizvJzVfeQMnfUx6s4uLiHuZWA0qSylQLoWozBRcXd4a7Frw65yKqyRAuLu63uNUjEdXomKcyUX8XFxf3MdzOh6uHPC6/gouL+0huPvyojmSi1AoXF3eQu9bsqEI7jRhcXNxJbvXhXePY6MgFLi7uNPcH4jR2nWHFCUQAAAAASUVORK5CYII=" alt="微信分享二维码">
</div>




    <!-- waves按钮特效 -->
<script src="//cdn.bootcss.com/node-waves/0.7.4/waves.min.js"></script>

<!-- 主题配置脚本 -->
<script>
var BLOG = { ROOT: '/', SHARE: true, REWARD: true };
</script>

<!-- jquery -->
<script src="/js/jquery.min.js?v=3.0"></script>

<!-- 搜索 -->

<div class="search-panel" id="search-panel">
    <ul class="search-result" id="search-result"></ul>
</div>
<template id="search-tpl">
<li class="item waves-block waves-effect" onclick="location.href='{path}'">
    <div class="title ellipsis" title="{title}">{title}</div>
</li>
</template>


<!-- main博客脚本 -->
<script src="/js/main.min.js?v=3.0"></script>

<!-- 动画&配置 -->
<script src="/js/script.min.js?v=3.0"></script>

<!-- 脚本管理 -->
<script>

if(window.innerWidth > 800){
	/* 3D标题 */
	$(".content-header").on("mousemove", threedee);

	/* 底部追随鼠标 */
	$(".footer").hover(2);

	/* gotop键的涟漪 */
	$("#gotop").hover(1);

	/* 赞赏的粒子雨 */
	$("#reward").hover(3);

	/* 微信公众号的底部渲染 */
	$("#wechat").hover(4);

    /* 标题跳动 */
    $(".archivestitle").bumpyText();

	/* 图片点击放大 */
	const postimg = jQuery(".post-content img:not(.github-emoji)");
	postimg.on("click",function(){

		mask.classList.add("in");
		main.classList.add("Mask");
		menu.classList.add("Mask");
		var myimg = this.cloneNode(true);
		myimg.classList.add("imgShow");

		setTimeout(function(){
			jQuery(myimg).animate({
				opacity:"1"
			},1000);
		},0);

		document.body.appendChild(myimg);

		myimg.onclick=function(){
			document.body.removeChild(myimg);
			mask.classList.remove("in");
			main.classList.remove("Mask");
			menu.classList.remove("Mask");
		};

	});

}

/* 名字跳动 */
$("#name").bumpyText();


/* 网站运行时间 */
setInterval(function () {
	setTime("2019/01/01");
}, 1000);

/* 文章块的淡出 */
postshow();

/* 座右铭 */

   getHitokoto();



/* 粘贴提示 */
G($(".post-content"), location.href, "Echo");


/* 控制台 */
if (window.console && window.console.log) {
	setTimeout(function () {
		console.log("\n %c 一个坏掉的番茄 %c  © Simon Ma  http://tomotoes.com \n\n", "color:#FFFFFB;background:#1abc9c;padding:5px 0;border-radius:.5rem 0 0 .5rem;", "color:#FFFFFB;background:#080808;padding:5px 0;border-radius:0 .5rem .5rem 0;");
	}, 0);
}

</script>




<!-- 公式渲染 -->



<!-- 不蒜子 -->


</body>
</html>
